<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/06/car-studiranja.html">Previous</a>
&nbsp; 
<a href="../../../index-16.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/06/bajgorologija-ii-polozena.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Bakir i dedo</h3>
<div class='post_info'>
<span class='post_time'>July 21 2010,  2:08 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'>

<p>Imam troje djece. I sve ih volim &hellip; posebno(*).</p>
<p>Svako moje djete je drugačije. Al' ono ba&scaron; drugačije. Fizički su slični. Isti &ldquo;&scaron;nit&rdquo;.</p>
<p>Po pona&scaron;anju su međutim potpuno različiti. Samra je &ldquo;direktorica&rdquo;, Faruk &ldquo;kauboj&rdquo;, a Bakir &ldquo;mislilac&rdquo;.</p>
<p>Neću sada obja&scaron;njavati &scaron;ta sam pod tim mislio, jer bi do ovoga &scaron;to sam naumio napisati do&scaron;ao tek za dva dana &hellip;</p>
<p><!--more--></p>
<h2>Dedin 72. rođendan</h2>
<p>Juče je bio dedin rođendan (op. aut moj babo). Bakir je mahsuz do&scaron;ao  kući (bio je kod dede i nene na konaku ovih dana) da pripremi za dedu  poklon.</p>
<p>I onda je on počeo po kući hodati k'o Baltazar i govoriti &scaron;ta će dedi pokloniti: &ldquo;Kristalno cvijeće, prsten &hellip;&rdquo;</p>
<p>Na sve te njegove prijedloge Dženana je odgovarala: &ldquo;To se dedama ne  poklanja. To se mu&scaron;karcima ne poklanja &hellip;&rdquo;. Objasnila mu je kako svi  zajedno trebamo otići u prodavnicu i kupiti dedi ne&scaron;to čestito.</p>
<h2>Bakirov poklon</h2>
<p>Bakira je to naljutilo: &ldquo;Ja mu neću ni&scaron;ta kupovati !&rdquo;</p>
<p>Sva sreća, Dženana je ubrzo sa Farukom iza&scaron;la iz kuće. Bakir i ja smo ostali sami.</p>
<p>Ja sam opet bio k'o drogiran od vrućine i gripe.</p>
<p>Bakir je napokon na&scaron;ao mir da pripremi svoj poklon. Ja sam onako &ldquo;obalje&scaron;ten&rdquo; sa svim njegovim prijedlozima bio saglasan :(</p>
<p>Prilazio mi je svako malo i tražio: da mu odmotam ljepilo, da mu skinem celofan, da mu prebrojim nekakve karte &hellip;</p>
<p>Sve sam to odrađivao u polusnu &hellip; Čuo sam kako priča sa dedom na telefon i ne&scaron;to ga ispituje: &ldquo;Koliko ti sada <strong>tačno</strong> godina ima&scaron; ?&rdquo;</p>
<p>Nakon sahat-dva on je svoj poklon zavr&scaron;io.</p>
<p>Na vrhu je bila čestitka ispisana na žutom postit-u: &ldquo;Dedo sretan ti 72 rođendan, Bakir&rdquo;.</p>
<p>Ispot svega se nazirala nekakva guta od aluminijske folije i ljepila &hellip;  &ldquo;Ma super&rdquo;, pomislim: &ldquo;&Scaron;ta god da je stpao unutra, dedo će biti happy.&rdquo;</p>
<h2>Na&scaron; poklon</h2>
<p>Nisam ljubitelj rođendana niti rođendanskih proslava. Da se mene pita nikada me niko ne bi mahsuz zvao i čestitao mi rođendan.</p>
<p>Za moju Dženanu opet, rođendani su bitna stvar. Uvijek se potrudi oko  odabira poklona drugima. Ja sam po tom pitanju opet totalna &ldquo;truba&rdquo;.</p>
<p>Ja sam juče pride gripe jedva na nogama hodao.  Predložio sa  da  odemo dedi i neni na kahvu, a poklon možemo i drugi put uzeti. Pri tome  sam znao da će dedi (&scaron;ta god da je ovaj spremio) Bakirov poklon biti  sigurno dovoljan.</p>
<p>Međutim, Dženana se sa tim nije složila: &ldquo;Nećemo ni ići ako nema poklona!&rdquo;.</p>
<p>Malo je falilo da kažem: &ldquo;Dobro, ti nemoj ni ići&rdquo;, ali sam to  pre&scaron;utio jer mi je sljedeća misao bila: &ldquo;Stvarno si bezveze, tebi je  mrsko babi otići kupiti poklon, a tvojoj ženi nije&rdquo;.</p>
<p>I tako mi odosmo u BBI centar. Tamo smo, prema Dženaninom scenariju  naravno, napravili jedan miks prirodnih sokova iz badem butika, gurabija  iz čokolaterije i sve nam to gospođa u čokolateriji fini spakova u  jednu lijepu ko&scaron;aricu. Dobili smo poklon koje je pro&scaron;ao Dženanin quality  control :). Ekstra. Usput, ko&scaron;arica je stvarno super izgledala.</p>
<h2>Podjela poklona</h2>
<p>Problem kod mog babe je to &scaron;to od njega nikad nisi mogao čuti da mu ne&scaron;to treba(**).</p>
<p>I mi mu dajemo svoj poklon, a on standardno komentari&scaron;e sa vrata: &ldquo;Ma djeco, &scaron;ta ste to kupovali &hellip;&rdquo;.</p>
<p>Nakon toga bakirov poklon. E to je već ne&scaron;to drugo &hellip; Idemo to otvoriti u dnevnoj sobi.</p>
<h2>&Scaron;ta je u stvari Bakirov poklon ?</h2>
<p>Bakir mrda vilicom. E sad ga jo&scaron; boli i stomak. Njegove standardne reakcije kad ima tremu.</p>
<p>Dedo čita poruku na postit-u: &ldquo;Dragi dedo &hellip; Bakir&rdquo;. Ma njemu vi&scaron;e ni&scaron;ta od toga i ne treba.</p>
<p>Idemo dalje: jedan red selotejp trake, drugi red &hellip; Bakir je to zamandalio &hellip; Otvara se prvi smotuljak: <em>karte</em>. Hah kakve karte ?</p>
<p>Bakir sada obja&scaron;njava: <strong>&ldquo;Kada sabere&scaron; ove karte dobije&scaron; 72&rdquo;</strong>. I gleda dedu. Dedo mjenja izraz lica.</p>
<p>To je neki izraz lica koji on rijetko napravi. To je izraz koji  ujedno pokazuje i divljenje i čuđenje i ljubav &hellip;. Tada se dedo uvijek  zajapuri i u&scaron;uti &hellip;</p>
<p>Dedo broji karte. U nevjerici klima glavom. Pa opet broji karte. Jedva ga čuje&scaron; da kaže: &ldquo;Čovječe, stvarno 72&rdquo;.</p>
<p>Bakir se smirio. On prepoznaje tu dedinu reakciju. Zna da je  &ldquo;trefio&rdquo;. Sada ga je već nervoza pro&scaron;la. Pomaže dedi da odmotaju i drugi  smotuljak.</p>
<p>Otvara kutijicu sa dva zlatnika(***).</p>
<p>Bakir nastavlja sa obja&scaron;njenjima: &ldquo;E ovdje nisam mogao dobiti 72  (op.aut. zlatinic su apoena 50 i 20, on je trazio apoen 2), ali sam sam  ti odabrao svoje najbolje zlatnike&rdquo;.</p>
<p>Dedo je totalno &ldquo;pjaf&rdquo;. Ono crvenilo se jo&scaron; vi&scaron;e pojačava.</p>
<p>Ja i Dženana u čudu. Gdje je to njemu sve palo na pamet ?! Ma kome bi bi takvo &scaron;to uop&scaron;te palo na pamet ?!</p>
<p>Kada je počela priča o poklonima, Bakir je prokomentarisao: &ldquo;&Scaron;ta god da ja poklonim dedi, on će reći: Ma ti si moj poklon&rdquo;.</p>
<p>To naravno kod druge unučadi izaziva ljubomoru (kod moje Samre prve  :)), ali to je jednostavno tako. Svi oko dede moraju prihvatiti tu  činjenicu i tačka. Bakir ima poseban status.</p>
<p>Kad je sve to tako, Bakir nema potrebe da se bori za svoj status. Ono  &scaron;to upravo kod njega fascinira jeste činjenica da su sve te njegove  geste <strong>autentične</strong>. On to jednostavno želi. To sve dolazi iz njega.</p>
<p>Moj Bakir je stvarno poseban. Da mu dragi Allah da svako dobro.</p>
<h2>After dedo&rsquo;s party</h2>
<p>Jutros za kahvom Dženana je prokomentarisala: &ldquo;Ko će od dede živjeti nakon ovog poklona &hellip;. :)&rdquo;.</p>
<p>Op&scaron;te poznata stvar je da svako ko želi sa dedom biti &ldquo;dobar&rdquo; mora  predano slu&scaron;ati njegove priče o Bakiru. Mogao bih mu predložiti da i on  blogira. Pa kad pretjera, čitalac može koji komad priče i preskočiti :)</p>
<p>Svi smo bili ubjeđeni da nema tog poklona koji bi dedu &ldquo;oborio s  nogu&rdquo;. Ove godine se to ipak desilo. Dedo je dobio najljep&scaron;i poklon do  sada.</p>
<p>&Scaron;to se tiče na&scaron;eg poklona, moji &ldquo;hahari&rdquo; to u roku od po sahata rasturili. Ali dobro, to je standardni scenarijo.</p>
<p>Od konvencionalnih poklona najbolje ti je kupiti ne&scaron;to &scaron;to će se na  kraju moći dati unučadima. Kod moje djece je stvar jo&scaron; lak&scaron;a &ndash; ne treba&scaron;  im davati, oni sami uzmu :)</p>
<hr />
<p>(*) Ove tri tačke su rezultat zastoja u pisanju :). Kako objasniti  ljubav prema svoj djeci ?! Taj osjećaj definitivno zaslužuje poseban  termin. Dženana voli reći to je jedina bezuslovna ljubav. Meni ni to  nije obja&scaron;njenje za koje bih rekao: &ldquo;E, ba&scaron; tako&rdquo;.</p>
<p>(**) Dženana je prokomentarisala kad smo i&scaron;li u kupovinu &ldquo;&Scaron;ta kupiti  čovjeku koji samo poklanja, a za sebe nikad ni&scaron;ta ne traži ?&rdquo;. Pričamo  naravno u okviru porodičnih odnosa.</p>
<p>(***) Naravno nisu to pravi zlatnici nego nekakvi strani novčići koje on sakuplja i stavlja u svoju seharu.</p>

</div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>h_bakir, moj_babo</div>
</div>
<div class='post_responses'>
<h4>1025 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
