<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/06/sta-trebamo-uciti-na-tehnickim-fakultetima.html">Previous</a>
&nbsp; 
<a href="../../../index-15.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/06/put-na-ispit.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Rethink software development, rethink u Bosni</h3>
<div class='post_info'>
<span class='post_time'>July  3 2010, 11:20 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'>

<h1>Robert Martin &ndash; Rethink software development, rethink u Bosni</h1>
<p>Čitao sam o <a href="http://golang.org/">go language-u</a> i naletim na ova youtube screencast.</p>
<p><iframe src="http://www.youtube.com/embed/mslMLp5bQD0?wmode=transparent" allowfullscreen frameborder="0" height="417" width="500"></iframe></p>
<p>Kako čovjek radi prezentaciju &hellip;</p>
<p>Oouuu &hellip;</p>
<p><!--more--></p>
<p>Martin priča o tome da je u domenu hardware-a od 1960-danas do&scaron;lo do napretka reda veličine **10<sup>25***.</sup></p>
<p>A software-a &hellip; praktično ni&scaron;ta !</p>
<p>Čovječe, ne znam &scaron;ta me je vi&scaron;e impresioniralo: način ili sam sadržaj izlaganja.</p>
<h2>Na&scaron; glavni problem: Mi čak i ne znamo da ne znamo</h2>
<p>I onda sjetim se knjiga iz informatike za osnovnu &scaron;kolu, i neizostavne <a href="/bajgorologija-ii-polozena">bajgorologije</a>.</p>
<p>Ljudi moji, koje smo mi neznalice &hellip;</p>
<p>Ali opet, <strong>nije glavni problem u neznanju</strong>.</p>
<p>Martin ne nudi rje&scaron;enje problema koji obrađuje. On ga ne zna.</p>
<p>On uočava da tu ne&scaron;to ne &scaron;tima, postavlja pitanja, daje prijedloge, analizira, traži moguća rje&scaron;enja &hellip;</p>
<p>A mi &hellip; na&scaron; problem je u tome &scaron;to ne znamo da pojma nemamo.</p>
<h2>Ko je kriv ?</h2>
<p>Za na&scaron;u bijedu su nam krivi uvijek drugi: jednima Srbi, drugima  četnici, trećima komunisti, četvrtima Turci i muslimani, petima &lsquo;pravi&rsquo;  Hrvati, &scaron;estima krivi &ldquo;Hrvati&rdquo; koji sebe zovima Bosanci (pa napravi  search-replace predhodne teze Hrvati-Srbi), pa onda Bo&scaron;njaci koji ne  podržavaju Reisa, pa oni koji podržavaju Reisa, pa Vehabije &hellip; Ako čega  imamo napretek, to su definitivno <strong>krivci</strong>. A lijepa stvar je u tome da su ti krivci uvijek &ldquo;onamo oni&rdquo;.</p>
<p>Krivi smo <strong>mi</strong>. Krivo je  <strong>na&scaron;e</strong> neznanje.</p>
<h2>Poruka za Reisa</h2>
<p>Sjetim se kako je pro&scaron;le hefte u Bugojnu na bigajri haak čovjek pogin'o. Policajac. &ldquo;Na&scaron;&rdquo; od &ldquo;na&scaron;ih&rdquo;.</p>
<p>Ajoj. Ovi su bomba&scaron;i &ldquo;na&scaron;i&rdquo; ? Ustvari oni su &ldquo;na&scaron;i&rdquo;, al' su i teroristi. Tako su mi barem objasnili na&scaron;i političari.</p>
<p>Tako sam i na pro&scaron;loj džumi čuo.</p>
<p>Ekstremisti iz Saudije im zatrovali glave ?!</p>
<p>&ldquo;Mi&rdquo; znači nismo krivi &hellip; Kriva je Saudija &hellip; Uh dobro je da nismo mi.</p>
<p>E pa Reise krivi smo i <strong>mi</strong>. Kriv je i Rijaset. Kriva je i Islamska zajednica.</p>
<p>Mi smo ti koji su svojim djelovanjem i nedjelovanjem doveli dovdje gje smo.</p>
<p>Rethink Reise, Rethink Islamska zajednico !</p>
<h2>Poruka za bomba&scaron;e</h2>
<p>Po&scaron;to se ta na&scaron;a &ldquo;zatrovana braća&rdquo;, opasana bombama, poziva na časni  Qur'an i sunnet Poslanika s.a.v.s., najvi&scaron;e me interesuje kako su kako  oni sebi smjestili ove činjenice:</p>
<ol>
<li>Poslanik s.a.v.s. je sa mu&scaron;ricima (nevjernicima) pravio ugovor</li>
<li>Poslanik s.a.v.s. na takvu deredžu(nivo, stepen) stavljao položaj  kom&scaron;ije, da su ashabi mislili da će kom&scaron;ije dobiti udio u nasljedstvu !</li>
</ol>
<p>Neću reći &ldquo;rethink&rdquo; bomba&scaron;i. Za vas je pretpostavljam kasno.</p>
<p>A na kraju krajeva, ako ni mi &ldquo;normalni&rdquo; nismo kadra za takvo &scaron;to, pa kako mogu od vas takvo &scaron;to tražiti ?!</p>
<h2>Rethink u politici</h2>
<p>Kada bi neko rekao: &ldquo;Ljudi: mi pojma nemamo. Mi smo dno-dna. Hajmo  sve ovo do sada označiti sa &lsquo;Puj pike &ndash; ne važi&rsquo;. Haj'mo se presabrati.  Haj'mo vidjeti &scaron;ta možemo, a &scaron;ta ne možemo. Hajmo napokon prestati  lagati i sebe i druge &hellip;&rdquo;.</p>
<p>Ako slučajno čujete nekoga ko u predstojećoj predizbornoj kampanji bude pričao ovakve stvar, javite mi da <a href="/politicke-price">glasam za njega</a>.</p>
<p>Ali nemojte to mje&scaron;ati sa bacanjem &ldquo;kuka i motika&rdquo; na političke suparnike.</p>
<p>To svako može. Rethink počinje od sebe.</p>
<p>Rethinkeru nije cilj da pokaže da njegov protivnik ne valja.</p>
<p>Rethinker se fokusira na <strong>ono &scaron;to on može</strong> učiniti. On se ne boji reći &scaron;ta <strong>ne može</strong> učiniti. Pa i po cijenu toga da mu neki papak uskrati dragocjeni glas.</p>
<p>Rethinker ne prodaje ublehe.</p>
<h2>Rethink, rethink, rethink</h2>
<p>Problem ovog dru&scaron;va, gdje god da zaviri&scaron; (nauka, politika, sport) je nedostatak rethink-a.</p>
<p>&ldquo;Rethink&rdquo; jedini mehanizam koji može pokrenuti promjene.</p>
<h2>Zaključak</h2>
<p>E pa stvarno &hellip;</p>
<p>Od software, preko Reisa i bomba&scaron;a zavr&scaron;im sa raspredanjem bosanske politike.</p>
<p>Lud, pa eto ti.</p>
<p>Rethink Ernade, rethink !</p>
<h2>Terminologija</h2>
<p>U tekstu su kori&scaron;teni ovi termini:</p>
<ul>
<li>&ldquo;mi&rdquo; &ndash; glupi, ludi Bosanci. Na&scaron;e kabadahije nisu &ldquo;mi&rdquo;. Njima je i sada sasvim dobro.</li>
<li>&ldquo;Martin&rdquo; =&gt; pametni svijet.</li>
</ul>

</div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, rethink, software_development</div>
</div>
<div class='post_responses'>
<h4>837 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>