<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2012/06/kako-promijeniti-stanje-bosanskog-poslovnog-i-13566.html">Previous</a>
&nbsp; 
<a href="../../../index-2.html">Index</a>
&nbsp; 
<a href="../../../posts/2012/05/trazi-se-menadzer-prodaje-bringout.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Kako promijeniti stanje bosanskog (poslovnog) IT-a ?</h3>
<div class='post_info'>
<span class='post_time'>June 10 2012,  2:32 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>
<p>U jednoj interesantnoj <a href="http://forum.linux.org.ba/viewtopic.php?pid=55372#p55372">IT diskusiji</a>&nbsp;@testni_hamo2 je između ostalog rekao:</p>
<p>
<p>Ja moram ovdje simpatisati sa firmama. Naime nabaviti posao jeste glavna stvar. Dzaba tebi sto si kvalitetan ako nemas posla.&nbsp;</p>
<p>Kvalitet nije preduslov za finansijski uspjeh, a finansijski uspjeh je poenta firme. Informatika je grana koja sama po sebi nema smisla.&nbsp;</p>
<p>Mi smo uglavnom vrijedni onoliko koliko mozemo pomoci drugim privrednim granama da poboljsaju svoje performanse (ukoliko ignorisemo consumer trziste - koje je finansijski procentualno manje).&nbsp;</p>
<p>Problem kod nas je sto ostatak privrede nije uopste toliko jak - a i oni koji su jaki nisu dovoljno zreli da znaju kako da iskoriste informatiku u svom poslovanju.</p>
</p>
<p style="text-align: left;">Senad (testni_hamo2) je krenuo od par ključnih stvari koje mi informatičari često zaboravimo.</p>
<p style="text-align: left;">IT rje&scaron;enja su radi klijenata. Poslovna IT rje&scaron;enja su u funkciji poslovanja.</p>
<p style="text-align: left;">Ukratko IT je alat. Ako se taj alat ne stavi u funkciju, IT rje&scaron;enje će sa aspekta korisnika biti zalud utro&scaron;en novac.</p>
<p>Razumjevanje i percepcija IT-a unutar bosanskih kompanija je u skladu sa stanjem privrede. Znači, niska.</p>
<p>Na&scaron;i potencijalni klijenti mahom ne prepoznaju IT kao način da unaprijede svoje poslovanje, da budu korak ispred konkurencije.&nbsp;</p>
<p>Velika "zasluga" takve percepcije često leže i u činjenici da mi - IT provajderi svojim klijentima ne nudimo korisna rje&scaron;enja.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Rje&scaron;enje vs software</strong></span></p>
<p>Često koristim termin IT rje&scaron;enje, pri čemu pravim razliku između rje&scaron;enja i samog software-a.</p>
<p>Kada si "open source" IT provajder, klijent mora razumjeti tu razliku razliku.</p>
<p>Naime softver koji mi nudimo je besplatan za kori&scaron;tenje.</p>
<p>Kupovinom na&scaron;ih rje&scaron;enja, kupac zajedno sa sofware-om kupuje na&scaron; "know-how".</p>
<p>Kupuje pravo na obuku, podr&scaron;ku i nadogradnju sistema.</p>
<p>Ova razlika kod software-a opće namjene nije toliko izražena. Međutim, poslovni software (ERP) je kompleksan i dinamičan.</p>
<p>Uzmite najbolji ERP software na dunjaluku pa ga hipotetčki odvojite od IT provajdera.</p>
<p>Dobićete stvar koja krajnjem korisniku ne može služiti ničemu.</p>
<p>Zato je od su&scaron;tinske važnosti za IT provajdera poslovnih rje&scaron;enja da njegov korisnik shvati da je software sam za sebe "mrtvo slovo na papiru", da se bez stalne interakcije klijent &lt;-&gt; provajder ne može napraviti dobro rje&scaron;enje.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Njegovo veličanstvo "BUG"</strong></span></p>
<p>Prije par dana sam u toku pregovora sa novim klijentom u&scaron;ao u diskusiju o <a href="http://www.bring.out.ba/novi-ugovor-o-podrsci-bringout-f18-model-podr">garancijama koje on ugovorom o podr&scaron;ci dobija od "bring.out", tačnije NE dobija</a>. Klijent je postavio logično pitanje..</p>
<p>U članu 10 nagla&scaron;avate kako klijentu praktično NE garantujete ni&scaron;ta ?! Kakav ste vi profesionalac ako mi ni&scaron;ta ne možete garantovati ?</p>
<p>Odgovorio sam:</p>
<p>Nakon člana 10. slijedi član 11. U njemu se navodi da ćemo sve poduzeti, u skladu sa principima struke, da u sve poduzmemo da gre&scaron;ke i probleme otklonimo.</p>
<p>&nbsp;</p>
<p>To je ono &scaron;to mi realno možemo garantovati. Smatramo da je to ono &scaron;to Vam realno bilo koji IT provajder&nbsp;</p>
<p>&nbsp;</p>
<p>Informatičari&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>Ja bih međutim takvo stanje u velikoj mjeri adresirao i "na du&scaron;u" nas informatičara. Moramo edukovati svoje klijente. Moramo vr&scaron;iti pritisak na državne institucije da bi se opća percepcija o IT-u promjenila.</p>
<p>&nbsp;</p>
<p>Uzmimo državu i državne institucije.</p>
<p>&nbsp;</p>
<p>Ako uzmemo da je visina IT budžeta konstanta, &nbsp;a da je raspored stavki unutar tog budžeta predmet IT strategije, i da sve to treba biti u funkciji određenih poslovnih ciljeva, brzo ćemo otvoriti mnoga vrata za projekte bazirane na otvorenim tehnologijama.</p>
<p>&nbsp;</p>
<p>Međutim, koliko god to nama koji smo usmjereni na otvorene tehologije to bilo očigledno, rezultati na tereni su manje-vi&scaron;e nula bodova.</p>
<p>&nbsp;</p>
<p>Jesu li "decision-maker"-i u državnim institucijama neznalice ? Najče&scaron;će jesu.</p>
<p>&nbsp;</p>
<p>Jesu li ti decision makeri pod uticajem Microsoft lobija ? Očigledno.</p>
<p>&nbsp;</p>
<p>Rasipaju li se državnim parama ? Nema dvojbe.</p>
<p>&nbsp;</p>
<p>Međutim, ako to je to prepoznato i jasno samo maloj grupi ljudi, ti "decision makeri" će moći rasipati državne pare do Sudnjeg dana.</p>
<p>&nbsp;</p>
<p>Ova priča se mora ponavljati i ponavljati. Bitno je stvoriti pritisak. Kada taj pritisak urgozi pozicije državnih činovnika, oni će slu&scaron;ati ono &scaron;to im se govori.</p>
<p>&nbsp;</p>
<p>Za&scaron;to sam u čitavoj ovoj priči toliko fokusiran na državu ? &nbsp;Zato &scaron;to je država nesporno generator ključnih privrednih procesa.</p>
<p>&nbsp;</p>
<p>Kada država pokrene veliku izgradnju puteva, to neminovno ima pozitivni uticaj na građevinarstvo kao privrednu granu. Međutim, ako je ta strategija izgradnje lo&scaron;e postavljena, onda će taj pozitivni uticaj na lokalno građevinarstvo biti minimalno. &nbsp;Projekat "sarajevske zaobilaznice" je odličan primjer u kome je država odigrala stvari da "gore ne može".</p>
<p>&nbsp;</p>
<p>Angažovala je nekog bjelosvjetskog me&scaron;etara koji je brzo bankrotirao i za sobom ostavio velike dugove prema domaćim firmama. Država je na tom projektu umjesto da pogura, mnoge domaće firme zavila u crno.&nbsp;</p>
<p>&nbsp;</p>
<p>Ako se sada prebacimo na IT sektor, projekti fiskalizacije i "legalizacije" su mogle ogromni pozitivan impact na domaći IT. Ali nisu.</p>
<p>&nbsp;</p>
<p>Projekti "legalizacije" u sinergiji sa nedavnom Windows-only "fiskalizacijom" postali su projekti monopolizacije.</p>
<p>&nbsp;</p>
<p>Pri tome niko u IT sektoru nije vrisnuo i rekao:</p>
<p>&nbsp;</p>
<p>Ljudi &scaron;ta nam ovo radite ?!</p>
<p>&nbsp;</p>
<p>Niko sa fakulteta koji se bave IT-om nije u javnom prostoru rekao: Ovo ne valja.&nbsp;</p>
<p>&nbsp;</p>
<p>Dapače, oni koji su to mogli reći su ubirali honorare u komisijama ovih projekata.&nbsp;</p>
<p>&nbsp;</p>
<p>Ali, pustimo se kuknjave. Ne pi&scaron;em zato da bih konstatovao na&scaron; jad i čemer.&nbsp;</p>
<p>&nbsp;</p>
<p>Pi&scaron;em zato &scaron;to smatram da je stvari moguće promjeniti aktivizmom. Javnost i na&scaron;e potencijalne klijente treba edukovati.</p>
<p>&nbsp;</p>
<p>To mogu uraditi samo informatičari. To za nas neće niko uraditi.</p>
<p>&nbsp;</p>
<p>Želim reći da sam na na&scaron;em "mikro" primjeru uočio da su promjene moguće.</p>
<p>&nbsp;</p>
<p>Obja&scaron;njavanjem klijentima, politkom cijena stvorili smo interes za na&scaron;im novim proizvodima.&nbsp;</p>
<p>&nbsp;</p>
<p>Tačno da je to izuzetno spor i zahtjevan proces. Tačno je da se ljudima stalno i stalno ponavljati da bi počeli razumjevati na&scaron;u ponudu.</p>
<p>&nbsp;</p>
<p>Tačno je da u ovom momentu u ovome &scaron;to radimo ima puno vi&scaron;e znoja nego li profita.&nbsp;</p>
<p>&nbsp;</p>
<p>Ali tačno je i to da smo u par mjeseci uspjeli napraviti velike promjene kod na&scaron;ih klijenata.</p>
<p>&nbsp;</p>
<p>Na&scaron; IT kapacitet je za te rezultate bio neophodan, ali ne i dovoljan. Bez upornog obja&scaron;njavanja klijentima mi bi se vrtili u beskonačnoj petlji jadikovki:</p>
<p>&nbsp;</p>
<p>Imamo dobra rje&scaron;enja, ali to neće niko da kupuje. Ljudi ne znaju, ljudi ne razmi&scaron;ljaju itd itd</p>
<p>&nbsp;</p>
<p>Nakon prvog objavljivanja detalja na&scaron;e nove ponude:</p>
<p>&nbsp;</p>
<p><a href="http://www.bring.out.ba/legalizacija-software-a-ubuntulinux-desktop-f">http://www.bring.out.ba/legalizacija-software-a-ubuntulinux-desktop-f</a>&nbsp;</p>
<p>&nbsp;</p>
<p>feedback korisnika je bio uglavnom "ne razumjemo".</p>
<p>&nbsp;</p>
<p>Pa smo počeli razgovarati sa klijentima, pokazivati taj čudnovati desktop bez "Windows" OS-a, program za tabelarne proračune koji nije "MS Excel", i ono &scaron;to na&scaron;e klijente najvi&scaron;e interesuje "F18" ERP rje&scaron;enje.&nbsp;</p>
<p>&nbsp;</p>
<p>Kada bi vidjeli da "F18" radi i na čudnovatom Ubuntu desktopu isto kao i na "Windows" desktopu, strah od nepoznatog bi se istopila kao led na suncu.</p>
<p>&nbsp;</p>
<p>Prije par dana sam radio seminarski iz predmeta "Projekat".</p>
<p>&nbsp;</p>
<p>Kao temu sam obradio koncept na&scaron;e nove ponude <a href="http://www.bring.out.ba/primjer-ponude-f18-ubuntulinux-novi-klijent">http://www.bring.out.ba/primjer-ponude-f18-ubuntulinux-novi-klijent</a></p>
<p>&nbsp;</p>
<p>Kada sam zavr&scaron;io radnju <a href="https://github.com/hernad/FIT_PRO/raw/master/latex/PRO_F18.pdf">https://github.com/hernad/FIT_PRO/raw/master/latex/PRO_F18.pdf</a></p>
<p>&nbsp;</p>
<p>uočio sam kako je obja&scaron;njavanje onoga &scaron;to nudimo uzelo najveći prostor u radu. Za&scaron;to ?</p>
<p>&nbsp;</p>
<p>Zato &scaron;to sam uočio da je najveća prepreka odabiru na&scaron;ih rje&scaron;enja u ovom momentu razumjevanje na&scaron;e ponude, a ne tehnologija sama po sebi.</p>
<p>&nbsp;</p>
<p>Mi&scaron;ljenja sam da bez ovakvog aktivizma nije moguće napraviti bilo &scaron;ta značajno na bosanskom IT trži&scaron;tu.</p>
<p>&nbsp;</p>
<p>Bez obzira na &nbsp; &nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>ponude</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&gt; That said - podrzavam sve informaticare koji odlaze jer to je win win situacija - ovi sto ostaju ce kao rezultat dobiti bolje uslove jer se smanjuje ponuda a potraznja ostaje ista ili raste</p>
</p></div>
<div class='post_responses'>
<h4>2 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
