<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/konkurs-za-posao-email-filter-100.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/07/komunikacijske-tehnologije-packet-tracer-zada.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Faruk, ne lupetaj molim te</h3>
<div class='post_info'>
<span class='post_time'>July 21 2011, 10:02 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Imam čudnu "furku". Kada se neko zove Samra, Faruk ili Bakir, uvijek prema njemu imam pozitivne predrasude.</p>
<p>Iz tog razloga me valjda "lupetanja" imenjaka moje djece jo&scaron; vi&scaron;e dojme.</p>
<p>Tako je bilo danas, čitajući uvodnik "Dana" od Faruka Borića pod naslovom "Nacija islama".</p>
<p>Ono Farukovih članaka &scaron;to sam do sada pročitao nije bilo ni nalik na ovaj posljednji. Do sada bih redovno, navijački ( u skladu sa pomenutom "furkom"), prokomentarisao:</p>
<blockquote class="posterous_short_quote">
<p>Pametan ovaj Faruk !</p>
</blockquote>
<p>&Scaron;ta me je to nanerviralo o ovom Farukovom članku ? To je ova rečenica:</p>
<blockquote class="posterous_medium_quote">
<p>Malo ko, zapravo niko se ne buni zbog činjenice da se filmska smotra i uz nju popratni sadržaji puni galame, ića i pića prilagođavaju lunarnom kalendaru, kako ne bi u najsvetijem mjesecu muslimanima bio naru&scaron;en ibadet i post ...</p>
</blockquote>
<p>Pa onda pomenu onaj nesretni Queer festival, obja&scaron;njavajući kako bi svaki potez koji naru&scaron;ava ramazan, za posljedicu mogao imati nasilje.</p>
<p>I sve to bi donekle čak i mogao "progutati" (lažem i ovo mi je previ&scaron;e) da ostatak članka nije posvetio "uklizavanjima" na&scaron;eg uvaženog Reisa u politiku, te u njegove gafove iz domena nadležnosti(*).</p>
<p>O svemu ovome je Faruk i ranije pisao. Koliko me sjećanje služi, upravo sam na sve te članke davao pozitivne komentare.&nbsp; Ali ovaj posljednji je ispao totalna "fula" !</p>
<blockquote class="posterous_short_quote">
<p>Kakve bolan Faruk ima veze pomjeranje SFF-a(**) sa Reisom i Reisovim gafovima ?</p>
</blockquote>
<p><!--more--></p>
<p>Jesi li ti Faruk s Marsa pao !? Prohoda&scaron; li ti gradom u vrijeme ramazana ? Grad u to vrijeme drugačije živi. Zar je to ne&scaron;to &scaron;to Sarajevo čini manje evropskim, manje tolerantnim, manje multietničkim !?</p>
<p>Izvini Faruk, al' si ga se sad nalupet'o samo tak'o. To &scaron;to si napisao ovako "smiksano" na jednom mjestu ispala je najobičnija <a href="/kakofonija">kakofonija</a>.</p>
<p>Je li ti doista smatra&scaron; da je ovo formula mirnog, multietničkog, evropskog Sarajeva:</p>
<blockquote class="posterous_short_quote">
<p>Muslimani, imate džamije. Tamo se posvetite ramazanu i&nbsp; ibadet činite do mile volje. &Scaron;ta će se de&scaron;avati u gradu, to nije va&scaron;a briga.</p>
</blockquote>
<p>Ako jeste, Faruk, ne lupetaj molim te.</p>
<p>S obzirom da si se deklarisao kao +Bo&scaron;njak&nbsp; -musliman, ja ti kao +Bo&scaron;njak +musliman predlažem slijedeće:</p>
<blockquote class="posterous_short_quote">
<p>Kada moj Reis ili moja IZ izvale neku "budale&scaron;tinu" ti ih skrpi koliko ti du&scaron;a želi, al mi na ramazan ne diraj !</p>
</blockquote>
<p>To je po meni formula koja bi trebala biti i po mojoj i po tvojoj mjeri.</p>
<p>&Scaron;to se tiče odluke organizatora SFF-a da termin festivala prilagođava ramazanu to je, ako sve ostalo stavimo na stranu,&nbsp; pametan poslovni potez. Organizatori SFF-a su očigledno prohodali Sarajevom tokom ramazana, te uočili da bi previ&scaron;e njihovih potencijalnih posjetilaca u terminima projekcija bilo na iftaru ili teraviji. A to valjda nije dobro za njihov posao.</p>
<p>Faruk, Faruk ...</p>
<p>---</p>
<p>(*) Reis poglavar bosanskih muslimana, kome se nerijetko "omakne" da se pona&scaron;a kao lider svih Bo&scaron;njaka. I tu je Faruk 100% u pravu. Vođe u Bo&scaron;njaka se biraju na političkim izborima, a ne na saboru IZ-a.</p>
<p>(**) Sarajevo film festival</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, dunjaluk</div>
</div>
<div class='post_responses'>
<h4>601 views and 1 response</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Jul 21 2011, 11:25 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Faruk, ne lupetaj molim te	Thu Jul 21 20:24:38 2011<br />From: 	<a href="mailto:hernad@bring.out.ba" rel="nofollow">hernad@bring.out.ba</a><br />To: 	<a href="mailto:dani@oslobodjenje.ba" rel="nofollow">dani@oslobodjenje.ba</a><br /><a href="http://hernad.bring.out.ba/faruk-ne-lupetaj-molim-te" rel="nofollow">http://hernad.bring.out.ba/faruk-ne-lupetaj-molim-te</a><p>Pozdrav,<br />---<br />Ernad Husremović</p></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
