<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/kako-knowhow-san-pretvoriti-u-stvarnost.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/07/faruk-ne-lupetaj-molim-te.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Konkurs za posao, email filter 100%</h3>
<div class='post_info'>
<span class='post_time'>July 22 2011, 12:27 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Na na&scaron; <a href="/it-poletarci-de-ste">konkurs za posao</a>&nbsp;nas je kontaktiralo 30-40 kandidata. Većina je prvi kontakt uspostavljala pozivom na telefon. Svakome smo rekli da aplikaciju za posao uputi putem email-a.&nbsp;</p>
<p>Njih manje od 10 ih je to i učinilo. &nbsp;U vrijeme kada je do&scaron;lo najvi&scaron;e poziva ja sam bio na odmoru.</p>
<p>Po povratku, nakon &scaron;to sam pročitao podne&scaron;ene aplikacija, odlučio sam svakom kandidatu postaviti par dodatnih pitanja email-om.</p>
<p><!--more--></p>
<p>Jedan kandidat je svaku riječ u rečenici pisao velikim slovom. Njemu sam odmah odgovorio:</p>
<p style="padding-left: 30px;"><em><span style="font-size: x-small;">Po&scaron;tovani, &nbsp;hvala Vam na podne&scaron;enoj aplikaciji.<br /></span><span style="font-size: x-small;">Na žalost, &nbsp;Va&scaron; profil za nas nije odgovarajući.&nbsp;<br /></span><span style="font-size: x-small;">Nadamo se da ćete u skoroj budućnosti naći odgovarajuće zaposlenje.</span></em></p>
<p>Ostalima sam&nbsp;postavio pitanje u skladu sa onim &scaron;to su napisali.</p>
<p>Ako je neko postavio referencu ranijeg posla koja je bila interesantna za nas, pitao sam ga: "Koji su va&scaron;i razlozi prestanka rada ?".</p>
<p>Mnogima sam postavio sljedeća pitanja:</p>
<p style="padding-left: 30px;"><em><span style="font-size: x-small;">Kojim uspjehom (po razredima) ste zavr&scaron;ili srednju &scaron;kolu ?&nbsp;<br /></span></em><em><span style="font-size: x-small;">Da li ste ponavljali razrede ?&nbsp;<br /></span></em><em><span style="font-size: x-small;">Koji je bio Va&scaron; omiljeni predmet ?&nbsp;<br /></span></em><em><span style="font-size: x-small;">Koje ocjene (po razredima) ste imali iz predmeta matematika i fizika ?</span></em></p>
<p>Jednom kandidatu sam postavio sljedeće pitanje:</p>
<blockquote class="posterous_short_quote">
<p>Prokomentari&scaron;ite sljedeću rečenicu: &nbsp;"Na mom računaru instaliran je "Ubuntu GNU/Linux 64 bit, 11.04 - natty"&nbsp;</p>
</blockquote>
<p>Javio se i jedan kolega - student FIT-a. &nbsp;On mi je u svom prvom obraćanju djelovao "nafurano" pa sam mu se obratio na sljedeći način:</p>
<p style="padding-left: 30px;"><em><span style="font-size: x-small;">U Va&scaron;oj aplikaciji sam stekao utisak da posao u na&scaron;oj firmi vidite prije svega kao "usputnu stanicu". Jesam li u krivu ?<br /></span></em><em><span style="font-size: x-small;">Ako nisam, interesuje me koje su va&scaron;e dugoročne amibicije i ciljevi ?<br /></span></em><em><span style="font-size: x-small;">Planirate li, recimo, odlazak u inostranstvo ili ne&scaron;to slično ?<br /></span></em><em><span style="font-size: x-small;">Nadam se da ćete otvoreno odgovoriti, jer su iskrenost i otvorenost po na&scaron;em mi&scaron;ljenju osnova svakog dobrog posla.<br /></span></em><em><span style="font-size: x-small;">...<br /></span></em><em><span style="font-size: x-small;">Vratimo se na va&scaron;e dosada&scaron;nje obrazovanje. Postaviću Vam par dodatnih pitanja:<br /></span></em><em><span style="font-size: x-small;">1) Student ste koje godine FIT-a ? Koje godine ste upisali fakultet ?<br /></span></em><em><span style="font-size: x-small;">2) Koji Vam je omiljeni predmet na dosada&scaron;njem &scaron;kolovanju na FIT-u ?<br /></span></em><em><span style="font-size: x-small;">3) Kojim uspjehom ste zavr&scaron;ili srednju &scaron;kolu (po razredima) ?<br /></span></em><em><span style="font-size: x-small;">4) Koje ste ocjene u srednjoj &scaron;koli imali iz predmeta matematika i fizika (po razredima) ?<br /></span></em><em><span style="font-size: x-small;">U očekivanju Va&scaron;eg odgovora,</span></em></p>
<p>Kolega mi se nije javio nakon toga. Kolega, elementarna kultura je odgovoriti na mail. Odgovor: "Hvala, ali vi&scaron;e nisam zainteresovan za posao u Va&scaron;oj firmi", bi bio sasvim dovoljan.&nbsp;</p>
<p>Nakon ove baterije pitanja, dobio sam tek par odgovora.</p>
<p>Na onu ubuntu pitalicu sam dobio sljedeći "odgovor":</p>
<blockquote class="posterous_short_quote">
<p>Ova recenica mi govori da je na raČunaru instaliran operativni sistem Ubuntu .</p>
</blockquote>
<p>Namjerno sam sa copy-paste ovaj odgovor stavio. Kada vidim ovo "Č" kako "vri&scaron;ti" u rečenici meni je dovoljno. Pa čovječe ti se javlja&scaron; potencijalnom poslodavcu. Potrudi se malo !</p>
<p>Ali pustimo se mog sitničarenja i "Č". Cilj mog pitanja je bila provjera da li li kandidat zna koristiti internet - da li će na zadatu temu potražiti dodatne informacije.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Džon</strong></span></p>
<p>Neki dam smo primili jo&scaron; jednu aplikaciju. Čitam i vidim da mi je forma od ranije poznata. Potražim u svom mailbox-u i ubrzo nađem - potpuno istu formu aplikacije od ranijeg kandidata.</p>
<p>Odmah čovjeku odgovorim:</p>
<p style="padding-left: 30px;"><em><span style="font-size: x-small;">Prije par dana je drugi kandidat za posao poslao mail sa istom sadržinom:<br /></span></em><em><span style="font-size: x-small;">&gt; ...<br /></span></em><em><span style="font-size: x-small;">&gt; Nadam se i osjćam da bi bio uspje&scaron;an u bilo kojem poslu poslu i ocekujem da ćete me pozvati da skupa krenemo ka uspjehu.<br /></span></em><em><span style="font-size: x-small;">Ista rečenica, ista slovna gre&scaron;ka ... Ovo je neki "džon" koji daje Zavod za zapo&scaron;ljavanje ili &scaron;ta ?!<br /></span></em><em><span style="font-size: x-small;">Kako god bilo, Va&scaron; zahtjev neću prihvatiti iz slijedećeg razloga:<br /></span></em><em><span style="font-size: x-small;">Niste uložili ni najmanji trud kod podno&scaron;enja aplikacije za posao.<br /></span></em><em><span style="font-size: x-small;">S po&scaron;tovanjem,</span></em></p>
<p>Za razliku od svih ostalih, ovaj kandidat mi je dao odgovor, te rekao da je mail vidio na na&scaron;oj stranici. Sjetih se da je stvarno jedna aplikacija napisana na mom blogu. Odgovorio sam:</p>
<p style="padding-left: 30px;"><em><span style="font-size: x-small;">Hvala na poja&scaron;njenju.</span></em><br /><em><span style="font-size: x-small;">Va&scaron;e poja&scaron;njenje potvrđuje moju odluku da negativno odgovorim na Va&scaron;u aplikaciju. </span></em><br /><em><span style="font-size: x-small;">Nadam se&nbsp; da ćete u budućnosti naći odgovarajuće zaposlenje,</span></em><br /><em><span style="font-size: x-small;">Svako dobro,</span></em></p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Email - 100% filter</strong></span></span></p>
<p>Stvarno smo se potrudili da pronađemo jo&scaron; jednog kandidata. Međutim, na silu ne ide. Ovi ljudi jednostavno nisu profil koji može odgovarati na&scaron;oj firmi.</p>
<p>Na kraju, niko nije pozvan na usmeni razgovor.</p>
<p>Jedan jedini kandidat koga sam htio pozvati na intervju dao je referencu za posao za koju sam provjerom utvrdio da nije tačna. E pa stvarno, &scaron;to ne ide - ne ide.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Rezime</span></strong></span></p>
<p>Stekao sam dojam da su nezaposleni ljudi prijavljeni na Zavoda za zapo&scaron;ljavanje totalno nespremni za bilo koji posao osim "krampa i lopate". &nbsp;Eto, to je nama na&scaron;e obrazovanje dalo. Sjetim se <a href="/bosna-glup-lud-il-bahat">ublehe o pametnim Bosancima</a>. U stvari, nije ovdje glavno pitanje pamet nego <span style="color: #ff0000;"><strong>(NE)OBRAZOVANJE</strong></span>.</p>
<p>Da bi se ovo stanje koliko-toliko promjenilo, Zavod mora uraditi totalni "rethink" svog djelovanja.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, bringout, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>Pregleda 782, komentara: 2</h4>(Status na dan 07.04.2013 prema posterous blog statistici ranijeg posterous blog-a)<hr/>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Jul 22 2011,  1:41 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Traganje za pripravnikom, neusjesno	Fri Jul 22 10:40:17 2011<br />From: 	<a href="mailto:hernad@bring.out.ba" rel="nofollow">hernad@bring.out.ba</a><br />To: 	Kantonalni Zavod za zapošljavanje<br />Cc: 	<a href="mailto:office@bring.out.ba" rel="nofollow">office@bring.out.ba</a><br />Reply To: 	<a href="mailto:office@bring.out.ba" rel="nofollow">office@bring.out.ba</a><br />Poštovani, želim da Vam se zahvalim na pomoći koju ste nam pružili u traženju za pripravnicima putem Vaših općinskih službi.<p>Na žalost, nismo uspjeli naći odgovarajućeg kandidata. O našem iskustvu tokom tog procesa sam napisao članak:</p><p><a href="http://hernad.bring.out.ba/konkurs-za-posao-email-filter-100" rel="nofollow">http://hernad.bring.out.ba/konkurs-za-posao-email-filter-100</a></p><p>Prosljeđujem Vam ovu informaciju jer smatram da bi Vam naše iskustvo moglo biti od koristi.</p><p>---<br />Ernad Husremović, direktor</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Jul 22 2011,  1:46 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Feri via facebook:<p>Fernala Sejmen-Banjac je komentarisao/la vaš Objavi...<br />Fernala je napisao/la "0 ljudi je u mogućnosti odgovoriti na trivijalna pitanja o osnovnom obrazovanju... a gdje je aktivizam, volonterizam... gdje su proaktivna djeca??? Sjećam se da smo nedavno Almir i ja u oglasu za servisera napisali da radioamateri imaju prednost... ljudi su se čudom čudili... Tuga jedna." </p><p>Odgovorio sam joj da se na ovu temu "trubiti na sva zvona".</p></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
