<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/mobilizacija-u-bringout.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/07/srpska-istina.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Otvorenost je bitna</h3>
<div class='post_info'>
<span class='post_time'>July 28 2011,  1:35 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Otvorenost je rijetka zvijerka u Bosni. Iako je pro&scaron;lo 8 mjeseci od pokretanja "knowhow" niko, ama ba&scaron; niko, nije pokazao interes da se direktno uključi u jedan ovakav projekat.</p>
<p>Naravno, ne treba zaboraviti da je uključivanje ljudi u otvorene projekte zahtjevan projekat. Može se reći da je to najbitniji dio marketinga otvorenog projekta.</p>
<p>Do sada, konkretni rezultati na tom planu ravni su nuli. Ali, kao i svaka druga stvar, ako ne&scaron;to ne poku&scaron;a&scaron; ne može&scaron; očekivati nikakve rezultate.</p>
<p>Nezainteresovanost za knowhow mi je pokazala dvije stvari:</p>
<ol>
<li>U Bosni ne postoji kultura otvorene komunikacije. </li>
<li>Upravljanje projektom nije dobro osmi&scaron;ljeno</li>
</ol>
<p><!--more--></p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Kultura otvorene komunikacije</span></strong></span></p>
<p>Dosta sam pričao sa ljudima o "knowhow". Većina mojih sagovornika je mi&scaron;ljenja da je "opensource cool". Ali ...</p>
<p>Ali nikome nije palo na pamet da "preče&scaron;lja" po onome &scaron;to smo učinili dostupnim.&nbsp; Ako i jesu, nikome se očigledno ono &scaron;to su vidjeli nije svidjelo. Ako i jesu, niko nije dao nikakav komentar. A svaki komentar je bitan - negativan ili pozitivan.</p>
<p>Nedavno sam čitao komentare i preporuke jednog blogera po pitanju načina pisanja. Zapala mi je u oko rečenica:</p>
<blockquote class="posterous_medium_quote">
<p>Kada tvoj blog bude sadržao negativne komentare, znaj da si na dobrom putu ... Onda može&scaron; znati da ljudi čitaju to &scaron;to pi&scaron;e&scaron;, i da je to tvoje pisanje ljudima bitno.</p>
</blockquote>
<p>Može se reći da je <a href="http://hernad.bring.out.ba">http://hernad.bring.out.ba</a> u velikoj mjeri svojevrstan marketing "knowhow" i svega onoga &scaron;to "bring.out" jeste ili želi biti.</p>
<p>Pa koliko ima komentara ? Malo. Zato &scaron;to su moje teme bezvezarije ? Zato &scaron;to je moj stil pisanja lo&scaron; ? Ovo je moj dosada&scaron;nji zaključak:</p>
<blockquote class="posterous_short_quote">
<p>Toga sigurno ima, ali mislim da je jedan od vrlo bitnih parametara činjenica da smo mi nepismena nacija, te da i ono malo pismenih ne posjeduje kulturu otvorene komunikacije.</p>
</blockquote>
<p>Kada sam pisao <a href="/kasnjenje">"Ka&scaron;njenje"</a>, jedna od teza koju sam imao na svojim papirićima(*) je bila:</p>
<blockquote class="posterous_short_quote">
<p>Otvaranje "knowhow" je čista "fula" !</p>
</blockquote>
<p>Drago mi je da sam tu konstataciju tom prilikom izostavio. Iz jednostavnog razloga &scaron;to to nije tačno. Tačnoj je su dosada&scaron;nji efekti otvaranja knowhow ravni nuli. Ali to ne znači da je otvoreni pristup pogre&scaron;an.</p>
<p>Ovaj pristup razvoju zahtjevnog IT projekta kakav je ERP je na bosanskom trži&scaron;tu. Ako i propadne, ja ću i dalje ostati ubijeđen da tome nije razlog otvorenost nego jednostavno moja nesposobnost.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Post-Pantheon vrijeme</span></strong></span></p>
<p>Ubijeđen sam da će na trži&scaron;tu ERP rje&scaron;enja za srednji i mali biznis u narednih 10 godina zavladati neki otvoreni projekat. S obzirom da je slovenački "Data Lab" sa svojim proizvodom "Pantheon" trži&scaron;ni lider u ovom području(**), to vrijeme nazvaću post-pantheon.</p>
<p>Za&scaron;to sam u to ubijeđen ? Zato &scaron;to samo otvoreni software može na malom trži&scaron;tu kakvo je bosansko imati i potrebni kvalitet i dovoljno niske tro&scaron;kove.&nbsp; Vlasnički(***) - zatvoreni softver to ne može postići.</p>
<p>ERP software je dinamičan i zahtjevan. Svako malo se javljaju novi zahtjevi klijenata. Svako malo podr&scaron;ka treba ne&scaron;to dodati ili oduzeti.&nbsp; Sve to generi&scaron;e velike tro&scaron;kove u razvoju i aktivnostima podr&scaron;ke projektu. Jedan vendor to te&scaron;ko može obezbjediti.</p>
<p>Po onome &scaron;to znam "DataLab" ima sasvim dobar model djelovanja. Oni djeluju kao "hub" firma za partnersku mrežu. Međutim, partneri su tu prodavci licenci, ili u najboljem slučaju sistem integratori.</p>
<p>Taj model ne stvara prostor za nova rje&scaron;enja, nove ideje i nove vrijednosti. Zato &scaron;to je vlasnik software-a jedan i samo jedan. Zato &scaron;to se na <strong>jednom mjestu</strong> određuje kolika je taksa za kori&scaron;tenje tog software-a.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Upravljanje otvorenim projektom</strong></span></p>
<p>Kada bih ovu priču zavr&scaron;io konstatacijom da su drugi krivi za nezainteresovanost za "knowhow", onda bih ovaj blog trebao nositi jedno ime:</p>
<blockquote class="posterous_short_quote">
<p>Blog jednog "balavca" od 40 i kusur godina ...</p>
</blockquote>
<p>Jesam sanjar, ali nisam ba&scaron; toliko istrgnut iz realnog svijeta :).</p>
<p>Sigurno je da "knowhow" ne bi bio projekat (ili ideja kako god hoćete) jednog lica, da sam ja kao vođa tog projekta na&scaron;ao moduse za njegovo &scaron;irenje.</p>
<p>Ovo &scaron;to radim su definitivno koraci jednog početnika. "Džonim" praksu bijelog svijeta i poku&scaron;avam da je primjenim ovdje. Sve su to 1+1 koraci, pri čemu nerjetko "preletim" pa za rezultat dobijem 3.&nbsp; Koliko god bio lo&scaron; matematičar, koliko god sve to često bilo jedno veliko lutanje, ne treba pasti u "crnjak".</p>
<p>Stiče se iskustvo koje će aBd pomoći da ta otvorenost&nbsp; da željene rezultate. Pojaviće se "balavurdija" koja nije u kli&scaron;eu priča sada&scaron;njeg bosanskog developera:</p>
<blockquote class="posterous_short_quote">
<p>Ja da mu radim za džaba !? Na NJEGOVOM otvorenom projektu ? Na kraju bi on taj moj trud skupo prodao&nbsp; ...  Jest da sam s' kru&scaron;ke spao.</p>
</blockquote>
<p>Drage moje kolege, vi i dalje pravite isključivo&nbsp; "Microsoft" i "Oracle" bazirana remek djela. Radite samo za "prave" poslodavce.</p>
<p>"Dva smo svijeta različita",&nbsp; &scaron;to rekla ova aktuelna televizijska serija. I tu se slabo &scaron;ta može učiniti.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Poziv IT "balavcima"</strong></span></p>
<p>A vi&nbsp; IT "balavci", vi koji ste van svih ovih &scaron;ema ... vi kojma nije glavna ambicija postati zaposlenik BH Telecoma&nbsp; ili neke državne institucije ... vi koji imate ideje ... vi koji imate želju ne&scaron;to novo - PRAVITE !</p>
<p>Ako vidite da je "knowhow", odnosno "bring.out" mjesto da to činite, super. Ako mislite da je to neko drugo mjesto - činite to tamo. Samo nemojte biti robovi postojećih kli&scaron;ea.</p>
<p>Ako u tom va&scaron;em traganju i djelovanju napravite ne&scaron;to &scaron;to je u domenu na&scaron;eg interesa - javite nam se. Mi nemamo problem da radimo na tuđim OTVORENIM projektima.</p>
<p>Mi smo otvorena firma. Mi smo "bring.out" !</p>
<p>---</p>
<p>(*) da da, ja uveliko koristim papiriće :)</p>
<p>(**) ispravite me ako grije&scaron;im.</p>
<p>(***) Proprietary</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, bringout, business</div>
</div>
<div class='post_responses'>
<h4>796 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>