<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/kompromitacija-zadatka-packet-tracer-iz-kt-a.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/07/kako-knowhow-san-pretvoriti-u-stvarnost.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Seminarski Komunikacijske tehnologije, anglizmi, neakademski riječnik</h3>
<div class='post_info'>
<span class='post_time'>July 25 2011,  9:59 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><a href="http://hernad.bring.out.ba/komunikacijske-tehnologije-seminarski-qos">Seminarski iz KT-a</a>&nbsp;sam korigovao u par navrata. Stil pisanja nije bio adekvatan za seminarski rad.</p>
<p>"Tutorial" stil pisanja nije dobar. Konstrukcije tipa: "Kockice se napokon slažu ..." i slično takođe ne ide.</p>
<p><!--more--></p>
<p>Ovo je forma rada koja je prihvaćena:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>seminarski.pdf</strong>
<a href="../../../file/2011/07/6820585-seminarski.pdf">View this file</a>
</div>
</div>
</p>
<p>Prilikom podno&scaron;enja ove zadnje verzije asistentu sam napisao dodatne napomene:</p>
<p style="padding-left: 30px;"><span style="font-size: x-small; color: #993300;">1) potrudio sam se da sve preostale kako-za&scaron;to konstrukcije izbacim ili preformuli&scaron;em.</span></p>
<p style="padding-left: 30px;"><span style="color: #993300;"><span style="font-size: x-small;">2) Strane pojmove sam sveo na minimum. Ostavio sam samo one za koje bosanski jezik po mom znanju nema nikakve smislene prevode ili su toliko odomaćeni da bi njihovo prevođenje čitaocu stvorilo nejasnoće(*). Takvi su npr:<br /></span><span style="font-size: x-small;">- bandwidth<br /></span><span style="font-size: x-small;">- uplink<br /></span><span style="font-size: x-small;"><br />Međutim, ako jo&scaron; ne&scaron;to ima za ispraviti da bi se dobila odgovarajuća forma - način izlaganja, tu sam.</span></span></p>
<p style="padding-left: 30px;"><span style="font-size: x-small; color: #993300;">(*) Uzev&scaron;i u obzir da je primarna ciljna grupa ovakvog materijala IT profesionalac.</span></p>
<p>Asistent mi je odgovorio da je rad prihvaćen, uz sljedeći komentar:</p>
<blockquote>
<p><span style="color: #993300;">Rad je prihvacen, i samo dodatne informacije bandwidth = propusnost, uplink je uvijek link prema necemu (najcesce ISP) te se moze malo preformulisati i dobiti nasu terminologiju. Ovo ce vam trebati kako budete dalje studirali jer ce vam prof. insistirati da terminologija bude sa sto manje stranih izraza.</span></p>
</blockquote>
<p>Sve ranije primjedbe asistante sam bez pogovora napravio. Bio sam 100% poslu&scaron;ni student :). Rekao sam sebi: "Nemoj 'talasati', uradi &scaron;to ti se kaže i tačka !" .</p>
<p>Međutim, ovaj posljednji komentar me je bezpovratno "okinuo". Odgovorio sam:</p>
<blockquote>
<p><span style="color: #993300;"><em>Razumio bih kada neko kaže "propusnost linka",  "propusnost internet konekcije". Ali bih kada to pročitam napravio u  glavi translaciju: "Misli se na bandwidth".</em></span></p>
<p><br /><span style="color: #993300;"><em>Bandwidth spada u izraze koje sam u predhodnom malu komentarisao: "... toliko odomaćeni da bi njihovo prevođenje čitaocu stvorilo nejasnoće(*)"<br /></em></span><br /><span style="color: #993300;"><em>A  &scaron;to se tiče "upload", tu bi ba&scaron; bilo interesantno poku&scaron;ati sa nekim  prevodom. Ja sam u fusnotu (ah opet ja i anglizmi) stavio poja&scaron;njenje:</em></span></p>
<p><span style="color: #993300;"><em>"upload link &ndash; podaci koji idu iz lokalne mreže ka internetu"</em></span></p>
<p><span style="color: #993300;"><em>evo sada čitam pa mi se opet ne sviđa. Ako neko NE ZNA &scaron;ta je  upload, ni nakon mog poja&scaron;njenja to neće znati. Ažuriraću svoj dokument  pa ću staviti:</em></span><p /><span style="color: #993300;"><em>"upload link - link za podatke čije je izvori&scaron;te lokalna mreža a destinacija javna mreža, uobičajeno internet."</em></span><p /> <span style="color: #993300;"><em>Zato sam stanovi&scaron;ta: "Upload" je upload. Kako &scaron;to je "hardware" - hardware, "software" - software. </em></span><p /><span style="color: #993300;"><em>Upload spada u kategoriju izraza koji sam u predhodnom mailu prokomentarisao: "... </em></span><span style="color: black;"><span style="color: #993300;"><em>one za koje bosanski jezik po mom znanju nema nikakve smislene prevode".</em></span><p /> <span style="color: #993300;"><em>Na&scaron; najveći internet provajder koristi isti termin <span class="Object"><a href="http://www.bhtelecom.ba/po_adsl_brzina.html" target="_blank">http://www.bhtelecom.ba/po_adsl_brzina.html</a></span>.</em></span><p /><span style="color: #993300;"><em>Kolega, iskreno podržavam da se u ovakvim radovima insistira na kvalitetu pisanog izražavanja i komunikacije. </em></span><p /> <span style="color: #993300;"><em>Međutim, ovo na &scaron;ta ukazujete interesantnije vi&scaron;e pripada katedri bosanskog jezika nego li komunikacijskim tehnologijama. </em></span><p /><span style="color: #993300;"><em>Forma  koju sam u prvoj - tutorial verziji koristio imala je cilj prije svega  da pokaže moj nivo razumjevanja materije, a ne da uči druge. </em></span><p /> <span style="color: #993300;"><em>Da je kojim slučajem postojao sličan nastavni materijal na ovu temu,  onda bi takva forma bila suvi&scaron;na. Međutim, u nedostatku takvih resursa  sam bio prisiljen samostalno usvajati materiju, odnosno "povezivati  kockice" kako sam to napisao.&nbsp; To je stvar koja je veoma bitna.</em></span><p /> <span style="color: #993300;"><em>S obzirom da je to KAKO sam razumio, DA LI sam dobro razumio  materiju od su&scaron;tinske važnosti ocjenu mog stepena znanja, ja sam to i  naveo.&nbsp; Pored toga, mislim da će to i drugim studentima koji su u  sličnoj poziciji kao ja (DL-ovcima) biti od pomoći. Ovakvi tutoriali im  mogu pomoći da manje vremena tro&scaron;e na razumjevanje OPNET-a a vi&scaron;e na  analizu i interpretaciju rezultata mjerenja.</em></span><p /> <span style="color: #993300;"><em>Forma seminarskog na kojoj ste Vi insistirali nije pogre&scaron;na. Dapače.  Međutim, ona za pretpostavku ima da pisac rada vlada materijom. To nije  slučaj sa studentom.&nbsp; Student je u procesu učenje i razumjevanja.</em></span><p /><span style="color: #993300;"><em>I  sam sam svakodnevno u situaciji da na svom poslu kontroli&scaron;em i učim  druge ljude. U situacijama kada sam ja "mentor",&nbsp; razumjevanje postupaka  mog "studenta", pogre&scaron;nih ili ispravnih,&nbsp; je od su&scaron;tinske važnosti da  se taj proces učenja na najbolji način realizuje. Zato sam zavr&scaron;io sa u  prvoj varijanti napravio tutorial formu. Ona je prije svega bila poziv  mom mentoru da mi odgovori na pitanje: "Kolega, da li sam razumio  obrađenu materiju ?"</em></span><p /> <span style="color: #993300;"><em>Zato mi je žao&nbsp;</em></span></span><span style="color: #993300;"><em>&scaron;to su sve daljnje aktivnosti po pitanju  seminarskog bile u domenu forme i načina izražavanja a ne na tragu  odgovora na ovo pitanje.</em></span></p>
<p><span style="color: black;"><br /><span style="color: #993300;"><em>&Scaron;to se tiče mog načina izražavanja,  svjestan sam da je on neobičan po tome &scaron;to koristim konstukcije koje se  koriste u&nbsp; usmenoj, svakodnevnoj komunikaciji. Moj fokus prilikom  pisanja je prije svega nastojanje da ono &scaron;to želim reći čitalac  razumije. Mi&scaron;ljenja sam da konstrukcije "kockice se slažu", "usko grlo"  ne otežavaju razumjevanje. </em></span><br /><span style="color: #993300;"><em> Zato sam ih koristio. Međutim, vjerovatno su one neprikladne akademskoj  komunikaciji pa ću se potruditi da ih tom prilikom ne koristim.</em></span><p /><span style="color: #993300;"><em>Svakako  će mi biti draže da me moji mentori zapamte kao: "Ernad, ah to je onaj  stari student &scaron;to pi&scaron;e k'o jalija&scaron;(*)", nego kao "Ernad, to je onaj &scaron;to  pojma nema, ali se ne&scaron;to 'kofrči' i lupeta k'o Maksim po diviziji".</em></span><p /> <span style="color: #993300;"><em>Izvinite unaprijed &scaron;to sam opet pribjegao meni svojstvenom načinu  komunikacije. Ponovo, to je sa namjerom da me čitalac &scaron;to bolje  razumije.</em></span></span></p>
<p><span style="color: #993300;"><br />(*) Mi u Zenici kažemo ovako za one koji govore jezikom ulice, ne znam da li se to drugdje razumije</span></p>
</blockquote>
<p>Kasnije sam pitao svoju ženu, &scaron;ta ona misli o ovome. Ona se slaže sa svojim kolegom:</p>
<p style="padding-left: 30px;"><span style="font-size: x-small;"><em><span style="color: #993300;">Mislim da ti je covjek s pravom zamjerio stil pisanja jer nije tvoje  samo da ovladas materijom nego da to znas napisati u akademskom stilu.  Bit skolovanja je i ucenje razlicitih stilova komunikacije. Na  akademskom nivou kompetencije u jezičkoj pismenosti se upravo razvijaju  najvi&scaron;e u području akademske komunikacije koja ima svoj jezik i stil  izvje&scaron;tavanja. </span></em></span><br /><span style="font-size: x-small;"><em><span style="color: #993300;"> Meni moj student starije godine da je predao nesto takvo ne bi mogao nista popravljati nego bi odmah dobio 0%.</span></em></span><br /><span style="font-size: x-small;"><em><span style="color: #993300;">Dzenana</span></em></span></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Za&scaron;to sam napisao tutorial ?</strong></span></p>
<p>Prilikom pisanja sam bio svjestan da moj riječnik nije akademski. Pisanje sam usmjerio na obja&scaron;njavanje &scaron;ta sam uradio, kako sam razumio materiju koju sam obradio.</p>
<blockquote class="posterous_short_quote">
<p>Za&scaron;to je to bio moj fokus ?</p>
</blockquote>
<p>Zato &scaron;to ne&scaron;to slično nisam imao u nastavnim materijalima. Mislim da bi morali postojati kvalitetni nastavni materijali odnosno reference na tekve materijale kod zadavanja ovakvih zadataka.</p>
<p>Ako takvi materijali ne postoje, najvi&scaron;e energije tokom izrade rada se tro&scaron;i na pripremne radnje - u ovom slučaju na razumjevanje OPNET aplikacije. Tako je barem u mom slučaju bilo.</p>
<p>Vi&scaron;e od 2/3 od ukupnog vremena utro&scaron;enog na izradu seminarskog rada sam utro&scaron;io na pripremu. &nbsp;Tek manje od 1/3 tog vremena bavio sam se samom temom seminarskog - mjerenjima i analzom.</p>
<p>Zato je prvobitna - "tutorial" najbolje prikazala ono &scaron;to sam radio.</p>
<p><strong><span style="color: #ff0000;">Bez obzira &scaron;to mi je akademska zajednica jednoglasno dala 0 bodova, meni se moj prvobitni rad i dalje puno vi&scaron;e sviđa od finalnog. Razlog je jednostavan: u njemu se po meni nalazi vi&scaron;e korisnog sadržaja.</span></strong></p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>1256 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
