<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/otvorenost-je-bitna.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/07/kompromitacija-zadatka-packet-tracer-iz-kt-a.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Srpska istina i norveški katil</h3>
<div class='post_info'>
<span class='post_time'>July 25 2011,  1:41 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Prebacujući kanale, naletim na emisiju na "SRNI"(*) koja priča o ha&scaron;kim procesima protiv Karadžića i Mladića.</p>
<p>Sastali se tu ljudi uključeni u odbranu srpske optuženika (a i onih već optuženih). Obja&scaron;njavaju ti oni kako je problem &scaron;to tužila&scaron;tvo raspolaže ogromnim sredstvima, te kako je to jedan od glavnih razloga zbog koga su Srbi nakupili nekoliko stotina godina robije. Lik dalje obja&scaron;njava da bi, da su imali bolju odbranu, stanje bilo skroz drugačije.</p>
<p>Obja&scaron;njava kako je glavna "kvaka" u strategiji dokaza opravdane sumnje. &nbsp;"Da je odbrana bila bolja, puno vi&scaron;e bi optužbi bilo svedeno pod opravdanu sumnju", kaže on.</p>
<p>Kada slu&scaron;am ovakve stvari, trudim se isključiti emocije. Dok slu&scaron;am, non-stop razmi&scaron;ljam o tome kako ovo jedan Srbin slu&scaron;a. Poku&scaron;avam uhvatiti tok priče ... trudim se saslu&scaron;ati &nbsp;... od gnu&scaron;anja na te priče nema koristi. Treba ih poku&scaron;ati razumjeti ! Pored toga, ako bi se prepustio emocijama, lahko bi mogao razlupati televizor. A to mi ne bi bilo nikako pametno ... to je ipak moj televizor.</p>
<p>Ali pustimo se moje strategije slu&scaron;anja. Taj lik iz tima odbrane dolazi do ključne konstatacije:</p>
<blockquote class="posterous_medium_quote">
<p>Suđenje dr. Radovanu Karadžiću i generalu Ratku Mladiću je puno vi&scaron;e od pojedinačnih slučajeva. Oni su simboli ! Oni su glavni politički i vojni simboli na&scaron;e države(**) iz vremena njenog nastajanja ...</p>
</blockquote>
<p><!--more--></p>
<p>Da skratim, lik dalje obja&scaron;njava kako je manje bitno hoće li Radovan i Ratko otići "pod led". Bitno je da ne ode pod led njihova "država" ... uh malo mi fali da ne opsujem tu "državu" mu njegovu ... Sva sreća da sam hernad-under-control.</p>
<p>I onda na sve to nagla&scaron;ava da je: "<strong><span style="color: #ff0000;">Istina</span></strong> hljeb na&scaron; nasu&scaron;ni. Jedino sa istinom možemo živjeti jedni pored drugih(***) ... "</p>
<p>Ma svaka čast. U toku elaboracije o strategiji "opravdanje sumnje" obja&scaron;njava:</p>
<blockquote class="posterous_short_quote">
<p>Mi (op. aut odbrana) trebamo "otvoriti" ponovo Srebrenicu, "otvoriti" Sarajevo ...</p>
</blockquote>
<p>Srebrenica i Sarajevo su znači jedna velika laž. I ovaj nam treba otkriti istinu, pa da se svi smirimo i da na miru možemo živjeti jedni pored drugih ...</p>
<p>Ali vratimo se na moj televizor. S obzirom da je on mojom iznimnoj sposobnosti kontrole ostao čitav, nastavljam vrtiti kanale ... Nakon saslu&scaron;ane srpske istine na drugom kanalu vijest.</p>
<p><span style="color: #111111; font-size: 12px; line-height: 15px;"><span style="color: #ff0000;">Breivik</span>, egzekutor</span>&nbsp;nedavnog masakra u Norve&scaron;koj u svom e-dnevniku je napisao:</p>
<blockquote>
<p><strong><span style="color: #ff0000;">Volio bih upoznati <a href="http://www.dnevnik.ba/novosti/svijet/breivika-na-monstruozni-potaknula-kampanja-protiv-%E2%80%9Ebra%C4%87e-srba-koji-su-%C5%BEeljeli-protjer">Radovana Karaždića</a>, ponosnog srpskog krsta&scaron;a kome se sudi &nbsp;zato &scaron;to je svoju zemlju htio osloboditi od islama ...</span></strong></p>
</blockquote>
<p>Odbrano simbola "države" u vas, eto ko su fun-ovi te va&scaron;e kreacije. Breivik.</p>
<p>Istina, on je ostao "mala maca" za postignuća svojih uzora - va&scaron;ih simbola.&nbsp;</p>
<p>Potrudio sam se, al' nikad neću skontati:</p>
<blockquote class="posterous_short_quote">
<p>'Đe će vam du&scaron;a da nakon svega ovako mislite i pričate ...</p>
</blockquote>
<p>---</p>
<p>(*) televizija ovih na&scaron;ih Srba</p>
<p>(**) Ovo pretvaranje istočnog BH entitteta u državu je uobičajen "gaf", ali to nije glavna stvar ove priče.</p>
<p>(***) "Jedni pored drugih" je naravno jo&scaron; jedna od omiljenih srpskih konstrukcija. Mislim da je Radovan, prvi predsjednik, "države" mu njegove, prvi i lansirao ovu kovanicu.&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, dunjaluk, rat</div>
</div>
<div class='post_responses'>
<h4>829 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
