<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/09/sejtan-i-opensource.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/09/gdje-su-meka-i-medina.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Mursel i totalno otvaranje bring.out</h3>
<div class='post_info'>
<span class='post_time'>September 29 2011,  4:50 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Prije par dana naletim na neki post sa komentarom od "stranca". Nije nepozvani stranac, nego kolega sa FIT-a. Sretali smo se na fakultetu uoči ispita i tako upoznali. On je jedan od onih koji je vjerovatno najvi&scaron;e komentara na moje članke dao ... Jedan od malobrojnih fun-ova mog bloga, hehe :).</p>
<p><!--more--></p>
<p>Bilo kako bilo, skontam da nikada čovjeka nisam pitao: "Pa dobro, čime se ti bavi&scaron; &scaron;ta ti radi&scaron; ...". Iskreno uvijek mi pred ispite dođe ona nervoza zvana "mogo bi rok'nut de probaj jo&scaron; &scaron;tagod ponovit'", pa tada i nisam neki sagovornik ...</p>
<p>Zato sam ga ovo upitam. I fino napi&scaron;em ticket na <a href="http://redmine.bring.out.ba/issues/24573">redmine-u</a>. Lak&scaron;e mi je bilo napisati ticket i "zakačiti" Mursela na notifikaciju nego "ganjati" njegov email ... A da budem do kraja iskren, uvijek koristim priliku da ljude zainteresujem za kori&scaron;tenje redmine-a.</p>
<p>Brzo nakon toga Mursel meni odgovori. Na email, s obzirom da je tu bilo privatnih podataka. Iz toga krenu novo pitanje ... i hop ... ja se raspisa. Ah, ne treba meni puno.</p>
<p>Međutim, ta korespondencija me je navela da napi&scaron;em ne&scaron;to &scaron;to bi moglo biti i drugima interesantno. Zato ću glavne dijelove svog odgovara publikovati.&nbsp;</p>
<p>Kao uvod trebam reći da mi je Mursel rekao da je najvi&scaron;e orjentisan na sysadmin poslove, te da se povremeno bavi razvojem na android platformi. Evo mog odgovora:</p>
<blockquote>
<p>Aha "Android", pa eto prati &scaron;ta god te na na&scaron;em redmine-u interesuje.</p>
<p>Mi smo nedavno zavr&scaron;ili sa otvaranjem većine na&scaron;ih projekata za anonimnog internet korisnika. Pogledaj listu projekata:</p>
<p><a href="http://redmine.bring.out.ba/projects">http://redmine.bring.out.ba/projects</a></p>
<p>Od sysadmin područja te može interesovati <a href="http://redmine.bring.out.ba/projects/i6">I6</a> i negovi podprojekti. Tu je i <a href="http://redmine.bring.out.ba/projects/system-toolbox">system toolbox</a>, posebno <a href="http://redmine.bring.out.ba/projects/openstack">openstack</a> i <a href="http://redmine.bring.out.ba/projects/chef">chef</a>&nbsp;(iako je chef unutar <a href="http://redmine.bring.out.ba/projects/dev-tbox-b-out-ba">developer toolbox-a</a> radi se prvenstveno o devops/sysadmin alatu)</p>
<p>Istina svi ti alati su non-Microsoft i često ne rade ba&scaron; najbolje na Microsoft OS-ovima :).</p>
<p>Kako god, nadam se da će ovo otvaranje na&scaron;e firme, ako ni&scaron;ta drugo, drugim ljudima biti od pomoći.</p>
<p>Ako te bilo koji od ovih projekata zainteresuje, i samo po&scaron;alji email da te dodamo kao korisnika sa pravom postiranja i davanja komentara na tickete.</p>
<p>&Scaron;to se tiče android aplikacija koje si pravio, bez ikakvog ustručavanja, ako to želi&scaron;, postiraj to &scaron;to si radio mobile/mobile-dev. Ako se radi o slobodnom software-u, preporučujem ti da to postira&scaron; na github.com.</p>
<p>Postiraj &scaron;ta god misli&scaron; da može biti od koristi drugima, a vezano je za područje projekta.</p>
<p>Ako se radi o slobodnom - opensource software-u, možda i mi budemo korisnici tvojih widgeta :).</p>
<p>Isto kao &scaron;to pozivam te &nbsp;da koristi&scaron; ili drugima kaže&scaron; za na&scaron; otvoreni software <a href="https://github.com/knowhow">https://github.com/knowhow</a>, <a href="https://github.com/bringout-fmk">https://github.com/bringout-fmk</a>.</p>
<p>Naravno, uz ograničenja su skladu objavljenim <a href="https://github.com/knowhow/T0_knowhow/tree/master/legal">licencama</a> :).</p>
<p>Mi želimo promovirati opensource software, ali prije svega bosansko znanje i pamet. Pa čak i kada ta pamet nije aman-zaman za bijeli svijet.</p>
<p>Ako se u bilo čemu od toga nalazi&scaron;, a ti napi&scaron;i brate ...</p>
<p>redmine.bring.out.ba hostira projekte od interesa za bring.out ali oni su otvoreni upravo zato da bih komunicirali i sarađivali sa drugima na temama od zajedničkog interesa.</p>
<p>Ah ja ... opet se raspisah. Jo&scaron; malo pa sam mogao novi članak napisati :)</p>
<p>FIT: Ba&scaron; mi je drago da i na trećoj godini nastavljamo druženje.</p>
<p>Selam alejkum,</p>
<p>Ernad</p>
</blockquote>
<p>Računam da će ovaj članak objasniti ZA&Scaron;TO se toliko "furam" na otvorenost. A ako se neko jo&scaron; aktivno uključi u na&scaron;e projekte - pa ku'&scaron; bolje.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, it, software_development</div>
</div>
<div class='post_responses'>
<h4>Pregleda 340, komentara: 2</h4>(Status na dan 07.04.2013 prema posterous blog statistici ranijeg posterous blog-a)<hr/>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Sep 30 2011,  3:27 PM</div>
<div class='response_name'>mujo responded:</div>
</div>
<div class='response_body'>U istraživanju openerp-a naletjeh na vaše stranice. Vidim da ste odustali od openerp-a u korist xtuple. Možete li to malo objasniti vašu odluku. Openerp mi se čini solidan softver koji bi se mogao koristiti, naravno uz prilagodbu za fiskalizaciju.</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Oct  1 2011, 12:18 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Odlično pitanje. Odgovor je međutim suviše dugačak da bih ga ovdje navodio.<p>Slijedi aBd novi članak u kome ću ovo pokušati objasniti.</p></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
