<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/pije-li-vode-open-source-erp-software-u-bosni.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/09/mursel-i-totalno-otvaranje-bringout.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Šejtan & business & opensource</h3>
<div class='post_info'>
<span class='post_time'>September 29 2011,  6:24 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Danas radim obračun plata.&nbsp;</p>
<p>Dođem do <a href="http://vsasa.bring.out.ba/">Sa&scaron;ine</a> plate. Auuuu! Na na&scaron;em redmine-u izvje&scaron;taj o realizaciji pokazuje da je Sale ovaj mjesec po učiku postigao rekord firme. Isto k'o da ga je neko prikopč'o na struju.</p>
<p>Čitam izvje&scaron;taje, prisjećam se &scaron;ta je sve u toku proteklog mjeseca uradio. Nema &scaron;ta. Čovjek je fakat "orao" za računarom. E pa jarane, sad plati taj rad. Međutim, gdje god su pare, tu blizu je i &scaron;ejtan ... Taj moj &scaron;ejtan kaže:</p>
<blockquote class="posterous_short_quote">
<p>Ama ne valja ti matematika Ernade !</p>
</blockquote>
<p><!--more-->Ja mu uzvraćam:</p>
<blockquote>
<p>Kako ne valja. &nbsp;?! Evo ti crno na bijelo projekti koje je Sale od A-Ž iskodirao&nbsp;<a href="https://github.com/knowhow/M3_knowhow">M3</a>, <a href="https://github.com/knowhow/A4_knowhow">A4</a>. Evo ti commit-i na&nbsp;<a href="https://github.com/bringout-fmk/fmk_common/commits/master">fmk_common</a>, <a href="https://github.com/bringout-fmk/fakt/commits/master">FAKT</a>. Nije to moja mater radila, sve je to vsasa odradio !</p>
</blockquote>
<p>Ne da se &scaron;ejtan, pa jo&scaron; že&scaron;će napada:</p>
<blockquote class="posterous_medium_quote">
<p>Pa vidi&scaron; li ti blentovino &scaron;ta radi&scaron; ! Treba&scaron; čovjeka platiti za njegov rad, a sav taj rad svako može sebi pod ruku, bez da ti dinara plati. Eto ti tvoj opensource, budaletino jedna ! Ko je jo&scaron; vidio da se u tamo nekoj Bosni neko na takve stvari fura. Ostaće&scaron; ti jarane brzo i bez para i bez develoepra i bez posla !</p>
</blockquote>
<p>Uh, sad sam se ja raspalio. Slu&scaron;aj ti &scaron;ejtane, daleko ti od mene bilo, ovako stvari hodaju:</p>
<blockquote class="posterous_medium_quote">
<p>Niko to &scaron;to smo mi ovdje ne može bez znanja i mnogo truda iskoristiti i staviti u funkciju. Mi smo ti koji imaju znanje i know-how. Mi smo ti koji znaju čemu sav taj source code služi ....</p>
<p>A mi smo na kraju krajeva ti koji isto tako koriste tuđi opensource software(*). Pa &scaron;ta !? Misli&scaron; da mi njima njihovu nafaku možemo ukrasti ?! Sikter ba od mene !</p>
</blockquote>
<p>Al' moj je &scaron;ejtan uporan k'o rijetko koji:</p>
<blockquote class="posterous_medium_quote">
<p>Dobro. Fino ti čovjeka plati, na sav glas viči kako je tvoj vsasa super-duper pametan developer, kako radi k'o crnac, kako je pametan, samostalan ... i sve to &scaron;to radite na kraju publikujte ko opensource software. Brzo će se neko naći ko će sve to &scaron;to ste uradili znati iskoristiti, tvom developeru dati koju stojanku vi&scaron;e dok ga ne namami ... a onda će njemu njegov &scaron;ejtan reći - "Ne radi za ovoga hajvana. On je ba u nekom svom svijetu ... On će sa svojim opensource-om i ma&scaron;tarijama propast' dok si rek'o keks. Valja tebi ženu i djecu hranit'. Ovaj ti drugi daje dobru ponudu. Prihvati to !"</p>
</blockquote>
<p>E ovo je bio najteži udarac ... fakat ima smisla &scaron;to govori ... Ovo bi se stvarno moglo desiti !? Presaberem i dođem do pravog odgovora:</p>
<blockquote class="posterous_medium_quote">
<p>Ja se uzdam u Gospodara. Ja ću svom Saletu platiti koliko mogu i koliko je zaslužio. A do njega je &scaron;ta će i kako će on dalje. Moje je činiti &scaron;to najbolje znam i umijem. Moje je ne slu&scaron;ati tebe i tvoje vesvese.</p>
</blockquote>
<p>E na pomen Uzvi&scaron;enog Gospodara svaki &scaron;ejtan ostane &scaron;upica-tach.</p>
<p>Selam alejkum.</p>
<p>-----</p>
<p>(*) <a href="http://redmine.bring.out.ba/projects/zimbra-b-out-ba/issues">zimbra</a>, <a href="http://redmine.bring.out.ba/projects/redmine-b-out-ba/issues">redmine</a>, <a href="http://redmine.bring.out.ba/projects/xtuple/issues">xtuple</a>, <a href="http://redmine.bring.out.ba/projects/git-b-out-ba/issues">git</a>, <a href="http://redmine.bring.out.ba/projects/vbox/issues">virtualbox, vagrant</a></p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>business, islam, opensource</div>
</div>
<div class='post_responses'>
<h4>352 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
