<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/11/spreadsheet-trodimenzionalne-reference.html">Previous</a>
&nbsp; 
<a href="../../../index-15.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/06/34550184.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>knowhow, e sad ću definitivno k'o kruška upast' na ispitima</h3>
<div class='post_info'>
<span class='post_time'>November 26 2010,  7:09 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>II godina, zimski semestar, prvi parcijalni.</p>
<p>Koliko god sam pro&scaron;le godine kukao da nisam odvojio dovoljno vremena za spremanje ispita, to je sića za ovaj rok.</p>
<p><a href="http://www.bring.out.ba/tag/b_knowhow">knowhow knowhow knowhow</a> ... I dođe dva dana pred ispite.</p>
<p>Do sada sam jedan dan odvojio za PR2, i to kad sam spremao samoevaluacijski test. Ostale predmete nisam ni pogledao ... Ustvari jesam - lažem.</p>
<p>Pregledao sam 10-tak stranica knjige iz statistike sinoć kad me je Faruk zaključao u hodnik, i zabranio da idem u dnevnu sobu.</p>
<p>Ja krenem on: &scaron;edi, &scaron;edi !&nbsp; (&scaron;edi =&gt; sjedi). Kako nisam imao kud, uzeo sam knjigu iz statistike koja je bila u torbi u hodniku.</p>
<p><!--more--></p>
<p>A i tih 10 stranica ...&nbsp; svakih par redova on dolazi: "&scaron;i&scaron;i" (il kako već ono viče "stavi") da mu ubacim strelicu u njegov pi&scaron;tolj sa gumenim strelicama ...</p>
<p>Na kraju mi se i prispavalo jer sam od knowhow umoran k'o pa&scaron;će.</p>
<p>Otvaranje knowhow projekta&nbsp; jednostavno nisam mogao ostaviti za kasnije. Da sam to i poku&scaron;ao, mozak bi mi svakako letio: "joj ti ovdje đak prvak ... a firma ti tone ..."</p>
<p>Danas sam napokon zavr&scaron;io sve &scaron;to sam htio. Projekat je otvoren.</p>
<p>Klijentima sam poslao obećane informacije o tome &scaron;ta im <a href="http://www.bring.out.ba/fmk-ipak-ne-radi">možemo ponuditi nakon fmk</a>&nbsp; koje (nadam se) neće smatrati "prodajom magle".</p>
<p>Ali tako i protumače, &scaron;ta se može. Ja sam poduzeo sve &scaron;to sam mogao. Da sam ovo sve trebao jo&scaron; davno zakolutati, jesam. Ali sad pričati priče "da sam ...", i to je bez veze.</p>
<p>Međutim, ono &scaron;to je dobra stvar je to da mi se <span style="color: #000000;"><strong>sviđa mi se ono &scaron;to sam na kraju dobio</strong></span>. Stvarno sam otvorio pravi opensource projekat. Ono o čemu sam godinama pričao "<strong>trebalo bi ..</strong>", "<strong>mi ćemo ...</strong>", sada je napokon <strong>započeto</strong>. Postalo je prezent.</p>
<p>Ba&scaron; je interesantno kako se najednom desi "neki flow" ... nakon tolikog lutanja. Isto k'o da mi neko po pristima udara.</p>
<p>Ovo &scaron;to sam u zadnjih par dana uradio: <a href="http://www.bring.out.ba">www.bring.out.ba total redizajn</a>, nakon dugo vremna otvaranje pravog bloga (ovo &scaron;to čitate), otvaranje <a href="https://github.com/bringout">source code repozitorija za knowhow projekat</a>, otvaranje <a href="http://redmine.bring.out.ba/projects/knowhow/wiki">na&scaron;eg redmine-a za knowhow</a>&nbsp; ... jednostavno se desilo. Većinu od tih stvari op&scaron;te nisam planirao. To mi je jednostavno trebalo da klijentu objasnim ono &scaron;to mu želim ponuditi. Pa i svojim radnim kolegama ... Većina ljudi uop&scaron;te ne konta to &scaron;to pričam.</p>
<p>Čim otvori&scaron; usta sa "otvoren", "opensource", "linux" ljudi ovdje misle da si neozbiljan. A ja mrtav ozbiljan.&nbsp; I umoran k'o pa&scaron;će ... rekoh li to već ? Halalite.</p>
<p>knowhow knowhow, ako ti ne proguli&scaron; a ja padnem ko kru&scaron;ka, k'o &scaron;to će garant' bit, pravo ću se naljutit na tebe. S kim ja pričam ?!</p>
<p>Zepa. Puk'o. Allahimanet. Nema me do 06.12.2010 nidje, osim ovdje:</p>
<p><p><a href="https://gist.github.com/716872">https://gist.github.com/716872</a></p></p>
<p>Sociologija je izbačena iz rasporeda, jer mi je kao starom marksisti sa ETF-a&nbsp; predmet priznat :)</p>
<p>Pa eto neće biti 0 u skoru, odmah krećem od jedinice.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, b_knowhow, fit_2_godina, fit_mostar</div>
</div>
<div class='post_responses'>
<h4>1145 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<!--(bake includes/disqus.html)-->
</div>
</div>
</div>
</div>
</body>
</html>
