<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/11/programiranje-2-vjezbe-nepismeno2.html">Previous</a>
&nbsp; 
<a href="../../../index-14.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/11/fiskalizacija-je-velika-sansa-za-bringout.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Računarske mreže, 1. parcijalni</h3>
<div class='post_info'>
<span class='post_time'>November 30 2010, 10:36 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><span style="text-decoration: underline;"><strong>Dana&scaron;nja priprema</strong></span></p>
<p>Iako sam imao čitav dan pred sobom, danas nisam bio pretjerano fokusiran na spremanje ovog ispita.</p>
<p>Razloga je vi&scaron;e: dijelom zato &scaron;to su mi ostali workshop-ovi i vježbe za koje <a href="/racunarske-mreze-vjezbe-nepismeno">mi je inače prvi utisak bio: "&Scaron;ta je ba ovo ?!"</a>, dijelom zato &scaron;to sam vazdan ne&scaron;to "ćukao" po ovom <a href="/fiskalizacija-je-velika-sansa-za-bringout">članku</a>, a dijelom i radi toga &scaron;to sam znao da ću moći koristiti literaturu ako negdje zapnem.</p>
<p>Skroz sam podbacio sa planom. Plan je bio da se u prvom dijelu dana pročitaju vježbe i workshop-ovi (1.put), a da na kraju dana jo&scaron; jednom brzinski&nbsp; prođem po <a href="/racunarske-mreze-predavanja">predavanjjima</a> koje sam jednom pročitao.</p>
<p>Početak ispita je bio u 18:00, a u 17:30 ja sam tek čitao vježbu 5: Routeri :(. Workshop-ove ni od&scaron;tampao nisam. &Scaron;ta da radim ?</p>
<p><span style="text-decoration: underline;"><strong>Džoni hernad, džoni</strong></span></p>
<p><!--more--></p>
<p>Idem ja napraviti txt fajlove koje ću moći pretražiti. Pa ako ne&scaron;to ne budem znao potražiću u ovim txt-ovima:</p>
<p><p><a href="https://gist.github.com/722158">https://gist.github.com/722158</a></p></p>
<p>onda sam napravio skriptu za pretraživanje:</p>
<p><p><a href="https://gist.github.com/722162">https://gist.github.com/722162</a></p></p>
<p>i ovo je&nbsp; rezultat jedne pretrage:</p>
<p><p><a href="https://gist.github.com/722165">https://gist.github.com/722165</a></p></p>
<p><span style="text-decoration: underline;"><strong>Koncept ispita</strong></span></p>
<p>Ovaj test se polaže od kuće.</p>
<p>Bilo je 45 pitanja od kojih nekih 5 esejska.</p>
<p>Esejska su bila (po sjećanju):</p>
<ol>
<li>Objasnite &scaron;ta je to switch</li>
<li>Objasnite statističku metodu multipleksiranja</li>
<li>Navedite neke mrežne resurse</li>
<li>Navedite <a href="http://en.wikipedia.org/wiki/Nyquist%E2%80%93Shannon_sampling_theorem">Nyquist-Shannon-ovu teoremu</a></li>
<li>Objasni <a href="http://en.wikipedia.org/wiki/Carrier_sense_multiple_access_with_collision_detection">CSMA/CD</a></li>
</ol>
<p><span style="text-decoration: underline;"><strong>Da li je search u redu ?</strong></span></p>
<p>Kod pripreme ispita ni&scaron;ta nije precizirano. Vjerovatno bi bilo smije&scaron;no reći studentima: nemojte koristiti literaturu :)</p>
<p>Znači da je literatura, google, i bilo koji način pomoći u ovom polaganju dozvoljen.</p>
<p>E, ja nisam <strong>koristio google ni wikpediju</strong>.</p>
<p>Zato &scaron;to mi je neki dan jedan kolega &scaron;to je ispit položio rekao: "Raja uzme pa jednostavno copy/paste uradi članak iz wikipedije i naravno dobije za takav odgovor - 0 poena. Bitno je da barem par riječi izmjeni&scaron; tako da to izgleda kao tvoja formulacija :)</p>
<p>Stvarno, ima smisla. Iako iskreno,&nbsp; i bez njegovog savjeta ne bih nikada mogao biti ofiran. Pa ako i konsultujem wikipediju, smije&scaron;no je da to &scaron;to pi&scaron;em uop&scaron;te ne kontam.</p>
<p>Zato sam se ja pomagao svojim search-om:</p>
<ol>
<li>prelazeći predavanja, ionako sam vidio kategorizacije koje mi nisu sjele. Zato su jedini pravi izvor njihovih odgovora često samo materijali sa predavanja i vježbi</li>
<li>Druga je stvar to &scaron;to svako voli da čuje svoju formulaciju nego li "google top search result"</li>
</ol>
<p>Tako sam i uradio.</p>
<p>Kada bih na&scaron;ao odgovor,&nbsp; prisjetio bih se o čemu se tu radi, pa onda na svoj način ispisao to &scaron;to sam na&scaron;ao. Tako sam skroz izbjegao copy-paste, a ujedno i to &scaron;to navodim vi&scaron;e ili manje "shavizao". Za&scaron;to da ne: i ispit se može iskoristiti da čovjek &scaron;tagod nauči :)</p>
<p>Adrenalin prisutan na ispitu definitvno pomaže pamćenju.</p>
<p>Vrijeme je ograničeno (55 min), pitanja je poprilično, ali se čak&nbsp; i kada ima&scaron; dosta rupa (&scaron;to je sa mnom definitivno bio slučaj) može&scaron; se nekako i&scaron;čupati.</p>
<p>Istina, da sam se spremio kako treba, vjerovatno bi mi za ispit bilo dovoljno 40-tak minuta da uradim bez problema.</p>
<p>Ali sa druge strane, da nisam čitao, i da mi je tematika strana, izvjesno je da bi bio trofać. Bez obzira &scaron;to su mi svi resursi dostupni.</p>
<p><span style="text-decoration: underline;"><strong>LAN kolizijske domene</strong></span></p>
<p>Jedna stvar koju nisam stigao su kolizione domene. To trebam i&scaron;čitati. To sam taman čitao na vježbama pa me je ispit omeo :)</p>
<p>Bio je jedan ispit da se defini&scaron;e broj broadcast&nbsp; i kolizijskih domena. Tu sam se zbunio.&nbsp;</p>
<p>Brojao sam tako da je na između svakog hosta i switcha postoji jedan domena, dok je između hub-a i vi&scaron;e switch-eva to sve jedan kolizijski domen.</p>
<p>Između te dvije mreže postojao je router. Taj router nisam brojao.</p>
<p>Prema mom brojanju imao sam:</p>
<ol>
<li>5 switch kolizijskih domena (5 hostova vezano sa switchem)</li>
<li>1 hub kolizijski domen (3-4 hosta vezana za switch)</li>
<li>router je odvajao te dvije mreže</li>
</ol>
<p>Po meni odgovor je bio:</p>
<p>2 broadcast domene, 6 kolizijskih.</p>
<p>Ali ovog broja 6 u odabiru kolizijskih nisam imao ponuđenog ?! Je li moguće da je odgovor da nije bilo ponuđenog odgovora ? Ja sam tako ostavio.</p>
<p>Je li to bila zamka ?</p>
<p><span style="text-decoration: underline;"><strong>Ocjena je - prolaz!</strong></span></p>
<p>Bilo ne bilo, na kraju sam dobio rezultat: 60.09%. Znači prolaz garant. Raspitao sam se i procjena je da esejski dio nosi 20-25%. Od toga me garant sljeduje bar 10% i ja imam čistu 7. Mashallah!</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, ispit</div>
</div>
<div class='post_responses'>
<h4>1134 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
