<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/07/komunikacijske-tehnologije-seminarski-qos.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/06/ako-je-moja-zena-postala-docent-sta-sam-ja.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Kašnjenje</h3>
<div class='post_info'>
<span class='post_time'>June 28 2011,  8:44 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Pripremam se sastanak sa kolegama iz "Rama-glas"-a. Tema je status knowhow projekta.<p />Pripremam se ako &scaron;to čitam svoj blog, tickete na redmine-u,&nbsp; bilje&scaron;ke.<p />U &scaron;ta mi je pro&scaron;lo proteklih 7 mjeseci !?<p />Umoran sam, iscrpljen ... a opet trebam konstatovati:</p>
<blockquote class="posterous_short_quote">
<p>Nisam ispunio data obećanja !</p>
</blockquote>
<p>A i to "nisam" nije ono malo, nego skroz :(. <p />Čovječe, da li ja samo ma&scaron;tam da ja, odnosno moja firma može napraviti ono o čemu pričam ? Da li je sve ovo samo moja halucinacija !? Je li moj "voz pro&scaron;ao", ali se ja jo&scaron; ne mogu pomiriti sa tim&nbsp; ?</p>
<p><!--more--><p />Ne&scaron;to radim dan i noć i tako godinama, ali to ne&scaron;to je na kraju ni&scaron;ta ?!<p />Pregled blogova i redmine ticketa mi je dao retrospektivu ovog perioda:</p>
<ul>
<li>12/2010 - FIT ispiti, zimski rokovi, Fiskalizacija saga sa Tring-om, Fiskalizacijski "trvor" sa državnim institucijama</li>
<li>01/2011 - FIT, knowhow ERP - sprint_1</li>
<li>02/2011 - FIT, nakon ispita, zavr&scaron;ni, knjigovodstvo poku&scaron;aj ubacivanja novog čovjeka - neuspje&scaron;no</li>
<li>03/2011 - FIT seminarski (RM, UBP), knowhow ERP - sprint_2</li>
<li>04/2011 - FIT reporting, bring.out novi ljudi (1 uspje&scaron;no, 1 neuspje&scaron;no), fiskalizacijska ludara uoči 15. aprila</li>
<li>05/2011 - bring.out novi ljudi / 2.&nbsp; knowhow prodaja/fiskalizacija - OpenERP ili "green field" rje&scaron;enje(*)</li>
<li>06/2011 - FIT junski rokovi, Rama-glas, Vindija - ljudi pitaju ... a ja i dalje nemam ni&scaron;ta za pokazati ? Nervoza ispiti + nervoza knowhow = nervoza samo 'taka</li>
</ul>
<p><br />Kad se sve ovo sabere, ovo su glavni događaji iz proteklog perioda:</p>
<ol>
<li>puno FIT-ovanja - studiranja</li>
<li>Fiskalizacije previ&scaron;e - puno, puno vi&scaron;e od očekivanog</li>
<li>interni poslovi - zavr&scaron;ni račun, novi ljud</li>
<li>knowhow</li>
</ol>
<p><br /><span style="text-decoration: underline;"><strong><span style="font-size: medium;">FIT-ovanje, studiranje</span></strong></span><p />FIT-ovanje je jedini posao kod koga osjećam postignuće, kod koga sam napravio&nbsp; konkretan rezultat. Sve ispite sam uspio položiti u junskom roku. To je u čitavoj ovoj "gunguli" veliki uspjeh. Mogu slobodno reći da mi je FIT koliko-toliko pomogao da podignem samopouzdanje. Barem na jednom polju mogu reći da sam ono &scaron;to sam započeo - i zavr&scaron;io.<p />Interesantno je da sam razmi&scaron;aljao o tome da studiranje ove godine stavim na stand-by radi obaveza u firmi - prije svega realizacije "knowhow". Međutim, na kraju sam ipak shvatio da bi to odustajanje, onakav kakav sam, vjerovatno bilo i kraj projekta zvanog "zavr&scaron;iti FIT, donijeti babi diplomu". Motiv koji sam imao je bio dovoljno jak da odustanem od ove ideje.<br />Ako sam prije 15-tak godina zarad biznisa "batalio" ETF, to ovaj put nisam učinio. Svi "biznisi" nisu vrijedni jednog osmjeha mojih roditelja. A čovječe ... kako se samo raduju svakom položenom ispitu. Pa isto k'o da "Hardward" studiram.<p /><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Fiskalizacija</span></strong></span><p />&Scaron;to se tiče fiskalizacije, tu sam samo-tako oful'o. Kada sam projicirao &scaron;ta nas čeka pri fiskalizaciji, vidio sam se iskustvima koje smo imali prilikom fiskalizacije na&scaron;ih klijenata RS-u (a prije toga u Srbiji). Međutim, po tom pitanju je bilo hiljadu belaja, i jo&scaron; toliko nas čeka. <br />Bez obzia na razloge, bitno je da je fiskalizacija tegobna i da će nam ona jo&scaron; puno vremena i energije oduzeti. <p />U fiskalizaciji naravno ima prostora za zaradu. Ali, da sam kojim slučajem mogao birati između fiskalizacija u 2011 da ili ne - bez razmi&scaron;ljanja bih odabrao "NE".<p /><span style="text-decoration: underline; font-size: medium;"><strong>OpenERP</strong></span><p />Nisam gre&scaron;kom napisao OpenERP umjesto "knowhow". Od prve ideje "knowhow", OpenERP sam označio kao bazni projekat knowhow, ali nikada nisam stavio znak jednakosti knowhow = OpenERP.<p />Knowhow je moj projekat, OpenERP to nije. Knowhow je cilj, OpenERP sredstvo za postizanje tog cilja.<p />U proteklih 7 mjeseci utro&scaron;io sam 90-tak sahata na OpenERP. Malo. Premalo. <p />U tom periodu sam u dva navrata postigao kontinuran rad (kako je gore navedeno kao sprint_1, sprint_2). Ostatak je "oti&scaron;ao" na druge stvari. <p />OpenERP ima puno stvari odlično urađeno. Ima odličnu osnovu za podr&scaron;ku finansijskom i robnom knjigovodstvu (iako znatno manje gledajući na na&scaron;u postojeću praksu i zakone). Proizvodnja je dobro obuhvaćena.&nbsp; Ali ... Ah da ... uvijek kod mene to prokleto "ali".<p />Sviđalo se to "ali" meni ili ne, ono se opet pojavilo. Pojavilo se, ili bolje reći "pokazalo" se tokom aktuelne fiskalizacije.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Fiskalizacija</span></strong></span></p>
<p>Fiskalizacija je prvi plan stavila funkcije prodaje (maloprodaja i veleprodaja). Ovaj dio OpenERP-a je "najtanji" sa stanovi&scaron;ta na&scaron;ih potreba. OpenERP ima "sales" (veleprodaja) i "point of sale" (maloprodaja) module. Oni su međutim previ&scaron;e uvezani sa knjigovodstom.<p />Drugi veliki problem je taj &scaron;to fiskalizacija nije podržana. Ali to samo po sebi nije problem. Naravno da sam znao da OpenERP nema rije&scaron;enje fiskalne funkcije. Ono &scaron;to me je zateklo jeste dimenzija problema fiskalizacije.</p>
<p>Prateći probleme na terenu, utvrdio sam da su fiskalni drajveri proizvođača fiskalnih uređaja lo&scaron;i. Sa njima opet na&scaron;a aplikacija komunicira kao sa crnom kutijom. A ta crna kutija u svakoj situaciji novog problema najče&scaron;će samo - "u&scaron;uti". Dijagnostički dio tih drajvera je "&scaron;upica-tach".&nbsp; A sve to za posljedicu ima nove servisne i developerske aktivnosti. I &scaron;to je najbitnije, nervozu kod korisnika. <p />Nije problem kada se ne može napraviti knjiženje jedan dan. Ali je katastrofa da prodaja ne radi jedan dan. I to je tako prirodom posla.<p />Svjesni te činjenice, probleme fiskalizacije smo doista rje&scaron;avali promptno. U konačnici, svi problemi na koje smo do sada nai&scaron;li su rije&scaron;eni. FMK ima dobru podr&scaron;ku za neosoft uređaje koji se u većini nalaze kod na&scaron;ih klijenata.<br />Ali to nije konačno rje&scaron;enje. Od velike koristi bi bilo da je na&scaron; fiskalni "pametniji". Barem u onoj mjeri u kojoj su fiskalni drajveri proizvođača glupi. A iskustva kazuju da su poglupi.<p />Iz tog razloga sam do&scaron;ao do zaključka da moj prvobitni plan da se na knowhow (OpenERP) jednostavno "nalijepe" funkcije razvijene u FMK nije dobar.<p />Ako se to tako uradi, uvijek će biti "ka&scaron;ljanja". K'o dan je jasno da do pobolj&scaron;anja na strani fiskalnih drajvera neće biti. Oni su zadovoljili kriterije koje je država postavila (pro&scaron;li su certifikaciju) i njih (proizvođače) dalje od toga nije briga. Svaki problem koji se desi na relaciji ERP sistem-&gt;Fiskalni drajver je stvar koju treba "zakrpiti" ERP provajder.<p />Problem je kako te krpaže minimizirati - učiniti &scaron;to jednostavnijim i efikasnijim. Zato sam do&scaron;ao do toga da je jedino pravo rje&scaron;enje napraviti jednu čestitu aplikaciju koja bi obezbjedila "čist" API imeđu ERP klijenta i Fiskalnog drajvera proizvođača - fiskalni gateway (<strong>knowhow F2</strong>). <p />Pored fiskalnih funkcija, drugi veliki problem je taj &scaron;to OpenERP point of sale modul nije rje&scaron;enje za "Vindija use case" - Vidnija prodavnice. Prirodno rje&scaron;enje za njih su "light" POS moduli koji dobro funkcioni&scaron;u i u slučaju prekida veze sa centralnim serverom (off line režim POS modula).<p />Na Vindiju se "nakalemila" jo&scaron; jedna stvar. U februaru nam je jedan klijent zatražio rje&scaron;enje za mogućnost mobilne prodaje. Tu se kao (za nas) prirodno rje&scaron;enje pojavio "android" uređaj. Generalno, android, iphone predstavljaju novu mobilnih uređaja. Odlika svih tih uređaja je izrada aplikacija baziranih na web tehnologijama (HTML5). Kako HTML5 ima podr&scaron;ku za lokalni storage, svi gradivni elementi potrebni za izradu jednog kvalitetnog modula prodaje su tu.<p />Već postoje developerski alati koji omogućavaju da se sa istim tehnologijama napravi i dekstop i mobilni klijent.<p />Ove tri stvari su mi otvorile nove dileme, koje me ubrzo dovele do sljedećeg zaključka:<p />Najbolje je napraviti green-field modul prodaje (<strong>knowhow P1</strong>) i inteligentni fiskalni modul (knowhow F2) !<p />Do&scaron;av&scaron;i do ove tačke. Slijedio je novi prekid&nbsp; - junski rokovi na FIT-u.<p />Na ove aktivnosti sam potro&scaron;io <a href="http://redmine.bring.out.ba/issues/23259">50-tak knowhow sahata</a>. <p /><span style="text-decoration: underline; font-size: medium;"><strong>&Scaron;ta su knowhow P1 i F2 ?</strong></span><p />Do&scaron;av&scaron;i do ove tačke, već odavno prisutna nervoza generisana velikim ka&scaron;njenjem se i dodatno pojačala.<p />"P1" i "F2" postoje tek u mojoj imaginaciji. Kako ću svojim klijentima objasniti da je to rezultat mog rada ?!</p>
<p>Istina je da sam 4-5 manje radio na knowhow. Ali moje konkretno - vidljivo postignuće ispada ne 1/5 nego 0:</p>
<blockquote class="posterous_short_quote">
<p>Ernad je ponovo na početku ? bring.out sa mnom na čelu u stvari nije sposoban da proizvede proizvede novu generaciju rje&scaron;enja ?! knowhow će ostati samo moja halucinacija ?!</p>
</blockquote>
<p><br />Sve ovo zvuči meni samom zvuči zastra&scaron;ujuće. Mogu samo pretpostaviti kako će ovo zvučati mojim klijentima. <p />Treba li ovo pre&scaron;utiti ? "Kupiti" vrijeme ? Sačekat da se stvari barem djelimično konkretizirati, pa onda izaći sa novim prijedlozima ? <p />Ne.<p />Ne, zato &scaron;to bi time mogao dovesti u pitanje ono na &scaron;ta puno polažem, a to je iskrenost.&nbsp; Zavlačenje i ubleharenje ne smije biti moja strategija.<p />Ako su ublehe ono &scaron;to mrzim, onda moram paziti da ne uđem u zamku sopstvenog ubleharenja radi vi&scaron;ih poslovnih ciljeva.<p />Ovih 7 mjeseci su utro&scaron;eni kako su utro&scaron;eni. Ne preostaje mi ni&scaron;ta nego da vrijeme stavim na papir. Pa da se onda "porefenam". Sa sobom, i sa onima kojima sam dužan položiti račune u ovoj priči - sa svojim klijentima.<p />Izuzev&scaron;i angažman na fakultetu, svi moji potezi su bili usmjereni na cilj koji se zove "knowhow". Čak je i mnogo rada na fakultetu određeno planovima i ciljevima koje sam postavio u "knowhow".&nbsp; Da li je to pravilno utro&scaron;eno vrijeme ? Da li je to sve bila totalna "fula" ?<p />Traženje novih ljudi, reorganizacija firme, sve je to bilo i jeste usmjereno u pravcu "knowhow".<p />Istina je ta da sam od tog cilja daleko. Istina je da vrijeme "tutnji", a konkretnih rezultata nemam. "knowhow", čestit "bring.out software" su u ovom trenutku i dalje nedosanjan san ?!</p>
<p>Sve to mi nad glavom visi k'o Damoklov mač. <p />Koliko god me sve to gura da poku&scaron;am sa nekim "instant" rje&scaron;enjima, toliko me spoznanja da odluke koje sada donosim određuju moju karijeru sprječavaju da idem strategijom:</p>
<blockquote class="posterous_short_quote">
<p>Daj da ne&scaron;to "skuckamo", da zadovoljimo to &scaron;to ljudima treba, pa ćemo se kasnije "vaditi" ...</p>
</blockquote>
<p><br />Ne ! Ako to uradim, od "knowhow" neće biti ni&scaron;ta.<p />Krpaža je uvijek kratka vijeka. Ako sam u čemu siguran, u tome sam.</p>
<p>Međutim, ne treba stvari ni idealizirati. "Overthinking" je meni svojstven. Određeni stepen improvizacije je nužan. Ne postoje idealni konecpti. Dobro je rezultat ispravnih kompromisa. <p />Ali ne želim "krpiti", kako u prihvatljivom roku doći do potrebnih rje&scaron;enja ? Kako ovu stagnaciju pretvoriti u "pozitivan flow" ?</p>
<p>Ako dođem do cilja nakon &scaron;to izgubimo sve klijente onda opet ni&scaron;ta nisam dobio.<p />Kako sopstvenu i percepciju drugih promijeniti ?&nbsp; Je li mi suđeno da budem:</p>
<blockquote class="posterous_short_quote">
<p>hernad - ah to je onaj &scaron;to vazda ne&scaron;to mudrija i "priča" ali taj nikad ni&scaron;ta konretno ne napravi. Sve ti je kod njega bla bla priča ...</p>
</blockquote>
<p><br />Evo pi&scaron;em ... pa bih nakon svojih riječi pod sto od stida i straha od toga da ovo &scaron;to govorim nije ni&scaron;ta drugo do gola istina ...</p>
<p>Za&scaron;to sam stava da trebam "gurati" P1 i F2 module ? Zato &scaron;to su oni jedna zaokružena i koliko-toliko mala cjelina.</p>
<p>Zato &scaron;to su to funkcije koje klijenti svakodnevno i najvi&scaron;e koriste. Zato &scaron;to bi realizacija ovih modula nama kao firmi vratila pouzdanje da smo sposobni "iznijeti" na vidjelo konkretna programska rje&scaron;enja. Proizvesti novi software. Proizvesti !<p />Ako to postignemo, onda ćemo iz jedne sasvim drugačije perspektive moći odrediti buduće korake u projektu.<p />Spojiti knowhow P1 i knowhow F2 sa OpenERP knjigovodstvom ? Moguće ...<p />Nastaviti sa "green field" strategijom - dodavati funkcije&nbsp; u okvire koji su stvoreni sa P1 i F2 ... i to ima smisla.<p />Bez na&scaron;ih rje&scaron;enja i "reanimiranja" bring.out vlastite proizvodnje software-a jednostavno dalje ne ide.<p />Možda je već sada kasno. Ali nemam ni&scaron;ta od daljnjeg "dumanja" na temu:</p>
<blockquote class="posterous_short_quote">
<p>Je li kasno ? Je li bring.out mrtva firma ? Je li tvoja karijera software developer-a gotova, samo &scaron;to ti to ne zna&scaron; ?</p>
</blockquote>
<p>Biće &scaron;ta je dragi Allah odredio. Moj posao je poku&scaron;ati napraviti hairli posao. Moj posao je dati sve od sebe. Ali ne i PREKO sebe.<p /><span style="text-decoration: underline; font-size: medium;"><strong>Dinamika</strong></span><p />Iza svega ovoga slijedi logično pitanje:</p>
<blockquote class="posterous_short_quote">
<p>Ok, guraj ... Ali koja je dinamika ? Ne može se vječno čekati na taj tvoj imaginarni dobar software.</p>
</blockquote>
<p><br />I odmah takav rezon vodi u narednu zamku: Napraviti nove NEREALNE rokove. <p />Koji će me dodatno iscrpiti. Koji će generisati nove nervoze. Koji će mogućnost uspjeha jo&scaron; vi&scaron;e umanjiti.<p />E neću ponovo u tu zamku ulijetati ! Ne smijem biti blentav pa ponavljati scenario iz 2004. <p />A scenario je, nije se zgoreg podsjeitit, bio:</p>
<blockquote class="posterous_short_quote">
<p>Nadoknadiću sve prop&scaron;uteno preko ljeta. Pa ću raditi subote nedjelje, ....</p>
</blockquote>
<p>I u tom turbo scenariju za tren sam do&scaron;ao do tačke:<p />Ja ne znam ni 1+1 sabrati, a ne kamo li ne&scaron;to proizvesti !<p />Blentav jesi ali tol'ko blentav ne smije&scaron; biti !<p />Zato dinamika mora&scaron; odrediti realnu dinamiku. Ako unutar te dinamike ne uspije&scaron; - onda bar neće&scaron; kukati sam sebi do kraja života:</p>
<blockquote class="posterous_short_quote">
<p>Da mi je bilo vremena ja bih to zavr&scaron;io ...</p>
</blockquote>
<p><br />To je priča luzera. To je priča onih koji vazda okrivljuju druge i drugo za svoje neuspjehe. Nemoj biti luzer. Nemoj biti luzer makar se na kraju ispostavi da nisi kadra učiniti to za &scaron;to se bori&scaron;. <p />Musliman si. Djela se mjere po iskrenom nijetu. Nemoj to zaboraviti !<p />Pa dobro, ako si svega toga svjestan, koja je dinamika ?<p />Imaj u vidu: Od 02-09.07 si odsutan. Idem sa hanumom aBd u Tursku.<p />Od 10-15 će biti fiskalizacijska ludara. Znači u tom periodu opet ni&scaron;ta od pravog posla.<p />Ostaju dvije hefte jula do ramazana. &Scaron;ta u tom perioudu ? U tom periodu sa Sa&scaron;om zajedno napraviti T0. &Scaron;ta je T0 ? <p />To je knowhow developer's toolset. Da, zaboravih reći da je to stvar koju sam uoči ispita konkretno radio.</p>
<p>hernad i "konkretno" ? Pa eto, vidite i to "konkretno" nije "konkretno" - toolset sam za sebe ničemu ne služi :(. hernad majstor za tro&scaron;enje vremena na nekonkretno ...</p>
<p>Ali dosta si sam sebe &scaron;amar'o ... vrati se na 15-30 juli.</p>
<p>U tom periodu precizirati funkcionalne zahtjeve P1, F2. Ako se &scaron;ta napravi dobro i jeste. Bitno je napraviti odabire i <strong>obuku developera</strong>. Da. Ovaj put developeri imaju ODVOJENO vrijeme za pripremui obuku. A ne kako sam ja to ranije običavao i pravio gre&scaron;ke:</p>
<blockquote class="posterous_short_quote">
<p>Ma to ti je lahko. Evo ti jezik, Evo ti džonovi i počnimo raditi</p>
</blockquote>
<p>Ne. I ja i sa&scaron;a moramo imati na svom računaru sve &scaron;to nam treba da proizvodimo software. I to treba biti uniforman toolset. Od tekst editora preko programskih jezika do frameworka, metodologije razvoja i konverncije programiranja.<p />Sa&scaron;a je pametan i sposoban čovjek. On je taj koji na kraju krajeva na svojim leđima uspje&scaron;no drži FMK.&nbsp; Ti i Sa&scaron;a znate ste sposobni napraviti dobre stvari. Bitno je samo da se ubacite u pravi ritam. Na kraju krajeva mi smo (u developerskom smislu) know-how koji bring.out posjeduje. I to je to. Vi&scaron;e nema, niti &scaron;ta mimo toga možemo "roditi".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Macomanija</strong></span></p>
<p>Prije mjesec dana, u toku&nbsp; T0/P1/F2 mozganja sam nabavio MacBook Pro notebook. Par dana nakon toga i iPhone. Totalna apple-izacija. Za&scaron;to ? <p />Zato &scaron;to sam prilikom testiranja postojećih mobile developerskih alata uočio da 99% developera iz ovog domena kao primarnu platformu za razvoj koristi Mac. Ciljne korisničke platforme mogu biti (i jesu) Linux, Windows, Android ali ljudi za razvoj isključivo koriste Mac-ove. <p />Godinama sam sam sebi davao komentar:</p>
<blockquote class="posterous_short_quote">
<p>Ma to se Amerikanci "pres..avaju". Kupuju Mac-ove samo zato &scaron;to je biti Mac user "cool".</p>
</blockquote>
<p>Već nakon heftu dvije rada sa Mac-om shvatio sam u čemu je kvaka. Ovo je najbolji sistem za razvoj aplikacija. Upali&scaron;, pi&scaron;e&scaron; i ne misli&scaron; vi&scaron;e na računar. On jednostavno radi. <p />U ovih mjesec dana ne mogu se sjetiti nijednog problema koga sam adresirao kao:</p>
<blockquote class="posterous_short_quote">
<p>Ma handri me računar.</p>
</blockquote>
<p>Zato sam prije par dana nabavio jo&scaron; jedan MacBook Pro - za Sa&scaron;u. <p />Mac-ovi nas sigurno sami po sebi neće dovesti do željenog cilja. Ali će zasigurno moguće probleme sa oznakom "handri me računar" svesti na najmanju moguću mjeru.<p />&Scaron;to kaže Jasko bring.out:</p>
<blockquote class="posterous_short_quote">
<p>Ti si vazda kukao na svaki svoj računar: Ne radi mi ovo ne radi mi ono. Ne sjećam se da si duži period koristio računar bez ikakvi primjedbi.</p>
</blockquote>
<p>Pored pozdanosti, treba napomenuti da je kori&scaron;tenje Mac-a prava inspiracija za informatičara po pitanju korisničkog iskustva (***).&nbsp; <p />Zato ću Sa&scaron;i i Sebi reći: <p />Hajmo napraviti software koji će se i Mac useru svidjeti.<p />Dobro. Znam. Mi te standarde sada ne možemo postići. Ali će nam definitivno svakodnevni rad na Mac-u pomoći ovim aspektima aplikacije posvetimo potrebnu pažnju.<p /><strong><span style="text-decoration: underline; font-size: medium;">Bakir</span></strong><p />Moj Bakir u zadnje vrijeme non-stop kuka. U sklopu tog kukanja meni govori:</p>
<blockquote class="posterous_short_quote">
<p>Ti ne zna&scaron; ni&scaron;ta drugo nego raditi !</p>
</blockquote>
<p>A u vrijeme ispita:</p>
<blockquote class="posterous_short_quote">
<p>Ti ne zna&scaron; ni&scaron;ta drugo nego učiti !</p>
</blockquote>
<p>Pa na sve to k'o iz vedra neba ubaci:</p>
<blockquote class="posterous_short_quote">
<p>Mene niko ne voli !</p>
</blockquote>
<p><br />Dijete je nezadovoljno. Željno babe. Kako i ne bi kada, nakon &scaron;to u neka doba dođem kući, nemam snage da ga saslu&scaron;am a ne kamo li da se sa njim poigram i popričam.<p />Sa FIT-om sam koliko-toliko pričinio zadovoljstvo svom babi i materi. Ali sa tom prilikom "otkin'o" od ono malo vremena koje odvojim za svoju djecu. Knowhow je to malo napravio jo&scaron; manjim. <p />Rijetke su subote i nedjelje koje sam u posljednjih sedam mjeseci odvoji za svoju djecu. P radnim danima da ne govorim. I &scaron;ta na kraju bude ?</p>
<p>Paradoks je taj &scaron;to se to nezadovoljsvo uveliko osjeti u mom radu. <p />Programiranje i informatika nisu poslovi koji se mogu na silu raditi. Bez čistog razuma i pune koncentracije čovjek ne može puno uraditi.&nbsp; Od jedan se ne može stvoriti dva.&nbsp; Često se uhvatim u mislima:</p>
<blockquote class="posterous_short_quote">
<p>Nema te po čitav dan, a opet ni&scaron;ta nisi napravio ? &Scaron;ta ti čovječe uop&scaron;te radi&scaron; ? What is the point ?!</p>
</blockquote>
<p>Jednostavno se čovjek u svemu tome istro&scaron;i. Na kraju se ispostavi da si ogromnu energiji utro&scaron;io na skroz pogre&scaron;an način.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Dinamika / 2</span></strong></span></p>
<p>Vikend sa djecom se ne smije preskakati ! Koliko taj vikend treba mojoj djeci, isto tako treba i meni. Bez njega se "čovjeku" baterije ne pune. Sa&nbsp; "praznim baterijama" se ne može ni&scaron;ta dobro napraviti.<p />Zato dinamiku ne smijem praviti tako &scaron;to ću krasti od svoje djece. Pa makar to bio i knowhow. Makar to bila budućnost firme. Ako je kalkulacija dinamike spala na tu matematiku, onda je dinamika nerealna i pogre&scaron;na. <p />Iza jula ide ako Bog da, ramazan. Ramazan je vrijeme u kome se čovjek treba posvetiti ibadetu. U kome mora imati imati vremena otići na sa svojo porodicom na teraviju. U kome mora imati vremena za iftar.&nbsp;&nbsp; U kome mora imati vremena za dovu.<p />Nema ni&scaron;ta od ubrzane poslovne dinamike za ramazan ! Ako je kalkulacija dinamike spala na tu matematiku, opet - ne valja ti dinamika !<p />Ramazan je vrijeme kada čovjek mora napuniti baterije imana. Te baterije se tokom godine isprazne.</p>
<p>Zato se ne smije ramazan dočekati sa rezonom:</p>
<blockquote class="posterous_short_quote">
<p>Kud sad ? Kako ću stići zavr&scaron;iti sve poslove preda mnom ?</p>
</blockquote>
<p><br />Ne radi to sebi. Fulaće&scaron;. Neće&scaron; dobiti ni&scaron;ta ni od poslova ni od ramazana. Zato reci:</p>
<blockquote class="posterous_short_quote">
<p>Elhamdulillah. Da čovjek u zdravlju dočeka provede ramazan. Da ga osjeti u svoj svojoj ljepoti.</p>
</blockquote>
<p><br /><span style="text-decoration: underline; font-size: medium;"><strong>Rezime</strong></span><p />Ovaj post je vjerovatno favorit da bude moj najduži članak ikada napisan.<p />Vjerovatno i kandidat za najkonfuznije napisan članak. <p />Možda i kandidat za najblentaviji članak.<p />Vjerovatno kandidat za najiskreniji članak.</p>
<p>Sa stanovi&scaron;ta posla, vrlo moguće samoubilački čin. U svakom slučaju krajnje neobična priprema za sastanak sa klijentom.</p>
<p><br />--- <br />(*) green field<br />(**) API - application programming interface<br />(***) User experience</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, business, b_knowhow, dunjaluk</div>
</div>
<div class='post_responses'>
<h4>677 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>