<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/06/svjedok-1.html">Previous</a>
&nbsp; 
<a href="../../../index-8.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/06/komunikacijske-tehnologije-tcp-3-way-handshak.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Postignuće, "ahaa" efekat</h3>
<div class='post_info'>
<span class='post_time'>June 18 2011, 10:20 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>U procesu učenja je osjećaj postignuća je za mene bitan faktor. Mogu komotno reći presudni.</p>
<p>Kada ne&scaron;to čitam, i nakon toga ne osjetim "Ahaa" efeket osjećam pravu nelagodu. Često se na&scaron;alim sa svojim mlađim kolegama pa im kažem:</p>
<blockquote class="posterous_short_quote">
<p>Kada bi vama čovjek dao telefonski imenik, vama to ne bi bio problem naučiti.</p>
</blockquote>
<p>Meni je usvajanje nerazumljivih sadržaja veliki problem. Ogroman. Skoro nepremostiv. Osjećam se ko cuko koga treniraju da donese kost koja mu se baci.</p>
<p><strong>Ne osjećam postignuće</strong>. Ulažem trud koji je u startu u mojoj glavi "tagiran" kao: "totalno beskorisno".</p>
<p>Kada si čovjek u mojim godinama, onda ti takve stvari prirodno mnogo vi&scaron;e smetaju.</p>
<p>Umjesto da se poigram sa svojom djecom koja su me željna, ja tro&scaron;im vrijeme na ne&scaron;to "niđe veze", &scaron;to bi moja <a href="/tag/h_samra">Samra</a> rekla.</p>
<p><!--more--></p>
<p>Kada idemo na ispite, često ponavljamo ove <a href="/racunarske-mreze-priprema-za-ispit">naratorske predmete</a>. Ja pomno slu&scaron;am svoje kolege.</p>
<p>Neki od njih su sposobni da nakon par čitanja izreproduciraju 100-njak stranica bez ikakvih problema ... Da se razumijemo: I TO JE fakat jedna vrsta postignuća.</p>
<p>Međutim, da li je to postignuće koje treba forsirati na fakultetu kao &scaron;to je FIT ? Da li je to stvar koju studentima treba "ugraditi" ? Da li je smisao studiranja u tome ?</p>
<p>Naravno, većina od ovih pitanja su za mene čisto retoričke prirode. Moje određenje po ovim pitanjima međutim nije rezultat isključivo mog "nami&scaron;ljanja" i imaginacije.</p>
<p>Vidio sam se nastava može i <a href="http:///sta-trebamo-uciti-na-tehnickim-fakultetima">drugačije organizovati</a>. Paradoksalna je činjenica da takva iskustva potiču iz pre-internet vremena.</p>
<p>Upravo ta činjenica je dobar&nbsp; pokazatelj gdje smo mi na području obrazovanja zastali.&nbsp; <span style="color: #ff0000;">Zastali smo tako da je koncept nastave od prije 22 godine bio napredniji nego li danas</span>.</p>
<blockquote class="posterous_short_quote">
<p>Ali čekaj ! O čemu ti priča&scaron; ?!&nbsp; Sada se polažu ispiti preko interneta ?! Zar to nije napredak ?</p>
</blockquote>
<p>reći će neko.</p>
<p>Moj komentar na ovakve konstatacije je:</p>
<blockquote class="posterous_short_quote">
<p>Mogao bi biti. Ali apriori nije.</p>
</blockquote>
<p>Znanje je znanje. "Copy-paste", puko memorisanje informacija, nije znanje o kome ja govorim. To je sposobnost reprodukcije.</p>
<p>Ta sposobnost je na studiju prava sigurno vrlo bitna, ali na tehničkim fakultetima priča mora biti skroz drugačija.</p>
<p>Postignuće...</p>
<p>Prosječan student postignuće mjeri prevashodno brojem položenih ispita. Dru&scaron;tvo, okruženje je uspostavilo taj sistem mjerenja.&nbsp; I to je sasvim OK.</p>
<p>Sistem obrazovanja je taj koji je odgovoran da to postignuće u dovoljnoj mjeri korelira sa usvojenim korisnim znanjem i vje&scaron;tinama.</p>
<p>Sistem obrazovanja je ne&scaron;to pravo moćno. On razdvaja bogata dru&scaron;tva od siroma&scaron;nih. "Gornje" od "donjih".</p>
<p>Mi nažalost imamo sudbinu "donjih". Bez ikave nade da se stvari promjene.</p>
<p>Želim svim svojim kolegama da sa svojom diplomom &scaron;to prije nađu dobar posao. Ali im jo&scaron; vi&scaron;e od toga želim da ih na tom poslu ne dočeka neki "nabrijani" poslodavac koji će im nakon kratkog vremena reći:</p>
<blockquote class="posterous_short_quote">
<p>Vi pojma nemate. &Scaron;ta su vas na uop&scaron;te na tom fakultetu uop&scaron;te učili ?!</p>
</blockquote>
<p>Ako jo&scaron; shvatite da je to &scaron;to vam taj grubi i bezobrani čovjek govori u su&scaron;tini gorka istina, va&scaron;e osjećaj postignuća usljed zavr&scaron;enog studija rastopiće se k'o sladoled na ljetnom "zvizdanu".</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, fit_mostar, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>728 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<!--(bake includes/disqus.html)-->
</div>
</div>
</div>
</div>
</body>
</html>
