<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/06/it-poletarci-de-ste.html">Previous</a>
&nbsp; 
<a href="../../../index-8.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/06/postignuce-ahaa-efekat.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Svjedok -1</h3>
<div class='post_info'>
<span class='post_time'>June 21 2011,  2:41 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Vratio sam se sa <a href="/svjedok">saslu&scaron;anja</a>. Ispostavilo se se radi o slučaju ubistva <a href="http://www.zenicablog.com/crna-hronika/ostalo/3571-identifikovan-dr-sladojevi.html">Zeničanina, doktora Veljka Sladojevića</a>.</p>
<p>Ja o tom događaju ne znam ni&scaron;ta.</p>
<p>Kao čovjek, kao pripadnik ARBiH, kao Zeničanin, nadam se da će se počinioci tog zločina naći i kazniti.</p>
<p>Čovjek je na bigajrihaak ubijen. Samo zato &scaron;to je imao "pogre&scaron;no" ime.</p>
<p>Ako smo osjetljivi na sve ubijene Bo&scaron;njake samo zato jer su imali "pogre&scaron;no" ime, moramo sa istim osjećajem tuge i gnu&scaron;anja gledati na ovakve događaje. Da bi ostali ljudi.</p>
<p>Ako to ne postane dio na&scaron;e kolektivne svijesti, bićemo tek na korak od onih koji su sve ove zločine činili.</p>
<p>Iza&scaron;ao sam iz suda u nekakvom "mixed-fillings" stanju ...</p>
<p><!--more-->Sa jedne strane sa olak&scaron;anjem &scaron;to nisam dio jedne ovakve priče. Mogu samo pretpostaviti kako bi bilo nositi teret znanja (a uz to nečinjenja) o detaljima ovakvog zločina.</p>
<p>S druge strane sam bio tužan &scaron;to ne mogu biti od koristi. Da, ovakav blentav kakav sam, ne bih tajio informacije. Bez obzira &scaron;to znam&nbsp; da bi to moglo stvoriti hiljadu belaja kako za mene tako i za moju porodicu. Međutim, takve dileme su za mene ipak dileme tipa: "Jesam li čovjek ili gu&scaron;ter ?"</p>
<p>Treći osjećaj je osjećaj je ta gorka spoznaja e tome da sam bio akter vremena i prostora u kome su ljudi ubijani na ovakav način.</p>
<p>Mi, koji smo tu bili tu, u najmanju ruku nismo bili kadri ovakve stvari spriječiti.</p>
<p>Da se razumijemo: Nisam "bekan" pa da sam gajio iluzije da u redovima ARBiH nije bilo zločina. Nije mi trebao ovakav događaj da takvo &scaron;to saznam. Međutim, kada se čovjek na bilo koji način uključi direktno u ovakve događaje, stvari sa racionalne prebaci na emocionalnu ravan. A na toj ravni je pogled jo&scaron; gori. Jo&scaron; vidljiviji. Jo&scaron; očitiji. Jo&scaron; teži. Čak i u mom slučaju - slučaju zalutalog svjedoka.</p>
<p>Istražitelj mi je na kraju razgovora rekao da o ovome ne pi&scaron;em. Začudio sam se kada sam shvatio da su imali dojavu da sam blogirao poziv za saslu&scaron;anje.</p>
<p>Obećao sam mu da neću pisati ni&scaron;ta o detaljima istrage.&nbsp; Računam da ovim pisanjem nisam prekr&scaron;io to obećanje, s obzirom da članak ni&scaron;ta ne govori o toku tog saslu&scaron;anja.</p>
<p>Ako jesam, neka mu onaj &scaron;to mu je za prvi članak dojavio, dojavi da sam ne&scaron;to neprimjereno naveo. Zadnja stvar koju bih želio postići je ugrožavanje ovakve istrage.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dunjaluk, rat</div>
</div>
<div class='post_responses'>
<h4>610 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
