<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/02/fit-iii-semestar-drugi-parcijalni-nakon-ispit.html">Previous</a>
&nbsp; 
<a href="../../../index-10.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/02/bringout-bezobraznici.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Bosna - "Monty Python" reality show </h3>
<div class='post_info'>
<span class='post_time'>February  2 2011,  3:34 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><em><strong><span style="color: #ff0000;">(Update 05.03.2010: <a href="./e-jesam-se-provalio">E jesam se "provalio" ..</a>)</span></strong></em></p>
<p>Pored toga &scaron;to smo <a href="/bringout-bezobraznici">bezobraznici</a>, mi smo veliki prgavci. Dobro, da budem precizan - ja sam prgavac.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Općina Zenica</strong></span></p>
<p>Općina Zenica je klijent bring.out od prvih dana na&scaron;eg postojanja - 1996. Moj rad za Općinu datira jo&scaron; od <a href="/25-godina-hardware-a-i-software-a">rata</a>, kada sam "na fu&scaron;" počeo za njih raditi.</p>
<p>Općina Zenica je k'o i većina bosanskih državnih institucija. Svako malo ima&scaron; nekog &scaron;efa ili direktora. Onih koji rade posao najmanje ...</p>
<p>Međutim, nije moja namjera analizirati općinski aparat. Predmet ovog članka nije struktura, nego sadržaj i način funkcionisanja tog aparata.</p>
<p><!--more-->Za razliku od drugih, znatno manjih općina (Žepče, Zavidovići) Općina Zenica nikada nije željela potpisati "jače" ugovore o podr&scaron;ci. Vazda "osnovci". I to je svako malo izazivalo nesporazume po istim pitanjima:</p>
<blockquote class="posterous_short_quote">
<p>Za&scaron;to je to tako skupo ? Može li to brže ? Problem nam je, platićemo, za&scaron;to morate čekati uplatu avansa ?</p>
</blockquote>
<p>S obzirom na činjenicu da su uvijek bili uredne plati&scaron;e, u njihovom slučaju smo prihvatili da servise obavimo odmah po prijemu narudžbenice.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Fleksibilnost</strong></span></p>
<p>Na stranu plaćanje. Ključna stvar je ta &scaron;to korisnik sa jačim ugovorom "kupuje" na&scaron;u <strong>fleksibilnost</strong>. Objasniću &scaron;ta pod time mislim.</p>
<p>Kada se uoče neki problemi pri radu, kod korisnika sa jačim ugovorima se ne gleda na broj izlazaka na teren, na to da li treba uraditi sitnu korekciju aplikacije. Ljudi imaju Ugovor(*) - treba im &scaron;to prije uraditi posao. &Scaron;to je veći nivo ugovora to je na&scaron;a fleksibilnost u djelovanju prema korisniku veća.</p>
<p>Tako primjera radi, ako korisnik ima &gt;= srebreni ugovor, ako postoji zahtjev hitne prirode, mi ga redovno rje&scaron;avamo. Iako to u ugovoru ne pi&scaron;e.</p>
<p>Ugovor je okvir. Slijepo pridržavanje ugovora bilo bi sitničarenje. Rigidan odnos - sitničarenje s pravom kod klijenata izaziva nezadovoljstvo.</p>
<p>Držeći se ovog prinicipa, prava je rijetkost da se dodatne servisne aktivnosti koje&nbsp; "iskoče" iz okvira ugovora fakturi&scaron;u.</p>
<p>Kada me korisnici pitaju o tome &scaron;ta koji ugovor sa sobom nosi, ja uputim kontra-pitanja:</p>
<blockquote class="posterous_short_quote">
<p>Koliko je va&scaron; biznis veliki ? Koliko vas ko&scaron;ta zastoj u radu ? Koliki komfor kao klijent želite ?</p>
</blockquote>
<p>Kada na ova pitanja odgovorite, onda birajte ugovor.</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Općinski &scaron;efovi i direktori</strong></span></span></p>
<p>Ove godine smo ponovo Općini Zenica uputili prijedlog Ugovora. I oni su opet odabrali <strong>osnovni ugovor</strong>. Međutim, radi niza zahtjeva, njihovi tro&scaron;kovi su počeli rasti astronomskom brzinom. Pored tro&scaron;kova, koji mnoge od njih plaho ne "tangiraju" - nisu njihove pare, problem je bio sa brzinom odziva.</p>
<p>Njihovi problemi se rje&scaron;avaju sa najnižim prioritetom.</p>
<p>Krajem januara, nakon njihovih pritužbi na cijene i brzinu odziva, Sa&scaron;a im je ponovo objasnio da je "kvaka" u Ugovoru. I oni su rekli:</p>
<blockquote class="posterous_short_quote">
<p>Ok, idemo onda na bronzani ugovor.</p>
</blockquote>
<p>Po&scaron;to je netom jedna aktivnost realizovana, zamolili su da se ta aktivnost ne fakturi&scaron;e po osnovnom, nego da se "pripi&scaron;e" novom - bronzanom ugovoru. Ja sam rekao:</p>
<blockquote class="posterous_short_quote">
<p>Neka ne bude ni po njihovom ni po na&scaron;em - stavićemo popust 50%.</p>
</blockquote>
<p>Prepravili smo tu ponudu na osnovu koje trebaju uraditi plaćanje i pripremili prijedlog Ugovora. Njihov zahtjev je bio da se u odnosu na uobičajene dvije kopije napravi klauzula na četiri kopije ugovora - "to tako kod njih mora biti". U redu - nikakav problem.</p>
<p>Juče je Željka oti&scaron;la u Općinu. Vratila se sa ovom informacijom:</p>
<blockquote>
<p>Bila u Općini Zenica da odnesem ugovore. Prvo sam bila kod gospođe &lt;G1&gt; ( &lt;X&gt; sprat, soba &lt;XX&gt;). Ona je odmah pitala za&scaron;to smo im poslali  ponudu za MIP obrazac kada su oni tražili da to ide kroz ugovor. Zatim  je ona oti&scaron;la do svog &scaron;efa da mu pokaže ugovor, na&scaron;ta je on odmah  poludio i rekao isto &scaron;to i ona, za&scaron;to smo im slali ponudu ? On nije htio  ni&scaron;ta da ima sa na&scaron;im ugovorom, pa me je ona dalje uputila do  direktorice &lt;G2&gt;.<br />Ona je isto bila vidno uzrujana radi ugovora.  Počela je čitati ugovor i ne&scaron;to &scaron;arati po njemu, ispravljati ga. Kaže da  na&scaron; ugovor nije dobar.</p>
<p>Ispravila/dodala je sljedeće iz ugovora:</p>
<ul>
<li>Husejin Smajlović, Načelnik općine (kod nas pi&scaron;e samo Načelnik), ovo je vidno uzrujalo</li>
<li>zatim je počela križati gdje god pi&scaron;e u tekstu "zaokružiti željenu opciju" </li>
<li>i rekla je da u ugovoru nedostaje član 31.</li>
</ul>
<p>Kaže kad ovo sve ispravimo na ugovoru i napravimo ugovor kakav treba da joj se javimo.</p>
<p>Kaže da joj je najgluplje na na&scaron;em ugovoru ovaj dio gdje se  zaokružuje željeni ugovor. Njoj nije jasno za&scaron;to se to na njihovom  ugovoru nalazi.</p>
</blockquote>
<p>Kad sam ovo pročitao, "poludio sam". Eto ba&scaron; je bitno da li pi&scaron;e "Načelnik" ili "Načelnik općine" ?! <strong>Ali&nbsp; ako je već tako bitno, pa za&scaron;to prije par dana, prilikom potpisivanja osnovnog ugovora, nisu imali nikakvih prigovora ?! </strong></p>
<p>Zato &scaron;to sada potpisuju ugovor radi kojeg im se trebamo klanjati ?! JaRabbi.&nbsp; &nbsp; <strong><br /></strong></p>
<p>&Scaron;to se tiče druge stavke, Sa&scaron;a je, radeći korekcije ugovora gre&scaron;kom napravio ovu nespretnu korekciju:</p>
<blockquote>
<p>Korisnik se odlučuje na paket usluga&nbsp; Bronzani <span style="color: #ff0000;">| Srebreni | Zlatni</span> (zaokružiti željenu opciju) na osnovu specifikacije iz člana 2. ovog Ugovora, a Izvođač prihvata izvr&scaron;enje istih.</p>
</blockquote>
<p>Zapažanje direktorice je tačno - nakon &scaron;to je ostala samo jedna opcija&nbsp; "(zaokružiti željenu opciju)" je besmisleno. Međutim, to kvalificirati sa <strong>"glupost"</strong> ?! Direktorice, direktorice, nismo zajedno ovce čuvali.</p>
<p>Ako ćemo "mak na konac", taj nedostatak ne naru&scaron;ava sadržaj - to bi valjda trebalo biti najbitnije ?! U va&scaron;em svijetu stvari očigledno ne hodaju tako. Bitno je prije svega pokazati ko je "faca", a ko "papak".</p>
<p>Upućene zamjerke imaju smisla, i nije problem u njihovom otklanjanju. Problem je u tonu i kontekstu čitavog događaja. Nakon &scaron;to sam pročitao, moj prvi komentar je bio:</p>
<blockquote class="posterous_medium_quote">
<p>Nećemo im praviti novi ugovor, jer ne volim da mi neko radi budale&scaron;tina  demonstrira silu, kao &scaron;to oni čine. I da ... posebno sam osljetljiv kada  to rade državni službenici. Oni tro&scaron;e pare nas poreznih obveznika koji  se "sturi&scaron;e" da zarade dinar i za sebe i za njih.</p>
</blockquote>
<p>Kada dodatno razmislim, ovaj događaj je samo bio okidač za sve ono na &scaron;to sam se ranije "ibretio", kada je u pitanju pona&scaron;anje općinskih &scaron;efova i direktora.</p>
<p>Ovo su "ibreti" koji su mi bili na pameti:</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>&Scaron;efov prijedlog serviserima</strong></span></p>
<p>Pro&scaron;le ili pretpro&scaron;le godine, pričajući "bisere" sa terena, serviseri su mi pomenuli scenu sa pomenutim općinskim &scaron;efom:</p>
<blockquote class="posterous_medium_quote">
<p>Opet su kukali na veličinu na&scaron;e fakture. Neće&scaron;  vjerovati, &scaron;ef nam je predložio da mi ovo odradimo na crno, za svoj  račun. Hajd' kad to neko predloži iz državne firme, ali čovječe takav  prijedlog od nekoga iz Općine ?!</p>
</blockquote>
<p>Eto, tako "mudri" &scaron;ef &scaron;titi budžetska sretsva. JaaRabbi.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">&Scaron;efovo "DA"</span></strong></span></p>
<p>Nakon &scaron;to im je obja&scaron;njavano o bitnosti odabira odgovarajućeg Ugovora o podr&scaron;ci, &scaron;ef je Sa&scaron;u pitao:</p>
<blockquote class="posterous_short_quote">
<p>E reci ti meni, &scaron;ta ti znači ovo "DA" (pokazujući na jednu od stavki tabele iz člana 2.)</p>
</blockquote>
<p>Sa&scaron;a je u nevjerici odgovorio:</p>
<blockquote class="posterous_short_quote">
<p>Čekajte malo, vi mene zezate !? Tu se obja&scaron;njava &scaron;ta vam nudimo. "DA" kaže da je određena usluga uključena, "NE" znači da nije.</p>
</blockquote>
<p>Čovjek očigledno sebi nije htio sebi dao zahmeta pa da od početka do kraja pročita dvije stranice teksta, pa se odlučio na demonstraciju svoje "moći" postavljanjem ovakvog pitanja.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kupovina ultrasonične računarske opreme</strong></span></p>
<p>Solidan izvor na&scaron;ih primanja od Općine su bile intervencije nakon nabavke novih računara. Nakon &scaron;to se novi računar stavi u funkciju, gotovo u pravilu u slijedećih mjesec dana se desi barem jedan čudan problem: pao sistem, čučno hard disk, mrežna kartica ne radi.</p>
<p>Pri jednom takvo servisu, novonabavljeni računar nije imao paralelnog porta, &scaron;to je bio glavni zahtjev naručioca računara(**). Neko od &scaron;efova (ko zna koji kad ih ima "more" - može bit' da je opet ovaj gore "mudrac") je uočio da tu ne&scaron;to nije u redu, pa je pitao na&scaron;eg servisera za mogući uzrok problema:</p>
<blockquote class="posterous_short_quote">
<p>Odakle sad ti problemi sa opremom ?! Mi smo kupili najbolji računar, a vi kažete da mu ne&scaron;to fali ?!</p>
</blockquote>
<p>Pokazao je fakturu, na kojoj su bile tehničke karakteristike računara. Kada je pogledao fakturu, prvi komentar na&scaron;eg servisera je bio:</p>
<blockquote class="posterous_short_quote">
<p>&Scaron;ta ste ovo ovoliko plaćali ?! Za ove pare ste mogli računar i p'o (ove kategorije) kupiti ?!</p>
</blockquote>
<p>Onda je pozvan stručnjaka iz IT sektora, koji je odabrao konfiguraciju, pa ga pitali za&scaron;to je računar tako skup. Odgovor je bio:</p>
<blockquote class="posterous_short_quote">
<p>Ma ne razumiju oni(***) o čemu se tu radi. Na tom računaru ima poseban sistem za hlađenje kući&scaron;ta/procesora - 'naka komora.</p>
</blockquote>
<p>Super. Dobili su ultrasonični sistem hlađenja računara. Ali nije super &scaron;to to korisnicima nije potrebno, i &scaron;to nisu dobili traženi paralelni port.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Indiskrecija</span></strong></span></p>
<p>Ne znam ni sam koliko puta sam prilikom ovog članka sam sebi rekao:</p>
<blockquote class="posterous_short_quote">
<p>Ti si fakat Ernade lud, za&scaron;to ovo govori&scaron; ?!</p>
</blockquote>
<p>Pa nakon toga:</p>
<blockquote class="posterous_short_quote">
<p>Ti čovječe priča&scaron; o internim stvarima između tebe i tvog klijenta. To je neprofesionalno !</p>
</blockquote>
<p>Pa na kraju:</p>
<blockquote class="posterous_short_quote">
<p>I ba&scaron; si se od svih "naklapastio" na svoje Zeničane, babo će te se odreći ...</p>
</blockquote>
<p>Povjerljivost privatnih informacija klijenta je jedna od temeljnih stavki odnosa klijent-dobavljač. Davanje u eter takvih informacija je ne&scaron;to najgore &scaron;to davalac usluga može učiniti.</p>
<p>Da li je publikovanje ovih informacija neetično ? Da li prelazim granicu do koje želim držati ? Ne znam. Nisam siguran.</p>
<p>Odlučio sam se ovo ipak objaviti iz slijedećih razloga:</p>
<ul>
<li>Radi se o državnoj instituciji, ne o privatnoj firmi. </li>
<li>Te državne institucije rukuju javnim dobrima. Ta javna dobra su moja koliko i njihova. Tim slijedom, njihovi poslovi su i na&scaron; poslovi. </li>
<li>Njihova (ne)sposobnost, ignorancija ili bahatost tiče se svakog građanina ove zemlje. </li>
<li>Sve dok ovakve pojave i odnose budemo "gutali" nemamo &scaron;ansu da se izvućemo iz&nbsp; gliba u kome se nalazimo</li>
</ul>
<p>S obzirom na iznesene sumnje, ako neko ima koju pametnu na ovo reći, to bih doista cijenio.</p>
<p>Ovo &scaron;to radim je za moju firmu kontraproduktivno. Bez ikakve dileme, lo&scaron; poslovni potez. Da sam sao "progutao" sitne zahtjeve direktorice, budale&scaron;tine &scaron;efa, sve bi bilo super - moja firma bi imala +1 solidan godi&scaron;nji ugovor.&nbsp; Posao je uni&scaron;tila prgavost.</p>
<p>Kada u kancelariji razgovaramo o ovakvim događajima, Jasko i Sa&scaron;a uglas kažu:</p>
<blockquote class="posterous_short_quote">
<p>Jarane, ovo je sve "Monty Python" ...</p>
</blockquote>
<p>Pa ljudi moji, dokle vi&scaron;e da prihvatamo da život u Bosni mora biti reality show po uzoru na <a href="http://www.youtube.com/watch?v=zP0sqRMzkwo">"Monty python"</a> ?! Moj smisao za humor je presahn'o.</p>
<p><em><strong><span style="color: #ff0000;">(Update 05.03.2010: <a href="./e-jesam-se-provalio">E jesam se "provalio" ..</a>)</span></strong></em></p>
<p>---</p>
<p>(*) Mi kažemo "ljudi imaju Ugovor" samo za korisnike koji imaju broznane, srebrene i zlatne ugovore.</p>
<p>(**) jer imaju matrični printer za &scaron;tampanje virmana</p>
<p>(***)&nbsp; na&scaron;i serviseri</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, business, dunjaluk</div>
</div>
<div class='post_responses'>
<h4>Pregleda 9343, komentara: 3</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Feb  4 2011,  4:38 AM</div>
<div class='response_name'>fit responded:</div>
</div>
<div class='response_body'>@op, prije svega hvala na komentaru.<br />Moram reći da sam se pribojavao da oni koji pogledaju video ne prokomentarišu: "koga je briga šta radiš na svom desktopu ?!"<p>a što se tiče ubuntu-a: on je dovoljno linux i dovoljno "šminka" za prosječnog korisnika :)</p><p>Može i ovakav odgovor: bolje i ubuntu nego windoze, zar ne :) ?</p><p>Neki ozbiljniji odgovor, drugom prilikom. "Stay tuned", što bi naš narod rek'o.</p><p>>> tuned</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Feb  4 2011,  5:36 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>@fit - ok, nastojaću što prije ovu temu staviti na papir</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Mar  7 2011,  3:19 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>@fit, napokon sam svoje obećanje ispunio <a href="http://hernad.bring.out.ba/zasto-ubuntu-linux" rel="nofollow">http://hernad.bring.out.ba/zasto-ubuntu-linux</a></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
