<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/02/engleski-ii-2-parcijalni.html">Previous</a>
&nbsp; 
<a href="../../../index-10.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/02/server-operativni-sistemi-finalni-ispit.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Statistika i vjerovatnoća, drugi parcijalni</h3>
<div class='post_info'>
<span class='post_time'>February  5 2011,  7:50 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Na polaganje ovog ispita sam najvi&scaron;e ponosan.</p>
<p>Kada prelistao knjigu, dio koji se odnosi na drugi parcijalni, ostao sam u nevjerici. Hajd' &scaron;to sam ostao u nevjerici ja, al' &scaron;to i <a href="/tito-i-statistika">Dženana</a> ?!</p>
<p>Dženana mi je uočio <a href="/server-operativni-sistemi-finalni-ispit">predhodnog ispita</a> rekla:</p>
<blockquote class="posterous_short_quote">
<p>Ti ovo Ernade ne može&scaron; spremiti za jedan dan. Hem' je obimno, hem' je nejasno.</p>
</blockquote>
<p>Na to sam od&scaron;utio. Vidio sam i ja da pojma nemam o tome &scaron;ta se tamo priča, ali opet ... &scaron;teta bi bilo ne probati. Polaganje <a href="/server-operativni-sistemi-finalni-ispit">"SOS"-a</a> mi je "podiglo krila", pa sam Dženani rekao:</p>
<blockquote class="posterous_short_quote">
<p>Hajmo ić' na skraćenu verziju. Gledaćemo samo zadatke. De&scaron;ifruj mi o čemu se radi, pa će mi valjda ne&scaron;to i ostati u glavi.&nbsp;</p>
</blockquote>
<p><!--more-->Dedu i nenu smo zadužili da čuvaju djecu, a nas dvoje u karantin.</p>
<p>Ja sam "kopao" po bilje&scaron;kama drugih studenata. Neka Jasna imala je najbolju kolekciju zadataka:</p>
<blockquote class="posterous_short_quote">
<p>Jasna, hvala ti živa bila - đ'e čula i đ'e ne čula !</p>
</blockquote>
<p>Tu se nalazilo mno&scaron;tvo primjera ispitnih zadataka, i &scaron;to je najbitnije dosta komentara kako se stvari rade. Od Fernale sam opet na&scaron;ao dobre materijale - pitanja i odgovore iz teorije.</p>
<p>Dženana je iz tih rije&scaron;enih zadataka "hvatala" &scaron;ta se to od nas traži. Do&scaron;lo je podne, međutim nismo previ&scaron;e odmakli.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Vjerovatnoća</strong></span></p>
<p>Jedino &scaron;to smo skontali je bio zadatak iz vjerovatnoće. Dženana mi je dala neku knjigu "Vjerovatnoća za neznalice"(*) nekog starog zagrebačkog autora. Tekst je bio odičan. Jasan i interesantan. Pohvatao sam osnovne pojmove, ali &scaron;to je najbitnije i postupak za dobijanje formula iz vjerovatnoće.</p>
<p>Objasnila mi je rije&scaron;eni zadatak iz vjerovatnoće:</p>
<blockquote class="posterous_short_quote">
<p>Dobro, evo ovo kontam !</p>
</blockquote>
<p>konstatovao sam pobjednički. Ovo su dva primjera koja smo pro&scaron;li:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>vjerovatnoca.ods</strong>
<a href="../../../file/2011/02/5119369-vjerovatnoca.ods">View this file</a>
</div>
</div>
<div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>vjerovatnoca_sa_masom.ods</strong>
<a href="../../../file/2011/02/5119373-vjerovatnoca_sa_masom.ods">View this file</a>
</div>
</div>
 Dženana nije dijelila moj entuzijazam. Znala je da daleko odmakli ...</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Regresija</strong></span></p>
<p>E ovdje smo najvi&scaron;e vremena izgubili.</p>
<p>Čim je pogledala zadatak, rekla: "Ovaj H nam je vi&scaron;ak ... Vidi&scaron; kako su H i t skupovi slični ...".</p>
<blockquote class="posterous_short_quote">
<p>Ma ne vidim ja ni&scaron;ta ženo draga ...</p>
</blockquote>
<p>ali sam se suzdržao od komentara. Bolje da &scaron;utim, da je ne "ubijam u pojam".</p>
<blockquote class="posterous_short_quote">
<p>Ali to trebamo utvrditi T-testom ...</p>
</blockquote>
<p>vi&scaron;e za sebe je nastavila Dženana.</p>
<blockquote class="posterous_short_quote">
<p>Majko moja, ni riječi je ne razumijem ...</p>
</blockquote>
<p>nastavio sam komentarisati u sebi.</p>
<p>Dženana je prvo počela raditi na svoj način, ali je brzo shvatila da se to kod nas radi drugačije.</p>
<p>Počela je slu&scaron;ati FIT video materijale. Jednom, dva puta, tri puta, četiri puta, pet puta ?!</p>
<blockquote class="posterous_short_quote">
<p>Ajoj, ona mora 5 puta ponavljati jedan video materijal(*) da skonta &scaron;ta ovaj čovjek hoće ... Pa koliko bi meni trebalo onda ?!</p>
</blockquote>
<p>U jednom rije&scaron;enom zadatku(***) napokon smo na&scaron;li komentare kako se na FIT-u rade ovaj tip zadataka.</p>
<p>Kada je za sebe skontala &scaron;ta sve treba uraditi, počela je sa obja&scaron;njavanjem:</p>
<blockquote class="posterous_short_quote">
<p>Uvrsti ovu LINEST formulu. Uradi kako ti kaže da dobije&scaron; matricu. Ta matrica ti generi&scaron;e elemente za T-test. Na osnovu toga ćemo utvrditi valjanost parametara ..</p>
</blockquote>
<blockquote class="posterous_short_quote">
<p>&Scaron;ta ona priča !? Kakvi sad parametri ?</p>
</blockquote>
<p>Nastavila je:</p>
<blockquote class="posterous_medium_quote">
<p>a je parametar, b1, b2&nbsp; su parametri. Mi tražimo koji od skupova prediktora - nezavisnih varijabli uop&scaron;te može ući u ovu jednačinu sa zadanom vjerovatnoćom.</p>
<p>Regresijska jednačina je linearna jednačina:</p>
<p>Y = a + b1 * x1 + b2 * x2 + ... bi * xi</p>
<p>Na osnovu x predviđa&scaron; Y ...</p>
</blockquote>
<p>Aha ... ima smisla ... pa dobro, to i nije neki bauk.&nbsp; Kockice su mi se počele slagati.&nbsp; Zapisivao sam Dženanina obja&scaron;njenja da kol'ko-tol'ko stvari povežem na razumnom nivou.</p>
<p>Na kraju smo do&scaron;li do "džona" za ovaj tip zadataka:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>regresija.ods</strong>
<a href="../../../file/2011/02/5119274-regresija.ods">View this file</a>
</div>
</div>
</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Trend</strong></span></span></p>
<p>Dženana je poku&scaron;ala uraditi i zadatak sa trendom. Ali ne ide. Ne poznaje Excel, a ne možemo naći ni "džon" kako se taj trend radi.</p>
<p>Već umorna od de&scaron;ifovanja FIT statistike, kaže mi: "Dosta ti - ako ti dođe ovaj zadatak ti ga preskoči"</p>
<p>"Uh, malo će mi ovo biti za prolaz", pomislio sam.&nbsp; Al' ostavio sam to po strani. Uzeo sam čitati teoriju.</p>
<p>Tamo negdje iza 11 uveče, Dženana je kod Jasne na&scaron;la obja&scaron;njenje kako se u Excelu rade grafikoni:</p>
<blockquote class="posterous_medium_quote">
<p>Napravi&scaron; ovaj slot X-Y tip grafikona. I onda klikni na jednu tačku pa idi na "Add trend line" i tu sada može&scaron; birati vi&scaron;e trend funkcija - polinomsku, eksponencijalnu, linearnu ..</p>
</blockquote>
<p>"Pa dobro, a &scaron;ta je trend ?" pitao sam.</p>
<blockquote class="posterous_medium_quote">
<p>Trend dobija&scaron; na osnovu regresijske analize. Ova funkcija u Excelu ti radi ono &scaron;to smo u zadacu za regresiju utvrđivali - traži&scaron; najbolju jednačinu kojom će&scaron; od prediktora sa određenim stepenom pouzdanosti utvrditi vrijednost kriterija - zavisne varijable. Svaka od jednačina ti nudi R^2 parametar. &Scaron;to ti je veći taj R^2 to jednačina vi&scaron;e odgovara - preciznije utvrđuje zavisnost Y(x)&nbsp; &nbsp;</p>
</blockquote>
<p>Nastavila je:</p>
<blockquote class="posterous_short_quote">
<p>Naravno, sve to je pojednostavljeno ...</p>
</blockquote>
<p>Prekinuo sam je:</p>
<blockquote class="posterous_short_quote">
<p>Ama pusti ba &scaron;to je to pojednostavljeno ... daj samo da skontam u toj mjeri da ne&scaron;to smisleno napi&scaron;em.</p>
</blockquote>
<p>"U pravu si", Dženana je prekinula daljnja obja&scaron;njenja.</p>
<p>Ja sam bio zadovoljan učinjenim:</p>
<blockquote class="posterous_short_quote">
<p>Sada barem imam neku &scaron;ansu. Ne idem čisto turistički na ispit ...</p>
</blockquote>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;">Teorija</span></span></strong></p>
<p>Ostatak večeri sam pre&scaron;ao po teoretskim pitanjima koja sam imao. Od Dženane sam tražio poja&scaron;njenja za ono &scaron;to mi je bilo totalno nepoznato.</p>
<ul>
</ul>
<p>Uh ... sve mi se k'o ka&scaron;a smije&scaron;alo.&nbsp;</p>
<blockquote class="posterous_short_quote">
<p>Dragi Allahu, samo si ti kadra učiniti da ovo položim ...</p>
</blockquote>
<p>Ujutro prije polaska sam dodatno Dženanu maltertirao sa teorijom. Na kraju su ostale ove bilje&scaron;ke:</p>
<ul>
<li><a href="https://gist.github.com/811274">teroija prvi dio </a></li>
<li><a href="https://gist.github.com/811276">drugi dio </a></li>
<li><a href="https://gist.github.com/811279">treći dio </a></li>
</ul>
<p>Nisam siguran da će drugima biti od velike pomoći, jer su poja&scaron;njenja bazirana na "Dženaninoj" a ne na "Pra&scaron;inoj" terminologiji.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Vozačko učenje</strong></span></p>
<p>Emir i ja smo jedini i&scaron;li na ispit. U&scaron;ao je u auto sa riječima:</p>
<blockquote class="posterous_short_quote">
<p>Ne znam ... ovo ni&scaron;ta ne kontam ... Nisam siguran da mi je pametno tro&scaron;iti vrijeme na ovaj ispit ... Al' hajd' sad ...</p>
</blockquote>
<p>Počeli smo prebirati po teoriji. Uzeli smo materijale&nbsp; sa komentarima koja sam pokupio od Dženane. Nismo uspjeli zavr&scaron;iti. Emir je rekao:</p>
<blockquote class="posterous_short_quote">
<p>Meni se sve smutilo. Ja vi&scaron;e ne mogu ...</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Pred ispit</strong></span></p>
<p>U autu mi je Emir rekao da nije mogao regresiju skontati kako da uradi onu legendarnu LINESTO ... Obećao sam mu pred ispit pokazati kako da to uradi.</p>
<p>Asistentica Nina nas je susrela u holu dok sam Emiru pokazivao regresiju.</p>
<blockquote class="posterous_short_quote">
<p>Vi ste onaj "ljuti" student ?</p>
</blockquote>
<p>"Jesam", odgovorio sam. "Ako budete htjeli odgovarati za bolju ocjenu, javite se kolega ...", rekla je dobronamjernim tonom. Nisam znao da li se sjetila mog negodovanja kod <a href="/statistika-1-parcijalni-ispit">prvog parcijalnog</a>, ili čitala moj blog. &Scaron;ta god bilo od to dvoje, bilo mi je jasno da misli na mene&nbsp; :).&nbsp;</p>
<blockquote class="posterous_short_quote">
<p>Kakva crna veća ocjena. Da mi je ovo nekako "svaliti s leđa" ... !?</p>
</blockquote>
<p>pomislio sam. Radi njenog tona komentar sam ostavio za sebe. Kako god bio "ljut", nisam sklon generalizacijama. Njen raniji postupak me je "ispalio". To međutim kod mene nije stvorilo generalni stav: "Nina je negativac".&nbsp;&nbsp;&nbsp; &nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ispit</strong></span></p>
<p>Ispit sam dočekao potpuno smiren.</p>
<blockquote class="posterous_medium_quote">
<p>Dao sam sve od sebe, ma i vi&scaron;e od toga ... Sad &scaron;ta dragi Allah dadne, biće ...</p>
<p>Pregledam pitanja: vjerovatnoća, regresija - skoro identično onome &scaron;to sam vježbao ... Čak i većinu teoretskih pitanja kontam ...</p>
<p>Pa ovo bi moglo jo&scaron; biti prolaz !</p>
</blockquote>
<p>Zadnje pitanje je bilo ne&scaron;to sa alfa_1, alfa_2 ... e takav zadatak ni pogledao nisam. Iz postavljenog pitanja uop&scaron;te nisam znao &scaron;ta se traži. Uočio sam da je zadtak jednostavan, ako ne i najlak&scaron;i - ali džaba - ne znam &scaron;ta se uop&scaron;te traži od mene.</p>
<p>Na teoriji sam se dosta zadržao. To je eliminacioni dio. "Kitio sa"&nbsp; sve &scaron;to sam se sjetio i &scaron;to mi je Dženana govorila. Koristio sam terminologiju koju sam od nje čuo jer mi je ona nekako bila logična. Ta terminologija se dosta razlikuje od FIT materijala ... Ali na pro&scaron;lom parcijalnom mi je taj način odgovaranja priznat pa sam nastavio po Dženaninom &scaron;lifu odgovarati.</p>
<p>Profesor nekakav mrgudan, bezvoljan, negativan. Pitali smo ga:</p>
<blockquote class="posterous_short_quote">
<p>Profesore, hoće li biti mogućnost popravnog za drugi parcijalni ?</p>
</blockquote>
<p>"Nema vi&scaron;e parcijalnog, imali ste &scaron;ansi koliko hoćete ...",&nbsp; skinuo nas je sa dnevnog reda. &Scaron;ta je time htio reći pojma nemam.</p>
<p><a href="/uciteljica-nina">Asistentica Nina</a> je tokom ispita prilazila studentima. Susretljiva žena. Hoće pomoći. Tako se i kod mene malo zadržala ... Čitala je &scaron;ta pi&scaron;em. Zastao sam na excel formuli za binomnu distribuciju. Ona mi je sugerisala:</p>
<blockquote class="posterous_short_quote">
<p>Imate kolega u Excel-u help - samo objasnite parametre i prokomentari&scaron;ite rezultat ...</p>
</blockquote>
<p>Ja sam uzeo malo drugačiju strategiju: Uvrstiti set nekih parametara, sa njima se&nbsp; "poigrati" i to prokomentarisati. Nakon niza poku&scaron;aja, na kraju sam do&scaron;ao do željenog - skontao sam kako funkcija radi - dao par vr&scaron;nih parametara kada vjerovatnoća ide ka 0 i ka 1 ... Međutim, ovaj sistem mi je uzeo dosta vremena. Ja sam "rob primjera". Od toga ni na ispitu nisam mogao pobjeći ...</p>
<p>Kod vjerovatnoće sam se takođe gubio:</p>
<blockquote class="posterous_short_quote">
<p>Joj ... majko moja ... ako ovo ne budem znao kako ću Dženani pred oči&nbsp; ...</p>
</blockquote>
<p>Rezultati su mi pokazivali da ne&scaron;to grije&scaron;im. Na kraju sam skontao da sam jedan parametar u formuli binomne distribucije pogre&scaron;no memorisao. Sva sreća pa sam taj dio ponajbolje razumio, tako da sam logički do&scaron;ao do rje&scaron;enja. Idemo dalje ...</p>
<p>Regresiju sam uradio bez "&scaron;tekanja".&nbsp; Tu je bilo jo&scaron; pitanje u kome se trebao iskoristit trend. Traženi dijagram nisam nikada pravio pa sam se tu zadržao ... Slabo baratam sa Excelom generalno pa mi je trebalo vremena da se orjenti&scaron;em. Na kraju sam dobio željenu ovisnost Y od X.</p>
<p>Na dobijeni grafikon sam brzo uradio trend analizu i dao tražene komentare.&nbsp;</p>
<p>Do&scaron;ao sam do zadnjeg pitanja - ne uop&scaron;te kontam &scaron;ta se traži. Ovakav tip zadataka očigledno postoji, ali ja do te lekcije nisam do&scaron;ao :). Pitanje je bilo oskudno formulisano, tako da na osnovu njega nisam mogao ni&scaron;ta napamet "mudrijati".</p>
<p>Pogledao sam u monitor kolege za susjednim računarom. Ba&scaron; je radio taj zadatak. Vidim njegov grafikon, al' džabe - ne kontam &scaron;ta se traži.</p>
<p>Asistent mi prilazi i kaže:</p>
<blockquote class="posterous_short_quote">
<p>Kakav je kolegin grafikon ?</p>
</blockquote>
<p>"Pojma nemam. Džabe mi &scaron;to gledam, kad ne kontam", odgovorio sam. Naravno, njegov komentar je bio signal za "ne prepisuj". Okrenuo sam se svom monitoru. Ma u pravu je čovjek. &Scaron;ta uop&scaron;te "zvrljam" u tuđi rad ko neki balavac&nbsp; ... &Scaron;to sam znao, uradio sam. Elhamdulillah.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Rezultati</strong></span></p>
<p>Nakon ispita iz PR2, Emir mi je javio:</p>
<blockquote class="posterous_short_quote">
<p>Mu&scaron;tuluk, položili smo obojica !</p>
</blockquote>
<p>Uh jest' mi drago bilo ... Oti&scaron;ao sam da pogledam rezultate:</p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2011/02/21074253-statistika_rezultati_b.png'>
</div>
Čovječe, pa ja sam ovo "rasturio" ! Z1 - teoriju uradio sa jo&scaron; jednim čovjekom najbolje, Z3 - regresiju najbolje !</p>
<p>Kad se sabere sa prvim parcijalnim i dodatnim bodovima za polaganje preko parcijalnih ... ispade 7 k'o kuća :)</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Sistem ocjenjivanja</span></strong></span></p>
<p>Mora se uočiti da su nastavnici bili kod ocjenjivanja maksimalno susretljivi(****). Na osnovu onoga &scaron;to mi je Emir rekao da je uradio, uočio sam da je ocjenjivanje je "debelo" i&scaron;lo u korist studenata. I to stvarno treba cijeniti. Pretpostavljam da je tom blagonaklonom kriteriju ocjenjivanja doprinijela i činjenica &scaron;to se radi o drugom parcijalnom. Zato svakome preporučujem da ovaj ispit poku&scaron;a preko parcijale položiti. Nastavnici - barem ova "postava" to cijeni.</p>
<p>Po spisku se vidi da su svi koji su iza&scaron;li na parcijalu i uradili teoretski dio položili.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Statistika je bauk</strong></span></p>
<p>O <a href="/koncept-predmeta-statistika-i-vjerovatnoca-na">konceptu ovog predmeta</a> sam već pisao nakon prvog parcijalnog. Većina konstatacija iz prvog dijela ostaje. Nakon &scaron;to sam pro&scaron;ao drugi parcijalni, na osnovu Dženaninih komentara, mogu zaključiti da je ovaj predmet skroz pogre&scaron;no dimenzioniran:</p>
<blockquote class="posterous_short_quote">
<p>Moji studenti ovo rade dvije godine &scaron;to ste vi smjestili u jedan semestar ...</p>
</blockquote>
<p>rekla je Dženana. Miks tog preambicioznog gradiva, konfuzne knjige čini ovaj predmet baukom. Da bi se nekako "iskobeljali" iz tog bućkuri&scaron;a, studenti uče zadatke ko pjesmicu. Vjerovatno je kod redovnih studenata stanje bolje - oni najvjerovatnije sa asistenticom ispitne zadatke mogli prevježbati. DL studenti sa postojećim nastavnim materijalima ovaj predmet ne mogu skontati.</p>
<p>Umjesto da ih se nauči <a href="/hello-world">"Hello world"</a> statistike i vjerovatnoće, gradivo je obrađeno tako da oni nakon svega pojma nemaju.</p>
<p>Ja volim sve &scaron;to se tiče matematike. Uz Dženaninu pomoć, čak i u bunilu spremanja ispita, svidjelo mi se ono &scaron;to sam iza "Pra&scaron;inih oblaka" vidio. Siguran sam da je super poznavati osnovne principe statistike i vjerovatnoće. Međutim, takođe sam siguran da se to na ovaj način ne radi.</p>
<p>Da priča ne bude samo crno, nave&scaron;ću i ovo Dženanino opažanje:</p>
<blockquote class="posterous_medium_quote">
<p>Ovaj čovjek je stvarno do u sitne detaljen naveo ove Excel formule. Ima tu stvarno masa statističkih funkcija. Treba&scaron; mi dati ovu knjigu da izvučem stvari koje bi i moji studenti mogli iskoristiti. Nikad ga nisam koristila u ove svrhe, pa nisam ni znala da se sa Excel-om mogu efikasno uraditi jednostavnije analize - posebno ova regresija i trend.</p>
</blockquote>
<p>Očigledno da kori&scaron;tenje Excel-a(*****) na početnom kursu Statistike i Vjerovatnoće ima smisla, ali u jednoj "doziranoj" i drugačije predočenoj formi.</p>
<p>Iz sopstvenog iskustva, i iz razgovara sa drugim studentima, uočio sam da je Statistika "bauk" predmet&nbsp; - predmet koji studenti masovno prenose.</p>
<p>To nema nikakvog smisla. Ovaj predmet mora biti za stepen lak&scaron;i od temeljnih predmeta kakvi su "Baze podataka" i "Programiranje". U grupu "najjačih" predmeta prije trebaju ići "Operativni sistemi" i "Računarske mreže". "Statistika" definitivno ne !</p>
<p>Meni je nevjerovatno da ovakve stvari upravi fakulteta ne smetaju. Pu&scaron;taju da <a href="/server-operativni-sistemi-finalni-ispit">"Operativni sistemi"</a> budu lakrdija, a "Statistika" neki "haman-zaman" predmet ?!</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Kakav je ovo "ods" format dokumenata !?<br /></span></strong></span></p>
<p>Svi publikovani dokumenti su u <a href="http://en.wikipedia.org/wiki/OpenDocument">open document formatu</a>. ODS = open document spreadsheet. Instalirajte <a href="http://www.openoffice.org">openoffice &gt;= 3.2.x </a> ili <a href="http://www.libreoffice.org">libreoffice</a> za rad sa ovim dokumentima. Razlozi zbog kojih dokumente publikujem isključivo u ovom formatu su sljedeći:</p>
<ul>
<li>ODF je otvoreni industrijski standard</li>
<li>Ustanove kao &scaron;to je FIT trebale bi se držati ovih standarda</li>
<li>Na mom radnom računaru nema MS Excel-a</li>
</ul>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;">P.S.</span></span></strong></p>
<p>Dženana, živa i zdrava ti meni bila. Bez tvoje pomoći, pojma nemam kako bi ovaj ispit spremio.</p>
<p>---</p>
<p>(*) Ne&scaron;to u ovom folu, ne sjećam se pravog naslova</p>
<p>(**) LINEST funkcija</p>
<p>(***) mislim da je to iz Jasninog "budželara" opet</p>
<p>(****) Ocjenjivanje, tako drugi studenti kažu, vr&scaron;i asistentica Nina</p>
<p>(*****) Tačnije spreadsheet-anje jer većina tih funkcija radi i sa openoffice-om</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, ispit</div>
</div>
<div class='post_responses'>
<h4>19037 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
