<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/03/uvod-u-baze-podataka-seminarski-rad-pos-aplik-0.html">Previous</a>
&nbsp; 
<a href="../../../index-9.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/03/ima-fiskalizacije-al-nema-racuna.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>E jesam se "provalio" ...</h3>
<div class='post_info'>
<span class='post_time'>March  5 2011,  9:48 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>U članku <a href="/bosna-monty-python-reality-show">"Bosna - 'Monty Python' reality show"</a> sam se dobrano "provalio".</p>
<p>U poglavlju "Općinski &scaron;efovi i direktori", a vezano za (ne)potpisivanje ugovora ispostavilo se na kraju da sam pogre&scaron;no rezonovao.</p>
<p>Naime, sutradan sam kontaktiran od Općine po ovom pitanju. Ispostavilo se da je glavni razlog njihovog nepotpisivanja ipak bio osnovan.</p>
<p><!--more-->Kolegica je u svom izvje&scaron;taju napisala:</p>
<ul>
<li>... i rekla je da u ugovoru nedostaje član 31."&nbsp; </li>
</ul>
<p>Ali nije navela da od nje u stvari traženo slijedeće:</p>
<ul>
<li>član 31 ispraviti da bude član 32(*)</li>
<li>član 31 treba da glasi: Predhodni ugovor stavlja se van snage.</li>
</ul>
<p>Kada sam to čuo, shvatio sam da sam pogrije&scaron;io:</p>
<blockquote class="posterous_short_quote">
<p>Uh jesi, "brizgonja". Kako si olahko pre&scaron;ao preko nelogičosti da nedostaje član 31.(**) ?!&nbsp;</p>
</blockquote>
<p>Priča se na kraju zavr&scaron;ila time &scaron;to su oni u Općini prekucali na&scaron; ugovor sa ovim članom i poslali nam ga na potpis. Ugovor je potpisan.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Dilema </strong></span></p>
<p>S obzirom da je na&scaron;a strana, a ne Općina ispala "Monty Python" strana, te da sam ih nepravedno optužio za "demonstraciju sile", ostao sam u dilemi:</p>
<blockquote class="posterous_short_quote">
<p>Da li da bri&scaron;em ovaj članak ?</p>
</blockquote>
<p>Odustao sam od toga. Jesam prenaglio. Jesam se "provalio". Jesam se ogrije&scaron;io po tom pitanju. Ali ću to sada napisati. Kada bih svaki <a href="/100-ti-blog-post">bug u pisanju</a> rje&scaron;avao brisanjem, onda bi to bilo selektivno pisanje.Kada ljudi pogrije&scaron;e, trebaju reći:</p>
<blockquote class="posterous_short_quote">
<p>Jesam, pogrije&scaron;io sam. Izvinjavam se.</p>
</blockquote>
<p>Zato ću ja reći:</p>
<blockquote class="posterous_short_quote">
<p>Pogrije&scaron;io sam, zahtjev Općine za dopunom ugovora je bio osnovan.</p>
</blockquote>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Za&scaron;to sam pogrije&scaron;io ? </span></strong></span></p>
<p>Pogrije&scaron;io sam iz dva razloga:</p>
<ol>
<li>Jer sam brzopleto rezonovao, i preko nelogičnosti u izvje&scaron;taju mog saradnika sam olakho pre&scaron;ao</li>
<li>Jer nisam dobio tačnu - potpunu informaciju</li>
</ol>
<p>Ja nisam kriv ? Kriva je moja saradnica ?! E toga nema. U ovakvim situacijama, krivac je uvijek jedan - onaj koji donosi odluke !</p>
<p>U kasnijoj internoj raspravi moje kolege su komentarisale:</p>
<blockquote class="posterous_medium_quote">
<p>Ernade, oni (op.aut. općinski službenici) sa tobom pričaju na jedan način (fino, uljudno), a sa nama na sasvim drugi način. Vjeruj da su Željku "otresli", ba&scaron; kako je to i napisala !</p>
</blockquote>
<p>Na to sam im uzvratio:</p>
<blockquote class="posterous_medium_quote">
<p>Nisam ni pomislio da je Željka izmi&scaron;ljala ili preuveličala stvari po pitanju tona i načina komunikacije. Na stranu ton, koji naravno ne opravdavam. U ovoj priči je ipak&nbsp; najbitniji sadržaj. A kada sam do&scaron;ao do potpunog sadržaja, ispostavilo se da je njihov zahtjev opravdan. To nam se ne smije de&scaron;avati. Ne smije ton biti taj koji će izobličiti sadržaj.</p>
</blockquote>
<p>&Scaron;to se tiče ostalih konstatacijja u samom članku, one stoje. "Monty Python"-ovci su po meni i dalje adresirani.</p>
<p>Istina, izvjesno je da nikada ne bih takav članak objavio(***), ali sada je gotovo. Stvar je objavljena. Treba se znati i "zacrveniti". Ja to upravo sada činim.</p>
<p>---</p>
<p>(*) zato &scaron;to je klauzula o nadležnom sudu uvijek zadnja)</p>
<p>(**) Ja sam pogledao ugovor koji im je dostavljen, vidio da taj član postoji ... bilo mi je to čudno ali se nisam previ&scaron;e udubljivao. Ostale informacije su me "izbacile iz cipela" pa sam preko toga pre&scaron;ao. Moja gre&scaron;ka.</p>
<p>(**) Iz razloga diskrecije - vidi poglavlje "Indiskrecija" ranijeg članka</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, business, sistem</div>
</div>
<div class='post_responses'>
<h4>Pregleda 9236, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
