<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/03/drzavo-pomagaj.html">Previous</a>
&nbsp; 
<a href="../../../index-9.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/03/reporting-priprema-prvog-parcijalnog-hernad-i.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>"Reporting", prvi parcijalni ispit</h3>
<div class='post_info'>
<span class='post_time'>March 21 2011,  2:01 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>U Mostar smo i&scaron;li Emir, Nedim i ja. Berin je odustao jer mu jo&scaron; nije upisana ocjena iz OEK-a, koji je preduslov za polaganje ovog ispita.</p>
<p>Tokom <a href="/racunarske-mreze-priprema-za-ispit">vožnje</a> smo pre&scaron;li teoriju. Tamo pred kraj nam je svim "dotužilo" ... Do&scaron;li smo do onih <a href="https://gist.github.com/874861#L120">input/output</a> koeficijenata ... Nedim je prokomentarisao:</p>
<blockquote class="posterous_short_quote">
<p>Ovo se ne uči na pamet. Ako se i pojavi, ti će se koeficijenti valjda u postavci zadatka navesti.</p>
</blockquote>
<p>Ja sam u startu bio sumnjičav. Ako je to navedeno na studentskim skriptama, sigurno ima razloga:</p>
<blockquote class="posterous_short_quote">
<p>Ma ne znam, Pra&scaron;o zna ovakve stvari tražiti ... "Pjesmica" sistem pitanja njemu nije strana.</p>
</blockquote>
<p>Na kraju smo te koeficijente pro&scaron;li par puta ... Traživ&scaron;i način kako da te pojmove zapamtim, rekao sam kolegama:</p>
<blockquote class="posterous_short_quote">
<p>Ljudi zapamtite, gdje god vam je "M" dole (nazivnik), vi recite "Normativ" ... Nakon toga ćemo se već snaći pa nekako "skrpititi" rečenicu do kraja ...</p>
</blockquote>
<p><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>Pred ispit</strong></span></p>
<p>Mi smo bili druga grupa. Kada je prva grupa iza&scaron;la ... jedan kolega(*) nam je rekao &scaron;ta je njima bilo na ispitu.</p>
<p>Pod prvim pitanjem&nbsp; <a href="https://gist.github.com/874861#L133">"normativ ljudskog rada"</a> ... ajoj fakat traži ove budale&scaron;tine ...</p>
<p>Nisam mogao a da glasno ne prokomentari&scaron;em moju asocijaciju na <a href="/uos-knjiga-1-procitana">"Rain man"</a> i učenje ovakvih stvari ... ba&scaron; u tom trenu je pro&scaron;ao profesor ...&nbsp;</p>
<p>Uzeo sam da skripte i probao netom pred ispit&nbsp; te K/P, M/L, L/M, ... "Flja/Flju" stvari memorisati ... ali ni&scaron;ta. Joj kako sam <a href="/genijalac">glup</a> za ovakve stvari.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ispit</strong></span></p>
<p>Trajanje ispita 1 sahat.</p>
<p><strong><span style="text-decoration: underline;">Zadatak 1</span></strong></p>
<p>a) Navedi bar tri moguća razloga za <a href="https://gist.github.com/873237#L195">gubitak pravne sposobnosti</a></p>
<p>to sam mislim dobro odgovorio</p>
<p>b) <a href="https://gist.github.com/874861#L168">Učinak ma&scaron;ine</a>, navedi forumu i reci kako se izražava</p>
<p>Ahh... počeo sam pisati sve &scaron;to sam se mogao sjetiti ... je li ovdje firguri&scaron;e P ili M ?!</p>
<p>Pa sam počeo pisati koeficijente kojih se sjećam ... Ali blokada ... glup čovjek pa eto ti .</p>
<p>Kako sam tu izgubio puno vremena, a praktično ni&scaron;ta nisam uradio ... počela me je hvatati nervoza.</p>
<p>Na kraju mi sam do&scaron;ao do toga da mi je K i M u igri ... i slupao "K/M". Ajoj ajoj ajoj. Pa vazio sam gore drugima da kad je dole "M" to je normativ.</p>
<p>Uh, sam bih sebe "rokn'o" ...</p>
<p><span style="text-decoration: underline;"><strong>Zadatak 2</strong></span></p>
<p>Ne sjećam se tačne formulacije: Ne&scaron;to kao koji su preduslovi za formiranje dioničkog dru&scaron;tva:</p>
<p>Ja sam odgovorio manje-vi&scaron;e kao na pitanju <a>"9.b" iz skripte</a></p>
<p>Nisam se sjetio doslovno, ali sam pomenuo da je potreban:</p>
<ul>
<li>Ugovor (vi&scaron;e osnivača) ili odluka (jedan osnivač)</li>
<li>Ugovor sa depozitnom bankom</li>
<li>Ugovor sa agencijom za registraciju vrijednostnih papira (ali se ne sjećam vi&scaron;e kako sam ja to sročio ...)</li>
</ul>
<p>Valjda će to biti prihvatljivo ... Jo&scaron; sam pominjao ostale stvari vezano za dionice, emisiju ...</p>
<p>Emir mi je nakon ispita rekao da je "kitio" o dioničkom dru&scaron;tvu sve &scaron;to zna ... Moguće da je njegova taktika bila bolja. Ali Emir nije glup ko ja. Njemu dva puta pročita&scaron; i on zapamti. Emir ima mlad mozak ... kod mene već moždane ćelije "čučnjavaju" ... :(</p>
<p><span style="text-decoration: underline;"><strong>Zadatak 3</strong></span></p>
<p>Sljedeći zadatak je bio taj da je napravljen bilans stanja (aktiva, pasiva) za 5 vremenskih perioda:</p>
<p>t1, t2, ... t5 po kolonama, i onda iznosi klasa 0,1,2,4,5 po redovima</p>
<p>Pitanje je bilo:</p>
<p>a) gdje se nalaze obrtna sredstva, a gdje imovina trećih lica u ovom bilansu.</p>
<p>b) Grafički prikazati omjer ovih veličina u procentima sa odgovarajućom pozicijom u bilansu.</p>
<p>Rad pod a)</p>
<p>Odmah sam zastao ...&nbsp; termin: "obrtna sredstva" ... hm taj izraz se koristi najče&scaron;će za&nbsp; aktivu bez osnovnih sredstava i dugoročnih potraživanja. Znači za sredstva koja se odmah mogu staviti u funkciju - iskoristiti.</p>
<p>Ali to je ipak termin koji nije nigdje u poslovnim knjigama precizno određen. Bio sam ubjeđen da u bilansu stanja ova pozicija NE postoji.</p>
<p>Zato sam se obratio asistentu. U stvari, on je vidio da ja pi&scaron;em komentar pa mi je pri&scaron;ao i rekao:</p>
<blockquote class="posterous_short_quote">
<p>Kolega, to se ne boduje ... nemojte bez potrebe tro&scaron;iti vrijeme ...</p>
</blockquote>
<p>Uzvratio sam:</p>
<blockquote class="posterous_short_quote">
<p>Meni ovaj termin nije jednoznačan ... znam za &scaron;ta se uobičajeno koristi, ali ne znam da li ste vi - odnosno profesor to tako definisali</p>
</blockquote>
<p>Asistent je bio susretljiv:</p>
<blockquote class="posterous_short_quote">
<p>Pa dobro, &scaron;ta ste vi naveli za obrtna sredstva ?</p>
</blockquote>
<p>Pokazao sam:</p>
<blockquote class="posterous_short_quote">
<p>1+2 - zalihe i gotovina</p>
</blockquote>
<p>Bez ustezanja mi je rekao:</p>
<blockquote class="posterous_short_quote">
<p>Eto, pogodili ste.</p>
</blockquote>
<p>Ne bih&nbsp; ja bio - ja, a da ne uzvratim:</p>
<blockquote class="posterous_medium_quote">
<p>Ma nisam ja pogodio ... Ali nisam siguran da terminolo&scaron;ki na istu stvar mislimo ... Konkretno, u standardnom - zvaničnom "Bilansu stanja" ovakva pozicija, koliko ja znam, ne postoji. Ali dobro ... Hvala vam na pomoći.</p>
</blockquote>
<p>Kod crtanja grafika su nastali problemi. &Scaron;ta god krenem da podesim na dijagramu ... ne&scaron;to mi "za&scaron;teka". Nisam znao "title" na grafikon dodati ?!</p>
<p>U tom "nabadanju" po excelu opet sam izgubio dosta vremena. Da sam kojim slučajem bio u svojoj kancelariji, nogom bih napuc'o i excel i računar ...</p>
<p>Kasnije će se ispostaviti da je ovaj moj excel fakat prolup'o. Ali ja to u tom trenutku nisam znao.</p>
<p>Ah da, da ne zaboravim reći da je imovina trećih lica (tuđe pare - obaveze dobavljača, kreditora) smje&scaron;tene u klasu 5 - obaveze.</p>
<p>Znači rje&scaron;enje je bilo u kratkim crtama ovo:</p>
<ul>
<li>0+1 = obrtna sredstva = O.S.</li>
<li>A = 0+1+2 = aktiva</li>
<li>5 = obaveze = X</li>
<li>P = 4+5 = pasiva</li>
<li>grafički prikazati O.S./A * 100 (%), X/P * 100 (%)</li>
</ul>
<p>Kako god bilo, trebalo bi da sam najbitnije elemente ovog zadatka  ipak rije&scaron;io kako treba ... Ali vi&scaron;e ni&scaron;ta sa sigurno&scaron;ću ne mogu reći.</p>
<p><span style="text-decoration: underline;"><strong>Zadatak 4</strong></span></p>
<p>Dat je tabelarni prikaz F - prihodi, T - tro&scaron;kovi, za određeni obim proizvodnje Q</p>
<p>Utvrditi gornji i donji prag rentabilnosti, aproksimativno (na osnovu grafika), te utvrditi matematičke formule T i F.</p>
<p>E ovaj zadatak mi je bio pravi peh. Svodio se na trend za koji sam ja na sav glas noć prije <a href="/reporting-priprema-prvog-parcijalnog-hernad-i">vikao kako sam guru</a> :(</p>
<p>Napravio sam grafikon bez problema, utvrdio trend linije polinomske 2 stepen za F i T ... na&scaron;ao presjeke (cca 7 i cca 98 i&scaron;čitavajući donji i gornji prag rentabilnosti sa dijagram) ... Sve je bilo super i "za sekundicu" ... Ali vidim da su mi članovi polinoma drugog stepena 0 ?!?</p>
<p>Odakle crne nule u jednačini ?! Asistentu sam se ponovo obratio. On je odmah reagovao:</p>
<blockquote class="posterous_medium_quote">
<p>Ah isti ovaj problem je imao jo&scaron; jedan kolega ... ne&scaron;to nije u redu sa Excelom ... Ali imam rje&scaron;enje. Izbri&scaron;ite ovo i napravite novi dijagram ali nemojte uzimati Q&nbsp; kod kreiranja ...</p>
</blockquote>
<p>I stvarno, nakon toga sam dobio "normalne" jednačine za F i Q, ali sam pobrkao X osu jer tu vi&scaron;e nije bio nanesen Q kako treba nego sekvencijalno tačke 1, 2, 3...</p>
<p>Vrijeme je isteklo. Poku&scaron;avao sam ovo dodati, ali je kompletna aplikacija prolupala - nakraju je Excel skroz čučno - onu legendarnu poruku o gre&scaron;ci "po&scaron;aljite Error report Microsoft-u" je jedino &scaron;to sam do kraja dobio :(</p>
<p>Tako sam na kraju taj zadatak morao predati "raskupsan". Na njemu istina stoje Q_min, Q_max ispravne jer sam ih i&scaron;čitao u prvoj verziji dijagrama, te jednačine koje sam dobio u drugoj verziji. U onoj frci mi je jedino ostalo x kao nezavisne varijable umjesto Q koji je trebalo figurisati jer je F(Q), T(Q) ... ali valjda se to neće uzeti za neurađeno ...</p>
<p>Nakon ispita mi je asistent rekao da će fakultet ovaj problem "refundirati" studentima. Nadam se da će refundacija biti u bodovima potrebnim da ovo položim, a ne recimo u "MS Excel" licenci. Takvo &scaron;to mi ipak ne treba. Jedino ako Microsoft nije izbacio MS Excel 2015 za Ubuntu/Linux.</p>
<p><span style="text-decoration: underline;"><strong>Zadatak 5</strong></span></p>
<p><a href="https://gist.github.com/874861#L326">Elastičnost</a> i marginalna vrijednost - navedi formule i objasni</p>
<p>Hm ... evo pi&scaron;em i neka mi konfuzija ... je li bilo pitanje Elastičnost ili Marginalna vrijednosti ?</p>
<p>Svakako mi je za elastičnost potrebno definisati marginalnu vrijednosti, ... ili sam Elastičnost naveo iz razloga da navedemda je za&nbsp; E(t,Q) = T'/t = 1 proizvodnja optimalna po pitanju tro&scaron;kova ?!</p>
<p>Sjećam se da je to bila moja zadnja rečenica ... ali se iskreno vi&scaron;e ne sjećam &scaron;ta je bilo originalno pitanje. Znam da sam prilikom zadatka objasnio:</p>
<ul>
<li>t=T/Q prosječni tro&scaron;kovi</li>
<li>T' = delta_T/_delta_Q</li>
<li>E(t,Q) = T' / t</li>
</ul>
<p>Trebalo bi da je to &scaron;to sam pisao traženi odgovor. Ali vi&scaron;e ni za &scaron;ta na ovom ispitu ne mogu tvrditi. Hem sam ja bio konfuzan ... hem' mi se taj prokleti excel "podrepio" (kud meni koji jedva nabadam sa tim "čudom").</p>
<p>Hah ... juče nije bio moj dan. Umjesto polaganje ovog ispita bude "zicer", na kraju ispade: možda padnem, ili na jedvite jade prođem ... &Scaron;teta.</p>
<p>Pravo bih volio da položim. Iako svi kažu da je ovaj dio daleko najlak&scaron;i, pravo mi je "muka" masu ovih budale&scaron;tina memorisati. Hem' &scaron;to je beskorisno, hem' &scaron;to to meni iznimno te&scaron;ko ide.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Terminologija</strong></span></p>
<p>U članku<a href="/reporting-u-praksi"> "Reporting u praksi"</a> sam postirao realne bilanse stanja i uspjeha.&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>Obrtna ili tekuća sredstva ?</strong></span></p>
<p>Vezano za termin "obrtna sredstva", u tim izvje&scaron;tajima, kako sam asistentu i rekao, ne postoji takva pozicija. Koristi se termin <strong>Tekuća sredstva</strong>.</p>
<p>Ako je potrebno da studenti uče ovakve termine, logično bi bilo da se koristi terminologija koja se javlja u zvaničnim poslovnim izvje&scaron;tajima. Ako se upotrebljavaju manje uvriježeni termini, potrebno je navesti sinonime.</p>
<p>Na&scaron;ao sam u narednim poglavljima profesorove knjige, str. 40 definiciju Obrtnih sredstava:</p>
<blockquote class="posterous_short_quote">
<p>Obrtna sredstva traju najduže godinu dana i cijelu svoju vrijednost prenose na gotov proizvod.</p>
</blockquote>
<p>Čitajući ovo, ispada da se ovaj termin ograničava isključivo na <strong>materijalna</strong> sredstva (klasa 1), a ne na finansijska sredstva (klasa 2) ?!</p>
<p>Bilans stanja(***) koristi sljedeće termine:</p>
<ul>
<li>1 - zalihe <br /> 
<ul>
<li>sirovine i materijal</li>
<li>proizvodnja u toku</li>
<li>proizvodi (misli se na gotove)</li>
<li>trgovačka roba</li>
<li>avansi na zalihi</li>
</ul>
</li>
<li>2 - potraživanja od prodaje (misli se na kratkoročna potraživanja)                
<ul>
<li>potraživanja od kupaca, povezanih pravnih lica</li>
<li>potraživanja od kupaca u zemlji i inostranstvu</li>
<li>potraživanja za prodatu robu u komisionu i konsignaciji</li>
<li>druga kratkoročna potraživanja</li>
</ul>
</li>
</ul>
<p>Jo&scaron; će na kraju ispasti da ni asistentova sugestija na ispitu nije tačna ?! Hah .... sad me je ovo zaintrigiralo ...</p>
<p>Na strani knjige 35, imamo sljedeće:</p>
<blockquote class="posterous_short_quote">
<p>Opticajni (obrtni) kapital. Dio opticajnog kapitala nalazi se u obliku zaliha materijala i gotovih proizvoda i proizvodnji u toku, dio je u novčanom obliku.</p>
</blockquote>
<p>Ova definicija opet očigledno misli na sumu vrijednosti u klasi 1 i klasi 2. <span style="text-decoration: underline;"><strong>Dva ovako slična termina različitog značenja na samo 5 stranica razlike</strong></span> !?!?</p>
<blockquote class="posterous_short_quote">
<p>Ovakve stvari su prave "terminolo&scaron;ka bombe" - kod studenata stvaraju konfuziju. Iz takve konfuzije jedini "izlaz" je ... "bubanje" napamet !</p>
</blockquote>
<p><span style="text-decoration: underline;"><strong>Bilans stanja</strong></span></p>
<p>Tako recimo nastavnik preferira "Bilans imovine" (knjiga str. 19). Ja sam prvi put čuo za taj termin. Ali mi nije bilo problem da to memori&scaron;em, s obzirom da se iza toga navodi i uvriježeni termin "Bilans stanja".</p>
<p><span style="text-decoration: underline;"><strong>Bilans uspjeha</strong></span></p>
<p>Ovdje opet nastavnik preferira termin "Bilans prihoda i rashoda" koji nije uvriježen.&nbsp; Kao sinonim navodi uvriježeni termin "Bilans uspjeha".</p>
<p>Ono &scaron;to mi je ovdje "zaparalo oči" jeste sadržaj tog izvje&scaron;taja. Navodi se da je ovo njegov sadržaj:</p>
<ul>
<li>3 - tro&scaron;kovi vezano za formiranje zaliha</li>
<li>6 - Prihodi i rashodi nevezano za zalihe</li>
</ul>
<p>Prije svega, u "pravom" - zvaničnom izvje&scaron;taju klasa 3 ne figuri&scaron;e. Ali to je najmanji problem. Problem je &scaron;to ovdje postoji logično pitanje:</p>
<p>A gdje se nalaze prihodi VEZANO za zalihe ?</p>
<p>Sam termin "vezano", "nevezano" za formiranje zaliha je krajnje nespretan i lo&scaron;e odabran. Ako je i primljenljiv, primjenljiv je je samo za proizvodne i trgovačke firme. U uslužnoj firmi, kao &scaron;to je moja, prihodi su vezani za prodaju usluga. Ali da vidimo &scaron;ta pi&scaron;e u jednom "pravom" izvje&scaron;taju:</p>
<blockquote class="posterous_short_quote">
<p>60 - prihod od prodaje</p>
</blockquote>
<p>Nikakve se tu zalihe ne pominju, ni da je vezano ni da je nevezano ... to je jednostavno prihod od operativne djelatnosti, i to je glavna cifra koju čitamo na prihodovnoj strani.Tamo negdje na kraju figuri&scaron;u i ostali prihodi koji nisu posljedica operativne djelatnosti (drugi finansijski prihodi).</p>
<p><span style="text-decoration: underline; color: #ff0000; font-size: medium;"><strong>Precizna, jasna, konzistentna terminologija je bitna ! </strong></span></p>
<p>U slučaju ovog predmeta, lo&scaron;e odabrani pojmovi nose dodatnu težinu s obzirom da se od studenata insistira na sopstvenim terminima.</p>
<p>Zato je kod ovog ispita potrebno znati:</p>
<blockquote class="posterous_short_quote">
<p>Da bi položili Reporting, trebate znati "Pra&scaron;ine termine". Napamet.</p>
</blockquote>
<p>To za nekoga ko se prvi put sreće sa ovom materijom ne predstavlja neki problem - on će "progutati" &scaron;ta god mu se servira.</p>
<p>Ako pak želite vi&scaron;e koristiti logičko prosuđivanje, ili imate ranija znanja, možete uletiti u "zamku" nekonzistentnih i lo&scaron;e odabranih termina.</p>
<p>Toga definitivno ne manjka u ovom prvom dijelu ispita. Iskreno, ni u narednim dijelovima ne očekujem bolje, poučen iskustvima sa "Statistike".</p>
<p>---</p>
<p>(*) Znam čovjeka, ali mu se imena ne mogu sjetiti - ubij me :( ... a sa čovjekom se uvijek fino "ispitam" ... Kolega, ako slučajno bude&scaron; čitao ovaj članak molim te napi&scaron;i svoje ime :)</p>
<p>(**) po starom kontnom planu, ali to je najmanje bitno.</p>
<p>(***) Zvanična forma izvje&scaron;taja u FBiH u zadnjih 5 godina</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, ispit</div>
</div>
<div class='post_responses'>
<h4>Pregleda 22061, komentara: 4</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Mar 21 2011,  2:58 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Re: Reporting I parcijalni, prijava	Mon 21 Mar 2011 10:57:10 AM CET<br />From: 	<a href="mailto:hernad@bring.out.ba" rel="nofollow">hernad@bring.out.ba</a><br />To: 	Asistent Reporting-a<p>Kolega Emire,<br />vezano za termin "Obrtna sredstva" koji smo dotakli na ispitu, u zadnjem poglavlju ovog članka <a href="http://hernad.bring.out.ba/reporting-prvi-parcijalni-ispit" rel="nofollow">http://hernad.bring.out.ba/reporting-prvi-parcijalni-ispit</a><br />"Terminologija" objasnio sam koji je moj rezon i stav.</p><p>Pozdrav,<br />---<br />Ernad Husremović, DL 2792</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Mar 22 2011,  7:18 AM</div>
<div class='response_name'>murga (Twitter) responded:</div>
</div>
<div class='response_body'>Citajuci ovo sto si napisao mogu izvuci samo jedan zakljucak:<p>"Nije pitanje kada cu poloziti, vec kako?" :)</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Mar 22 2011,  8:32 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Što murga ? Čini ti se preteškim ?<p>Nemoj da ti "maglu" stvara moje "potezanje" zakonski definisanih izvještaja Bilansa Stanja i Bilansa uspjeha. </p><p>To se od studenta ne traži. Od studenta se traži da to nauči doslonvo kako je u knjizi. </p><p>Pitao si me na jednom radnijem postu vezano za Reporting: "Da li treba spremati po knjizi ?" </p><p>Mislim da je to kod ovog ispita veoma poželjno. Moguće je teoriju nalupati po skriptama i preći zadatke ali ipak sam čitajući knjigu našao dosta toga što je potrebno za ispit. Ako ništa drugo, onda bar termine koje u članku pominjem.</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Mar 22 2011,  8:34 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Rezime bi znači bio: "nalupati" skripte, ali i knjigu :)</div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
