<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/01/pravilo-poslovna-korespondencije-no1-naslov-j.html">Previous</a>
&nbsp; 
<a href="../../../index-11.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/01/odgovornost-i-fiskalizacijska-lakrdija.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>bring.out forumi - internet podrška; bring.out marketing drugi dio</h3>
<div class='post_info'>
<span class='post_time'>January  6 2011,  6:35 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Komunikacija sa korisnikom koju sam pomenuo&nbsp; u jutro&scaron;njem članku&nbsp; <a href="/prekid-posla-sa-pismenim-ljudima">"Prekid posla sa pismenim ljudima"</a>, se nastavila novim pitanjem korisnika:</p>
<blockquote>
<p><span style="text-decoration: underline;"><span style="font-size: x-small;">Subject: korisnički račun na bring.out redmine</span></span><br /><span style="font-size: x-small;">Po&scaron;tovani Ernade,</span><br /><span style="font-size: x-small;">Hvala Vam &scaron;to ste iskreni po pitanju fiskalizacije i svaka čast za stav: <em><strong>"Mi svojim korisnicima ne prodajemo ublehe" :)</strong></em></span><br /><span style="font-size: x-small;">Željeli bi da provjerimo kako možemo zadržati svoj korisnički račun na bring.out redmine, jer smo prijavili notifikaciju na forum "fiskalizacija".</span><br /><span style="font-size: x-small;">Da li ćemo biti automatski isključeni jer vi&scaron;e ne spadamo u kategoriju "klijenti" i da li se možemo prijaviti kao "ne-klijent"?</span></p>
</blockquote>
<p>To je potvrdilo moju tezu da sam <a href="/genijalac">genijalac</a> :) Evo o čemu se radi ...</p>
<p><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>bring.out forumi</strong></span></p>
<p><strong>21.04.2009</strong> otvoren je <a href="/radni-dan-u-bringout#redmine">ticket <strong>#17104</strong></a> sa naslovom: <strong>"Otvoriti svim korisnicima pristup projektu korisnici "bring.out" (bring.out forumi)"</strong></p>
<p>Time sam pokrenuo jedan veoma bitan proces u bring.out-u: <span style="text-decoration: underline; color: #ff0000;"><strong>ustanovljavanje internet podr&scaron;ke</strong></span>.</p>
<p>Dosada&scaron;nje navike na&scaron;ih korisnika su bile "miljama daleko" od ovoga - pravi "science fiction". Iz tog razloga, ova moja inicijativa uop&scaron;te nije dočekana sa entuzijazmom ni od strane mojih kolega:</p>
<blockquote class="posterous_short_quote">
<p>U redu je to Ernade, ali korisnici neće da komuniciraju preko foruma. Oni čak neće ni mail da koriste :(</p>
</blockquote>
<p>Ja sam međutim bio uporan:</p>
<blockquote class="posterous_medium_quote">
<p>Mi smo ti koji uvode podr&scaron;ku putem foruma. Na&scaron; posao je da na pravi način animiramo korisnike.</p>
<p>Ako vas korisnik nazove telefonski - a vi za njega otvorite forumsku temu - prekucajte glavne dijelove razgovora.</p>
<p>Ako vam korisnik po&scaron;alje mail - vi otvorite forumsku temu i na njegov email odgovorite linkom na forum.</p>
<p>Pustite se kuknjave i radite po mojim instrukcijama !</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Status ticketa #17104 - "Zatvoreno"</strong></span></p>
<p>Bitno je reći da bi bez moje "toljage" status ticketa #17104 sigurno bio: <span style="color: #ff0000;"><strong>"Odbačeno</strong>"</span>.</p>
<p>Međutim, nakon niza "ribanja" i moje istrajnosti da se inicijativa provede, serviseri su nakon par mjeseci počeli postupati po ovim uputama.</p>
<p>Ticket je <strong>31.05.2010</strong> dobio status "Zatvoreno". Uh &scaron;to volim ovaj status :)</p>
<p><strong>Znači, na uspostavljanju bring.out foruma radilo se vi&scaron;e od godinu dana. </strong></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>&Scaron;ta je bila moja prvobitna zamisao ?</strong></span></p>
<p>Moj cilj je bio da svu <strong>komunikaciju sa korisnicima prebacimo na jedno mjesto</strong>. Kada se na tom mjestu počnu nalaziti informacije, korisnici će postupno i sami uvidjeti:</p>
<ol>
<li> da su forumi odlično mjesto za brzu i efikasnu komunikaciju</li>
<li>da se se odgovori na forumima dobijaju čak i kada su svi serviseri raspoređeni na terene(*)</li>
<li>da iskusniji korisnik samostalno može svoj problem rije&scaron;iti  opcijom "Traži" </li>
</ol>
<p>Pored očigledne koristi za korisnike, mi smo kao firma putem foruma počeli "hvatati" sve bitne servisne radnje i operacije =&gt; &scaron;irimo sopstvenu bazu znanja =&gt; <span style="color: #ff0000;"><strong><span style="font-size: medium;">svakodnevno povećavamo svoj knowhow</span></strong></span>.</p>
<p>Tokom kori&scaron;tenja sistem, sistem smo svakodnevno "&scaron;iljili". Na kraju smo do&scaron;li do toga da je optimalan način kori&scaron;tenja slijedeći:</p>
<ol>
<li>forumi se koriste za eksternu komunikaciju - komunikaciju sa klijentima</li>
<li>redmine ticketi za obavljanje internih poslova bring.out(**) </li>
</ol>
<p>Sada su forumi postali "te&scaron;ka artiljerija" bring.out-a sistema podr&scaron;ke korisnicima.</p>
<p><strong><span style="color: #ff0000; font-size: medium;">Iz ovog razloga mi smo(***) IT firma koja ima daleko najbolji koncept podr&scaron;ke korisnicima na bosanskom trži&scaron;tu.</span></strong></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Odgovor korisniku</strong></span></p>
<blockquote>
<p><em>&gt; Da li ćemo biti automatski biti isključeni jer vi&scaron;e ne spadamo u  kategoriju "klijenti" i da li možemo biti prijavljeni kao "ne-klijent"?</em><p />Ma jok.<p />Mi  smo otvorena firma. U principu i ne morate biti na&scaron; korisnik da bi  imali pristup korisničkim forumima. Forumi su prevashodno zatvoreni radi  za&scaron;tite od spama i sličnih zloupotreba.<p />knowhow projekat, iako je na&scaron; strate&scaron;ki projekat,&nbsp; otvoren je u potpunosti za anonimne internet posjetioce <span class="Object"><a href="http://redmine.bring.out.ba/projects/knowhow/wiki" target="_blank">http://redmine.bring.out.ba/projects/knowhow/wiki</a></span><p />Stava smo da je otvorenost na&scaron;a velika prednost.<p /><em>&gt;  Da li ćemo biti automatski isključeni jer vi&scaron;e ne spadamo u kategoriju  "klijenti" i da li možemo biti prijavljeni kao "ne-klijent"? </em><p />Va&scaron;e korisničke račune  ostavićemo u istom stanju. Ako budete imali potrebu za podr&scaron;kom,  nemojte se ustručavati da na na&scaron;im forumima uputite pitanje.<br />Internet komunikaciju najče&scaron;će ne naplaćujemo. Eto tako ostajete, dok god to želite, na&scaron; korisnik :)<p />Takođe,  nemojte ustručavati da kolegama koji rade ultra-duper-super MS Navision  implementaciju reći - ima jedna mala bosanska firma koja vam, ako ni&scaron;ta  drugo, može održati lekciju na temu: "Podr&scaron;ka korisnicima" :). Na kraju  krajeva -&nbsp; Vi ste klijent a oni provajder. Provajder je taj koji prvi  treba pokazati susretljivost i po&scaron;tovanje. Zato ih bez pardona " nalijepite".<p />&Scaron;alu na stranu: Cijenimo na&scaron;u dugogodi&scaron;nju saradnju, tako da su Vam na&scaron;a vrata uvijek otovorena - posebno ova "internet" vrata.<br />Pozdrav :)</p>
</blockquote>
<p>Da li je ovaj odgovor marketin&scaron;ki potez ?</p>
<p>Hmm ...&nbsp; Kako sam odgovorio u ranijem članku na ovu temu <a href="/bringout-marketing">"bring.out marketing"</a> - JESTE. Međutim, puni bitnije pitanje je ovo:</p>
<blockquote class="posterous_short_quote">
<p>Da li sam dao ovakav odgovor zarad marketinga ili zato &scaron;to bring.out doista funkcioni&scaron;e na ovim principima ?!</p>
</blockquote>
<p>Ako jo&scaron; ne znate odgovor na ovo pitanje - potražite ga na <a href="http://www.bring.out.ba">http://www.bring.out.ba</a>, <a href="http://redmine.bring.out.ba/projects/knowhow/wiki">http://redmine.bring.out.ba/projects/knowhow/wiki</a>, <a href="http://hernad.bring.out.ba">http://hernad.bring.out.ba</a></p>
<p>---</p>
<p>(*) Ja recimo nikada ne radim telefonsku podr&scaron;ku ili rad na terenu. Ali redovno pratim forume i po potrebi se uključujem u diskusije. Na taj način i serviseri su svjesni da ne mogu "lupetati" &scaron;ta im je volja, a i korisnici stiču povjerenje da se njihov problem rje&scaron;ava na najbolji mogući način</p>
<p>(**) na knowhow projektu i ticketi i forumi su otvoreni. Međutim ova podjela funkcija je zadržana: ticketi se koriste za rad developera i servisera na projektu, a forumi za eksternu komunikaciju</p>
<p>(***)&nbsp; Naravno, ovo baziram na meni poznatim informacijama. Ako postoji jo&scaron; firma sa sličnim načinom podr&scaron;ke, volio bih o tome podijeliti iskustva.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, business, poslovna_korespondencija, sistem</div>
</div>
<div class='post_responses'>
<h4>Pregleda 5343, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
