<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/01/spam-or-not-spam.html">Previous</a>
&nbsp; 
<a href="../../../index-11.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/01/uvod-u-baze-podataka-zbrkizacija.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Perfekcionista</h3>
<div class='post_info'>
<span class='post_time'>January 13 2011,  4:08 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Dobio sam jedan komentar o mom pisanju koji mi je "zapao za oči". Rečeno mi je da sam perfekcionista i pedantan čovjek.</p>
<p>Riječ "perfekcionista", "pedantan" može biti pozitivna i negativna. <a href="/kontekst">Kontekst</a> je bitan. Čitajnjem komentara zaključio sam da je komentator perfekcionizam naveo u pozitivnom kontekstu.</p>
<p>Međutim, kako je ta kvalifikacija zavr&scaron;ena konstatacijom "insan nije savr&scaron;en", shvatio sam da ipak nisam shvaćen na pravi način.</p>
<p>O tome za&scaron;to pi&scaron;em postoji niz članaka:</p>
<ul>
<li><a href="/100-ti-blog-post">"100-ti blog post"</a></li>
<li><a href="/savjet-moga-babe">"Neću da budem fikus"</a></li>
<li><a href="/citalac">"Čitalac"</a></li>
<li><a href="/genijalac">"Genijalac"</a></li>
<li><a href="/gorka-istina">"Gorka istina"</a></li>
</ul>
<p>Nesavr&scaron;enost insana je stvar od koje uvijek polazim. U zadnjem od pomenutih članaka pi&scaron;e:</p>
<blockquote class="posterous_short_quote">
<p>Za dunjalučke stvari krajnji sud, to dobro znamo, ne postoji. Međutim,  nastojanje da se djeluje dobro, borba za bolje, jeste na&scaron;a obaveza.</p>
</blockquote>
<p>Vrlo je bitno da ta "borba za dobro" ne postane "sitničaranje" - insistiranje na nebitnim stvarima ili "Don-kihotovska" borba - nastojanje da se ostvari ne&scaron;to nemoguće.</p>
<p><!--more-->U članku "100-ti blog post" pi&scaron;e:</p>
<blockquote class="posterous_medium_quote">
<p>... Iskreno bih volio da se na mom blogu pojave diskusije sa  neistomi&scaron;ljenicima. Ali isključivo na principima meritokracije. Nažalost  takvo &scaron;to se jo&scaron; nije de&scaron;avalo. Za&scaron;to ? Možda zato &scaron;to mi je "svaka na mjestu" !?</p>
<p>He he he&nbsp; ... Dragi moji čitaoci, možda sam lud, al' takav glupan ili  egocentrik nisam. Ja dobro znam da sam u 100 članaka barem 50 "bombi  kragujevki bacio".</p>
<p>Ja sam informatičar: Svaki sistem, svaki proizvod ima bugove.</p>
<p>Zato znam da u mojim člancima, koji su opet refleksija mojih stavova, ima "more" bug-ova.&nbsp; ...</p>
</blockquote>
<p>I kao musliman i kao informatičar, jedino ispravno polazi&scaron;te analize bilo koje aspekta ljudskog života mora biti: "insan je napravljen nesavr&scaron;en".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Koncept upgrade-a</strong>(*)</span></p>
<p>Kao informatičar opet znam za bitnost koncepta "upgrade"-a. Bosansko dru&scaron;tvo je dru&scaron;tvo apatije. Do&scaron;li smo u fazu da, bez obzira koliko stvari bile naopake, ljudi komentari&scaron;u:</p>
<blockquote>
<p>"Ne valja, ali &scaron;ta sad - <a href="/ipak-tako-ne-mora-biti">tako to mora biti</a>".</p>
<p>"U redu, tačno je da to treba ispraviti, ali od toga ima puno prečih stvari"</p>
</blockquote>
<p>Ja nisam i ne želim biti <a href="/bosna-glup-lud-il-bahat">dio te priče</a>. Jo&scaron; bitnije, želim svoju djecu naučiti da ovu bosansku "filozofiju" življenja ne prihvataju !</p>
<p>Da li ću ja ne&scaron;to promijeniti ? Pojma nemam - to samo dragi Allah zna. Da li će to pomoći da moja djeca ne&scaron;to promijene? Ni to ne mogu znati.</p>
<p>Međutim, <strong>ubijeđen sam im nema pomoći</strong> ako se ne naoružaju znanjem, sposobnosti sopstvenog rasuđivanja, hrabro&scaron;ću da "razbijaju" uvriježene kli&scaron;eje, te spoznajom da bez borbe bolje ne mogu ni očekivati.</p>
<p>Informatičarskim rječnikom, učim ih da prepoznaju koncept <strong>upgrade</strong>-a :)</p>
<p>Informatička praksa kasnije razdvaja "minor" i "major"(**) upgrade. Svaki ima svoju ulogu i svoju bitnu funkciju.</p>
<p>Upravo iz tog razloga se ne smije olahko kategorizirati ne&scaron;to kao "u redu, ali ima prečih stvari".&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kontekst</strong></span></p>
<p>Kontekst je riječ koju često rabim. Iz prostog razloga &scaron;to svaka pojava, svaki događaj ima svoj kontekst. "Kontekst" je opet riječ koju mnogi Bosanci jednostavno ne shvataju ili jednostavno ignori&scaron;u.</p>
<p>Kada se ne&scaron;to obja&scaron;njava, malo je konstatacija koje su tačne mimo konteksta vremena i prostora. U članku <a href="/svjetonazor">"Svjetonazor"</a> sam rekao &scaron;ta smatram "konstantama".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Pisanje kao metoda testiranja</strong></span></p>
<p>Moj način komunikacije je po ukusima mnogih često grub, preo&scaron;tar. Ja sam toga potpuno svjestan. Za&scaron;to to ne ublažim ? Za&scaron;to se ne potrudim da to isto stavim u jednu ljep&scaron;u, lak&scaron;e "stvarljivu" formu ?!</p>
<p>E to je, opet ću se informatičkim riječnikom izraziti, moj način "testiranja". Naime, pametni ljudi kada ih "napadne&scaron;" argumentima odgovaraju na jedan, a kabadahije, neznalice, sujetni uvijek odgovaraju ignorisanjem ili prijetnjama - agresijom ili u najboljem slučaju ishitrenim i neargumentiranim odgovorima.</p>
<p>Često je komentar na moje pisanje i ovaj:</p>
<blockquote class="posterous_short_quote">
<p>Za&scaron;to sebi stvara&scaron; neprijatelje ?</p>
</blockquote>
<p>Ne. Ja ne pi&scaron;em da bih stvarao neprijatelje i glumio "pojedinca":&nbsp; "Sam protiv čitavog svijeta; Ja sam pametan, al' oko mene su papci".</p>
<p>Moje pisanje je, pored ostalog, svojevrsno istraživanje . Pisanje je mehanizam koji mi pomaže da se "neprijatelji"(***) sami otkriju. Svako onaj ko ne želi ili nije sposoban voditi argumentiranu diskusiju ne može biti moj prijatelj - onaj sa kojim dijelim viziju i način kako doći do boljeg dru&scaron;tva za nas i na&scaron;u djecu. Takvi su moji "neprijatelji". Bolje je znati ko je na kakvoj strani.</p>
<p>Te&scaron;ke i konfliktne situacije su najbolji detektori pravog - autentičnog pona&scaron;anja ljudi. Iz tog razloga konfliktne situacije mogu biti dobar medijator izgradnje realnih odnosa među ljudima. Odnosa koji nisu opterećeni lažnim odobravanjem i uvađavanjem.</p>
<p>Iza "hvalospjeva" se najče&scaron;će krije najobičnije licemjerstvo.</p>
<p>Iza ignorancije redovno stoji bahatost ili nesposobnost da se izađe iz uviježenih kli&scaron;ea, bez obzira da li su oni ispravni ili ne.</p>
<p>Iza nespremnosti za diskusiju i izno&scaron;enje jasnih stavova kriju se ... "papci".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Primjeri</strong></span></p>
<p>Uzeću za primjer članke na temu <a href="http://hernad.bring.out.ba/?sort=&amp;search=nepismeno">"nepismeno"</a>, <a href="/tag/antiznanje">"antiznanje"</a> Ili onaj u kome navodim tezu da sam <a href="/veliki-musliman-i-software">veći musliman od Reisa</a>.</p>
<p>Svi ti članci u sebi notu provokacije, grubosti, ironije. Ali razmislite malo: zar svako od onih koji se smatraju prozvanim nema <strong>mogućnost izbora</strong> ?&nbsp; Zar se ne može reći:</p>
<blockquote>
<p>Hm .... na ovo nisam pazio, ali fakat ima smisla.</p>
<p>Hmm ... istina je da je kori&scaron;tenje tuđih prava napad na tuđi haak ... a mi o tome ne vodimo računa</p>
<p>Da, u pravu ste ... hvala na sugestijama ... ispravio sam gre&scaron;ke koje ste uočili</p>
<p>Ne niste u pravu, moj način je ispravan zato i zato ...</p>
<p>Znam da postoje gre&scaron;ke, ali ih neću ispraviti zato i zato ...</p>
<p>To &scaron;to vi smatrate gre&scaron;kama, to je ispravno zato i zato ...</p>
<p>Da, pitanje autorskih prava je bitno - napisaćemo posebno fetvu o tome. Rijaset ne koristi nelegalni software. U svim džamijama smo dali uputu da se nelegalni software ukloni.</p>
<p>Hvala &scaron;to ste ukazali na nepreciznost <a href="/allah-mubareci-nova-2011-godina">"fetve o Deda-mrazu"</a>, kao prilog toj fetvi mi smo prokomentarisali par konkretnih situacija.</p>
<p>Ne slažemo se sa va&scaron;im konstatacijama da je fiskalizacija <a href="/odgovornost-i-fiskalizacijska-lakrdija">lakrdija</a> te da se projakt nestručno obavlja. &Scaron;to se tiče analize, ona postoji - objavljena je &lt;ovdje&gt;</p>
<p>Ti si jedan neznalica zato i zato ...</p>
<p>Vi ste jedan bezobraznik zato i zado ...</p>
<p>Ti si ludak zato i zato ...</p>
</blockquote>
<p>Mogli su, ali nisu. Za&scaron;to? Zato &scaron;to moja "baljezganja" nisu vrijedna riječi?</p>
<p><span style="font-size: medium;"><strong><span style="color: #ff0000;">Ne.&nbsp; Ubjeđenja sam da je glavni razlog taj &scaron;to direktno ili indirektno prozvani&nbsp; ne znaju o čemu ja uop&scaron;te pričam ili su pak bahati pa dalje "od svog nosa" ne mogu ni vidjeti.</span></strong></span></p>
<p>Kako god bilo, da bi svoje stavove branio treba se uložiti truda. Treba&scaron; biti "kalibar". Treba&scaron; biti  "faca".&nbsp; Treba&scaron; imati sposobnost autorefleksije:</p>
<blockquote class="posterous_short_quote">
<p>hernad možda i jeste lud, ali ta i ta mu je pametna. To je moj nedostatak. To ću popraviti.</p>
</blockquote>
<p>Pa tom hernadu odgovoriti:</p>
<blockquote class="posterous_short_quote">
<p>hernade, mislim da si "lud ko gljiva" zato i zato. Ali dio o tome i tome prihvatam.</p>
</blockquote>
<p>Ili:</p>
<blockquote class="posterous_short_quote">
<p>To hernade nije tako, pogledaj tu i tu, pa će&scaron; se uvjeriti da si u krivu.</p>
</blockquote>
<p>Takvih je diskusija nažalost malo, ako ikako. To je &scaron;teta. Ali to je Bosna danas.</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Perfekcionista</strong></span></span></p>
<p>Ako se pod pojmom "perfekcionista" misli na onoga koji nikada nije zadovoljan i uvijek misli da može bolje - to jesam.</p>
<p>Ako se pod pojmom "perfekcionista" misli da polazim od toga da "sitnice" grade "krupnice" - to jesam.</p>
<p>Ako se pod pojmom "perfekcionista" misli&nbsp; na onoga ko "sitničari", pravi "od muhe slona" - takvo &scaron;to nastojim izbjeći.</p>
<p>Ako se pod pojmom "perfekcionista" misli da sam neko ko želi ostvariti nemoguće - zanemaruje realitete - to nisam.</p>
<p>---</p>
<p>(*) upgrade - nadogradnja, usavr&scaron;avanje, mijenjanje na bolje</p>
<p>(**) minor upgrade - mali, minoran, sitne korekcije; major upgrae - veliki upgrade</p>
<p>(***) preciznije bi bilo reći neistomi&scaron;ljenike, one koji sa mnom ne dijele temeljni vrjednosni sistem</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dunjaluk</div>
</div>
<div class='post_responses'>
<h4>4313 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>