<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/01/samra-myp-ocjene-prvo-polugodiste.html">Previous</a>
&nbsp; 
<a href="../../../index-11.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/01/autenticnost-materijala.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3> Uvod u baze podataka, MS Access je pogrešan odabir</h3>
<div class='post_info'>
<span class='post_time'>January 19 2011,  6:18 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Posljednji set predavanja video materijala me nije odu&scaron;evio kao <a href="/uvod-u-baze-podataka-vjezbe-youtube">prvi</a>. Dapače. Razlog nije lo&scaron; kvalitet video materijala nego odabir teme: "Database GUI". U komentarima članka <a href="/uvod-u-baze-podataka-konverzija-er-u-r-model">"UBP hello world"</a> sam naveo linkove na te video materijale.</p>
<p>Naime, kolege sa UBP-a su, posmatrajući <a href="/kontekst">kontekst</a> predmeta i glavne obrazovne ciljeve, imale pogre&scaron;an pristup. Naglasiću da pod "glavni obrazovni ciljevi" mislim na ono &scaron;to ja smatram glavnim ciljevima ovakvog predmeta, ne ono &scaron;to pi&scaron;e u Syllabus-u predmeta. Objasniću moj stav.</p>
<p><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>Access RAD okruženje</strong></span><p />U prvom setu video materijala, jedna od stvari koju sam pohvalio je činjenica da u tim materijalima odabrani alat (MS access) ne dominira.<p />U posljednjem setu koji se odnosi na GUI, takvo &scaron;to je bilo nemoguće postići. Naime, Access jeste dobar alat i intuitivan <a href="http://en.wikipedia.org/wiki/Rapid_application_development">RAD</a> alat za NEPROFESIONALCE.</p>
<p>Ovakav pristup predmetu "Uvodu u baze podataka" bi možda bio prihvatljiv za ekonomski fakultet ili fakultet poslovne informatike. Međutim za Fakultet informacijskih tehnologija prvi koraci se ne bi trebali raditi sa RAD alatima.&nbsp;</p>
<p>RAD pristup se zasniva na većem nivou apstrakcije i skrivanju nepotrebnih detalja. Međutim, bitno je uočiti koja je ciljna grupa određene aplikacije.</p>
<p>MS Access se pozicionira kao alat koji omogućava da i korisnici koji nisu upućeni u relacijske baze podataka dođu do rje&scaron;enja baza podataka za lične potrebe. Nardoski rečeno, MS Access je alat sa kojim i <span style="color: #ff0000; font-size: medium;"><strong>neinformatičari</strong></span> mogu napraviti bazu podataka(*)&nbsp;</p>
<p><strong>I to Access radi odično</strong>. U tom domenu Access je sigurno bez ozbiljne konkurencije(**). Međutim, niko, ama ba&scaron; niko ne radi složenije projekte baza podataka sa access-om. Za&scaron;to ? Zato &scaron;to to nije svrha Access-a.<p />Zato ove dobra osobina Accessa u jednom kontekstu, taj isti alat u drugom kontekstu - kontekstu edukacije čine lo&scaron;im alatom.<p />Razlog tome su odluke dizajnera aplikacije: <strong>&Scaron;to vi&scaron;e detalja sakriti od korisnika aplikacije</strong>. <p />Pogledajmo recimo način kreiranja sheme tabele. Ulazimo u dizajn view baze podataka:</p>
<ul>
<li>defini&scaron;emo vrstu polja</li>
<li>defini&scaron;emo dodatne parametre kao &scaron;to je input maska tog polje ...</li>
</ul>
<p><br />Korisnik će logično pretpostaviti da su svi ovi atributi definicije <strong>baze podataka</strong>. A NIJE. Vrsta polja defini&scaron;e bazu, dok je input maska parametar koji access koristi u svom <strong>aplikacijskom</strong> modelu.&nbsp; Access-ov aplikacijski model je stvar njegovih implementatora, kao i svake druge aplikacije.</p>
<p>Činjenica je da svaka <strong>aplikacija</strong> koja rukuje bazom podataka takođe uvodi pojam input maske na ovaj ili onaj način. Međutim, to je <strong>aplikativni</strong> dio. Za razliku od ekonomiste kome je dobro da mu se ovo sve stavi na jedno mjesto, informatičaru u procesu učenja nije.</p>
<p>Access čak i kod vrste polja stvara stanovitu "maglu".&nbsp; U njemu se defini&scaron;e pojam "text" &scaron;to je u relacijskim bazama (pretpostavljam) "varchar" tip.<br />&nbsp;<br />Kreatori access-a su to radili sa razlogom: Do&scaron;li su do saznanja da njihova <strong>primarna ciljna grupa - neinformatičari</strong> bolje usvajaju pojam termin "text", nego "varchar". Takve stvari međutim nisu poželjne u procesu učenja.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Uvod u (relacijske) baze podataka bez SQL-a</strong></span><p />SQL je standard. Kolege na FIT-u su odlučili da "Uvod u baze podataka" ne sadrži SQL, nego da se napravi "laganiji" uvod uz pomoć Access-a i access-ovih apstrakcija.<p />Takav odabir je na studiju informatike potpuno pogre&scaron;an. Na studiju ekonomije vjerovatno nije.<p /><span style="text-decoration: underline; font-size: medium;"><strong>Kako drugi obrađuju "Uvod u baze podataka" ?</strong></span><p />Zainteresovalo me je kako to drugi rade.</p>
<p>Na Sarajevskom ETF-u kurs se naziva <a href="http://c2.etf.unsa.ba/course/view.php?id=112">"Osnove baza podataka"</a>(***). Pohađa se u četvrtom semestru.<p />&Scaron;to se tiče alata, koristi se mysql. Nigdje nisam na&scaron;ao ni&scaron;ta &scaron;to se tiče GUI-a. To je definitivno uljez predmeta na FIT-u.<br />SQL se obrađuje bez odlaganja. <p />Na početnom kursu se ne obrađuju nikakvi RAD alati na način kako se to čini na FIT-u.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Rezime</strong></span></p>
<p>Nakon svega &scaron;to sam i&scaron;čitao, jo&scaron; vi&scaron;e sam ubijeđen da praktični "hello world" relacijskih baza podatka na svakom fakultetu informacionih tehnologija mora biti ovo(****):</p>
<p><p><a href="https://gist.github.com/786251">https://gist.github.com/786251</a></p></p>
<p>Nikakav "design view", "form view" ili "report view". To pripada nekom sasvim drugom kursu(*****). Predmetu "Uvod u (relacione) baze podataka" to ne pripada.<p />Naravno, meni ni&scaron;ta ne preostaje nego da prihvatim zadatke koji su predmetni nastavnici postavili.</p>
<p>Sa žaljenjem konstatujem da postoje konceptualne sličnosti sa predmetom <a href="/koncept-predmeta-statistika-i-vjerovatnoca-na">"Statistika i vjerovatnoća"</a>. Na "Statistici" se de&scaron;ava, slobodno se može reći, zloupotreba MS Excel-a. Kod UBP-a je termin "zloupotreba" preijak. Međutim, kvalifikacije "pogre&scaron;an odabir", "pogre&scaron;na metodologija" stoje.</p>
<p>Kori&scaron;tenje RAD alata na ovom kursu je metodolo&scaron;ka gre&scaron;ka.</p>
<p>----</p>
<p>(*) Precizno: aplikaciju za upravljanje bazom podataka</p>
<p>(**) Recimo "Openoffice base" je poku&scaron;ao konkurirati Access-u ali je taj projekat totalni proma&scaron;aj. Pun bugova, spor, neintuitivan.</p>
<p>(***) login as "guest"</p>
<p>(****)&nbsp; Korisnik te korake treba napraviti uprav na sql konzoli. Takvo &scaron;to radi sa neznatnim varijacijama na bilo kojoj relacijskoj bazi: mysql, postgresql, sqlite, oracle, mssql ... odaberite koju god želite</p>
<p>(*****) Microsoft ima sjajan sistem edukacije. Siguran sam da su njegovi MS Access kursevi odlični za one kojima takvo znanje treba.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, obrazovanje, sistem</div>
</div>
<div class='post_responses'>
<h4>Pregleda 7819, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
