<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/06/kad-ti-neko-ili-nesto-ogadi-fakultet.html">Previous</a>
&nbsp; 
<a href="../../../index-16.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/06/car-studiranja.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Odakle ja na FIT-u</h3>
<div class='post_info'>
<span class='post_time'>June 16 2010,  2:17 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'>

<p>U jesen pro&scaron;le godine mi je supruga do&scaron;la i rekla: &ldquo;Ernade, ja ti moram ne&scaron;to reći &hellip;&rdquo;</p>
<p>To je tako ozbiljno zvučalo da mi je kroz glavu pro&scaron;lo hiljadu misli &hellip;</p>
<p>Dženana je nastavila: &ldquo;Dedi (op.aut moj babo) je ostala velika želja da ti zavr&scaron;i&scaron; fakultet&rdquo;</p>
<p>&ldquo;Molim ?!&rdquo;, ostao sam u čudu.  &ldquo;Njega to i dan danas muči ?! Ajoj &hellip;&rdquo;</p>
<p><!--more--></p>
<h2>Moji babo i mati</h2>
<p>Moj babo je moj veliki fan. Da, ba&scaron; tako. &Scaron;ta god je meni u mojoj  40-godi&scaron;njim istoriji palo na pamet, moj babo je vazda govorio: &ldquo;dobra  ideja&rdquo;.</p>
<p>Od pametnih ideja do totalnih budala&scaron;tina.</p>
<p>Mati nije bila po strani, ali je imala sasvim drugu ulogu. I ona je  uvijek bila tu kod poduhvata zvanog &ldquo;izvedimo Ernada na selamet&rdquo;.</p>
<p>Međutim, njena uloga je redovno bila uloga logističara, a babina direktna implementacija. Ona back-office, babo front-office.</p>
<p>Ja nisam sin jedinac. Imaju oni dva sina. I ne mislim da sam onaj koji je vi&scaron;e voljen.</p>
<p>Ali svakako su odnosi između mojih roditelja i mene, i mog brata i njih uvijek bili <strong>drugačiji</strong>.</p>
<p>Vjerovatno jer smo i nas dvojica skroz različite osobe &hellip; Ja uvijek nekakav &ldquo;divlji&rdquo;, a on vazda &ldquo;pitom&rdquo;.</p>
<h2>Za&scaron;to je diploma bitna ?</h2>
<p>Vratimo se na glavnu temu, i moj razgovor sa Dženanom:</p>
<p>&ldquo;Pa dobro, ali za&scaron;to mi to nije rekao. Ja sam stvarno mislio da ih je to pro&scaron;lo &hellip;&rdquo;</p>
<p>Onda sam za&scaron;utio. I počeo razmi&scaron;ljati.</p>
<h2>Moja firma je &scaron;upica-tach ?!</h2>
<p>&ldquo;Joj, &Scaron;ekib (op.aut moj babo) je skont'o kako je moja firma &scaron;upica tach &hellip; i kako je sav taj projekat zalud vrijeme &hellip;&rdquo;.</p>
<p>Ne ne nije on to meni nikada rekao. I čak i da to misli on to nikada ne bi rekao. Jer zna da je to moj životni projekat.</p>
<p>Zna koliko sam se u to uložio, i zna da je upravo &lsquo;96 na vagi:  &ldquo;Zavr&scaron;iti fakultet&rdquo; ili &ldquo;pokrenuti firmu&rdquo; ovo drugo bez plaho diskusije  pobijedilo.</p>
<h2>Pa jesam li fakat zezn'o stvar ?!</h2>
<p>Iz ove perspektive, jesam. Zezn'o sam. Diploma je korisna stvar. Sa njom se mnoge stvari mogu sa puno manje energije rije&scaron;iti.</p>
<p>Ali to mi je najmanje bitno.</p>
<p>*Zezn'o sam stvar jer nisam prepoznao koliko je to mojim roditeljima golemo.**</p>
<p>Posebno mom babi. A ja sam, kao &scaron;to je on moj, njegov veliki fun. I  to ne samo zato &scaron;to je moj babo. On je doista poseban čovjek. Dobričina.  Lafčina.</p>
<h2>98', neuspio poku&scaron;aj</h2>
<p>Danima sam bio kao nakoutiran. Tamo negdje &lsquo;98 sam ja sam se k'o fol vratio na ETF.</p>
<p>Ali taj poku&scaron;aj je u startu bio osuđen na propast:</p>
<p>Bio sam ufuran kako je &ldquo;biznis&rdquo; ispred svega, kako će fakultet biti  samo gubljenje vremena, &hellip; kako ionako nemam namjeru da se bavim ničim  drugim od onoga &scaron;to sada radim &hellip;</p>
<p>U to vrijeme, &scaron;to se tiče posla. glava mi je bila totalno &ldquo;u balonu&rdquo;. Sve su to bili počeci, ja sam tek učio kako se radi posao.</p>
<p>Ono &scaron;to mi je &ldquo;maglilo&rdquo; vidike bila je činjenica da jeu u to vrime  firma bila u snažnom usponu. Druga strana medalje, da je to ipak bio  &ldquo;one-man show&rdquo;.  Bez mene se ni&scaron;ta nije moglo zav&scaron;iti.</p>
<p>Svaki poku&scaron;aj da ne&scaron;to značajno prenesem na druge zavr&scaron;avalo je neuspjehom.</p>
<p>Nakon manje od  dvije hefte do&scaron;ao sam kući i Dženani rekao: ja sam sa fakultetom zavr&scaron;io.</p>
<h2>Veliki tresak 2004</h2>
<p>Nakon toga se puno izde&scaron;avalo. 2004 se u firmi desio pad koji bih  najbolje opisao padanjem jumbo-jet-a sa 2000 metara bez motora.</p>
<p>I ba&scaron; kao u filmovima C klase, taman da se desi veliki big-bang, tu se radnja zaustavi.</p>
<p>Za razliku od filmova, kako to biva u realnom svijetu, posljedica je bilo.</p>
<p>Ono &scaron;to je (nažalost) bilo neophodno, desilo se. Ja sam morao doći do dna da bih se presabrao.</p>
<h2>Backup babo</h2>
<p>U tom te&scaron;kom periodu, ja sam totalno izgorio. I to ne samo figurativno :)</p>
<p>Kako je Dženana psiholog, ona je imala je dala dijagnozu: &ldquo;Ernade, ti  ima&scaron; klasične simptome profesionalnog sagorjevanja. Nemoj se zezati sa  tim. Uzmi bolovanje ili će&scaron; jo&scaron; vi&scaron;e zaglibiti&rdquo;.</p>
<p>Tako i bi. Oti&scaron;ao sam na bolovanje. I meni je bilo sasvim jasno da je dotjeralo &ldquo;cara do duvara&rdquo;.</p>
<p>Tada je opet nastupio moj babo. On je oti&scaron;ao u firmu i reka ljudima:  &ldquo;Momci, Ernad će biti jedno vrijeme odsutan. &Scaron;ta god vam treba, ja sam  tu. Ako vam treba pomoć oko naplate, ako nemate dovoljno sredstava za platu,  recite i to ćemo rije&scaron;iti. Vi samo nastavite raditi svoj posao&rdquo;.</p>
<p>Dva mjeseca sam bio odsutan. Nisam dotakao računar, niti sam se bavio poslom.</p>
<h2>Firma danas</h2>
<p>Nakon svih tih turbulencija, svari su polahko krenule nabolje.</p>
<p>Firma se postupno stabilozovala, i &scaron;to je najbitnije, bitne lekcije sam napokon savladao:</p>
<p>Ne može se 18 sahata raditi. Ne može se na porodicu zaboraviti. Ne može se od koko&scaron;i orao praviti &hellip;</p>
<p>Sada smo jedna  mala firma, koja normalno posluje. Ni&scaron;ta ekstra, ali sasvim pristojno.</p>
<h1>Opet zatalasati sa fakultetom ?</h1>
<p>Nakon svih tih turbulencija, o fakultetu nisam ni razmi&scaron;ljao.</p>
<p>Taman je posao u&scaron;ao u mirne vode &hellip;</p>
<p>I sad opet praviti frku sa &ldquo;otvaranjem novih frontova&rdquo;.</p>
<p>Ma hajd' &scaron;to su novi frontovi, nego &scaron;to ja za tim nemam ama ba&scaron; nikave želje ?!</p>
<p>Nakon 40 godina, ja &ldquo;starohan&rdquo; da upisujem fakultet.</p>
<p>Idem na preglede prostate, i na ljekarski za upis na fakultet ?! Budale&scaron;tina &hellip;</p>
<h2>Je li studiranje uop&scaron;te moguće ?</h2>
<p>Nakon dan-dva razmi&scaron;ljanja do&scaron;ao sam do faze: &ldquo;Ok, ali da li je to uop&scaron;te moguće izvesti ?&rdquo;.</p>
<p>Prvi je korak bio otići na ETF, i pronaći stari indeks. &lsquo;98 sam ga &ldquo;frljac'no&rdquo;. U kući ga nije bilo, a ni na fakultetu &hellip;</p>
<p>Garant je prilikom seobe firme  ostao u Zenici sa starim stvarima, a to je na kraju sve bačeno.</p>
<p>Na ETF-u su me uputili u Lukavicu, jer je tamo ostao moj dosije. I  tamo su mi na čistoj čirilici izdali potvrdu o položenim ispitima :)</p>
<p>To je dobro, ali ja ne mogu svaki dan ići na predavanja, a po Bolonji je tako.</p>
<p>Onda sam ja predložio da vidim onu Vi&scaron;u poslovnu &scaron;kolu na Ekonomiji,  jer je Dženana (op.aut ona je inače asistent na Filozofiji- odsj.  psihologija) tamo držala neka predavanja.</p>
<p>Hajde rekoh, vazda sam bio lo&scaron; menadžer, a dobar &scaron;ljaker. Možda tamo &scaron;tagod i naučim.</p>
<p>Međutim, Dženana se sjetila FIT-a. Pa ima i u Mostaru &ldquo;distance learning&rdquo;, za&scaron;to to ne pogleda&scaron; ?</p>
<p>Čuo sam ranije da raja masovno ide na FIT, ali mi je to lično bilo neinteresantno.</p>
<p>Nakon ETF-a ići na FIT. Sramota. Bez veze.</p>
<p>Ali, okolnosti su se promjenile.</p>
<h2>FIT-ovanje</h2>
<p>Ovaj put, za razliku od &lsquo;98, odgovor je ipak bio &ldquo;DA&rdquo;.</p>
<p>Nakon godinu dana, sve vi&scaron;e sam uvjeren da sam napravio dobru odluku.</p>
<p>Zato, jer me je <strong>moj babo zadužio da zavr&scaron;im ne jedan, nego tri fakulteta</strong>.</p>
<p>Iako sam ja njegov super-star, nadam se da će mu ipak biti dovoljan ovaj jedan :)</p>

</div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_1_godina, fit_mostar, moj_babo</div>
</div>
<div class='post_responses'>
<h4>837 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
