<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/07/rethink-software-development-rethink-u-bosni.html">Previous</a>
&nbsp; 
<a href="../../../index-15.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/06/pr1-polozen.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Odlazak na ispit, misli lete k'o uragan</h3>
<div class='post_info'>
<span class='post_time'>June 18 2010, 11:17 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'>

<p>Tri puta sam stajao jer sam mozak morao bukvalno prazniti. Da bih zapisao &scaron;ta mi &ldquo;plovi&rdquo; po glavi.</p>
<p>Rekoh, ako ne napi&scaron;em, odoh u hendek, ne mogu pratiti cestu.</p>
<p>Pred kraj puta sam prestao sa zaustavljanjem, Počeo sam pisati jednom  rukom naslijepo, a drugom držati volan. &Scaron;ta je mene spopalo čovječe &hellip;.</p>
<p><!--more--></p>
<h1>Bilje&scaron;ke</h1>
<p>Uglavnom su to bile teme za blogove:</p>
<p>1) Bajgorić i ekonomija:</p>
<ul>
<li> direktni i indirektni tro&scaron;kovi</li>
<li> tro&scaron;kovi, odlazak u Mostar</li>
<li> tro&scaron;kovi zalud utro&scaron;enog vremena</li>
<li> odgođeni tro&scaron;kovi &ndash; tro&scaron;kovi koji nastaju nakon &scaron;to student zavr&scaron;i fakultet &ndash; kao rezultat neznanja</li>
</ul>
<p>2) Sad se (biv&scaron;i) student če&scaron;e po glavi:</p>
<ul>
<li> Dženana je pomenula kako joj se biv&scaron;a studentica žalila kako je  bila u generaciji koja nije stekla potrebna znanja &hellip; i sad je to  neporavljivo kad se posao treba uraditi</li>
<li> kad ima&scaron; 20 godina, onda je čak fol' da položi&scaron; ispit prepisivanjem ili nekim drugim trikom. nije fol biti &scaron;treber</li>
<li> sigurno ni meni prije 20 godina, kad sam bio &ldquo;normalan&rdquo; student, ne  bi na kraj pameti bilo da o ovome pi&scaron;em. Ali danas kao roditelj, kao  radnik, kao poslodavac &hellip; Pogled na stvari je drugačiji. Skroz drugačiji</li>
</ul>
<p>3) To do: pitaj Lagumdžiju za Bajgorića. On se fura na nauku. Oprave il' deklarativno? :</p>
<ul>
<li> Ako te lagumdžija &ldquo;otrese&rdquo; ti mu reci: nemoj se Zlatko sa mnom zezati. Ja sam brko brkan.</li>
</ul>
<p>4) Priprema pisma upravi FIT-a: obezbjedite nam znanje. sklonite Bajgorića i Bajgorićeve knjige:</p>
<ul>
<li>ovo učiniti u formi bloga tako da se svi zainteresovani u to mogu uključiti</li>
<li>Poslati zahtjev inspekciji  za obrazovanje ? NE NE. To bi bio samo ulazak u jo&scaron; jedan bosanski činovnički tunel</li>
<li>Bitno je vidjeti da li postoje ikakvi &ldquo;senzori&rdquo; u upravi FIT-a.</li>
<li>Oni vole govoriti kako im je bitno. Kako slu&scaron;aju svoje studente (posebno DL-ovce koji im plaćaju)</li>
<li>Pa hajd' da vidimo kako reaguju na jednu ne tako uobičajenu, i ne tako lahko svarljivu temu</li>
</ul>
<p>5) Kritika, negativna evaluacija:</p>
<ul>
<li>kad se momak  hoće ostaviti curu on joj kaže ti si previ&scaron;e dobra za  mene &hellip; klasična ubleha koju je većina sa ove ili one strane doživjela  ili čula &hellip; i to je skroz normalno kad se radi o tinejdžerima, ali kad su  priče tog nivoa uobičajen kodeks pona&scaron;anja odraslih e to je problem &hellip; a  tako to hoda u bosni</li>
<li>nikoga nije briga. niko neće da se zahmeti da kaže: hej ba ne može to tako</li>
<li>jeste li ikada vidjeli da nečiju preporuku za posao gdje pi&scaron;e: ovaj čovjek to dobro radi, a to NE zna &hellip;</li>
<li>je li vas briga hoće li va&scaron;a &scaron;utnja, princip nezamjeranja nekoga zaviti u crno</li>
</ul>
<p>6) Kahva, tata, babo:</p>
<ul>
<li>bosanski, bo&scaron;njački</li>
<li>moj ideja prije 2' godina: latinica sa ekavicom</li>
<li>Osnovna &scaron;kola: Ljubica Mirković &ndash; ja i Natalija Vasiljević &ndash; mogu li ja pričati ekavski</li>
</ul>
<p>7) Za&scaron;to blogiram:</p>
<ul>
<li>jer mi misli lete ispred mene &ndash; moram ih nekako spustiti</li>
<li>ba&scaron; ovako je moj Bakir nedavno objasnio svoje ideje (električno ljepilo)</li>
</ul>
<p>8) Sa&scaron;a: Kad se ja vama naklapastim na kosti</p>
<p>9) Antisistem:</p>
<ul>
<li>ko si ti da kvari&scaron; moj (anti)sistem</li>
</ul>
<p>10) Činovnici, najbolji čuvari antisistema:</p>
<ul>
<li>al ne oni na &scaron;alterima &ndash; krajnji izvr&scaron;ioci nego &scaron;efovi i &scaron;efići &hellip; referenti za &ldquo;ono&rdquo; i dsz</li>
</ul>
<p>11) Narod 0 &ndash; biometrijski paso&scaron;i:</p>
<ul>
<li>Mimo &Scaron;ahinpa&scaron;ić OBN &ndash; Vox populi &ndash; nije to jarane Vox populi, nego Mimo Vox</li>
</ul>
<p>12) Čedo bijeli luk:</p>
<ul>
<li>za&scaron;to sam nepismen</li>
</ul>
<p>13) Proglas asistentima FIT-a:</p>
<ul>
<li>mislite svojom glavom, nemojte džoniti bajgoriće</li>
</ul>
<p>14) Ja i moja djeca, problem autoriteta:</p>
<ul>
<li>Samra &ndash; vi ste do&scaron;li u elitnu &scaron;kolu (II gimnazija) &hellip; ostala djeca  utrnula a samra &ndash; pa znam valjda gdje sam do&scaron;la &hellip; pokažite VI da sam  do&scaron;la u elitnu &scaron;kolu</li>
<li>Major Pudar na partijskom sastanku &ndash; mali jesi'l ti lud digni ruku kad svi drugi dignu!</li>
</ul>
<p>15) Ispitivanje, ocjenjivanje</p>
<ul>
<li>precizno pitanje</li>
<li>smisleno pitanje</li>
<li>ciljevi nastave određuju pitanja (sutradan za kahvom za Dž)</li>
<li>uključivanje u projekte: google code, kernel bug resolving</li>
</ul>
<p>16) Ocjena</p>
<ul>
<li>UPR ocjena</li>
<li>AKS ocjena</li>
<li>1+5=5, smije li se to</li>
</ul>
<p>17) email korespondencija</p>
<ul>
<li>(nekultura) reply: ok dobio/la sam email, javiću se kasnije, za 5 dana, za 10 dana, nikad</li>
<li>bitno je odgovoriti, pozitivno i negativno, a ne nekoga pomnožiti</li>
<li>neodgovaranje je isto &scaron;to i spu&scaron;tanje slu&scaron;alice kada te neko ne&scaron;to pita &hellip; to ljudi međutim rijetko čine</li>
</ul>
<p>Sedamnaest tema na relaciji Sarajevo-Mostar. Sva sreća pa nisam krenuo na more :)</p>
<p>Čovječe, morao bih uzeti mjesec dana off da ovo stavim na papir &hellip; Isto k'o da me struja drmnula.</p>

</div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_1_godina, fit_mostar</div>
</div>
<div class='post_responses'>
<h4>746 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>