<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/07/bosnian-business-telefonski-spam.html">Previous</a>
&nbsp; 
<a href="../../../index-15.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/07/rethink-software-development-rethink-u-bosni.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Šta trebamo učiti na tehničkim fakultetima</h3>
<div class='post_info'>
<span class='post_time'>June 15 2010, 11:31 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'>

<p>Razmi&scaron;ljao sam o tome kako da dam naslov ovome članku.</p>
<p>Prvo mi je palo na pamet: &ldquo;&Scaron;ta inžinjer treba znati ?&rdquo;, al' onda sam  se sjetio da ja nisam inžinjer pa kako da dijelim drugima savjete :)</p>
<p>Svoju ću priču ograničiti na tehničke fakultete, jer o drugim mogu bez potrebe &ldquo;lupetati&rdquo;.</p>
<h2>&Scaron;ta sam ja na fakultetu naučio ?</h2>
<p>Ja sam prije 20 godina studirao ETF. U te dvije i po godine  &scaron;kolovanja sam položio 20 ispita, i isto toliko je ostalo nepoloženo :(</p>
<h2>Zalud učenje kad si sve zaboravio</h2>
<p>Većinu gradiva koje sam učio sam jednostavno <strong>zaboravio</strong>.</p>
<p>Zasigurno nijedan zadatak iz &ldquo;Matematike I&rdquo; sad ne bih znao uraditi.</p>
<p>Za&scaron;to ? Zato jer to nisam ponavljao.</p>
<p>Pa za&scaron;to sam onda to učio ?! Je li to onda u mom slučaju (i slučaju 99% drugih studenata) bilo nepotrebno učiti !?</p>
<p>Nije.</p>
<p><!--more--></p>
<h2>Principi</h2>
<p>Matematika čovjeka uvodi u logički pristup rje&scaron;avanju problema.</p>
<p>Matematika nam pomaže da usvojimo vje&scaron;tine apstraktnog razmi&scaron;ljanja.</p>
<p>Ovaj isti princip vrijedi za sve predmete.</p>
<p><strong>&Scaron;kolovanje nas treba naučiti principima</strong>.</p>
<p>Ako tokom &scaron;kolovanja budemo trenirani da memori&scaron;emo, mi ćemo na kraju biti sposobniji &hellip; da zapamtimo nečiji broj telefona.</p>
<p>A to ba&scaron; i nije neka vje&scaron;tina.</p>
<h2>Brana Perunčić, Statistička teorija telekomunikacija (STT)</h2>
<p>Vratiću se na svoja iskustva sa fakulteta.</p>
<p>Jedan od predmeta koji je za mene bio bitan je definitivno STT.</p>
<p>Ne po tome &scaron;to se sjećam gradiva. Sve sam kao i na drugim predmetima zaboravio.</p>
<p>Ono čega se sjećam je ispiti kod profesorica. Brana je inače do&scaron;la iz  Amerike i ona je imala skroz drugi sistem ispita od drugih.</p>
<p>Ona je dozvoljavala, za razliku od drugih, <strong>da sve &scaron;to želimo donesemo na ispit</strong>.</p>
<p>Da da dragi moji.</p>
<p>Sveske, knjige, kalkulatore, &hellip; Brana je ukinula džonove &ndash; džonovi za  STT ti ne trebaju &ndash; jer je to kod nje jednostavno bilo dozvoljeno !</p>
<p>Sjećam se kako sam sa merakom taj ispit spremao.</p>
<p>Na ispit sam donio računar (laptop 80186 sa dva floppy-ja).</p>
<p>I na njemu more nekih programa za simboličku matematiku koja nam je za ispit trebala.</p>
<p>Na kraju se međutim nisam puno služio računarom. Tek toliko da provjerim rezultate.</p>
<p>Al' daleko od toga da mi to nije bilo od pomoći. Sama činjenica da  mogu napraviti kontrolu omogućila im je da se fokusiram na su&scaron;tinu  problema.</p>
<p>&Scaron;to se tiče sveski i knjiga, ni to mi nije plaho trebalo.</p>
<p>I njih sam koristio tek toliko da napravim provjere.</p>
<p>Zato jer sam se dobro spremio.</p>
<p>&ldquo;Branin sistem&rdquo; je bio genijalan.</p>
<p>Kod <strong>spremanja uop&scaron;te nisam tro&scaron;io mozak na memorisanje</strong>. Međutim, sve &scaron;to je <strong>bilo bitno</strong> sam, pokazalo se na ispitu, memorisao.</p>
<p>Ali ono &scaron;to je najbitnije, ja ovladao materijom. Ja sam kontao to &scaron;to pi&scaron;em.</p>
<p>Ja sam načio &scaron;to sam trebao. To je inžinjer. Onaj koji zna koju će knjigu otvoriti, jer zna <strong>principe problema</strong> koji treba da rije&scaron;i.</p>
<h2>A &scaron;ta je bilo kod Brane sa onima koji izađu na ispit nespremni ?</h2>
<p>To iz prve ruke ne znam, ali ovo je moj rezon:</p>
<ul>
<li>Brana nije dozvoljavala prepisivanje između nas nego <strong>samostalno</strong> kori&scaron;tenje literature i pomagala</li>
<li>Onaj ko je do&scaron;ao nespreman za ispit mogao je samo lupetati &ldquo;ko Martin po diviziji&rdquo;</li>
</ul>
<p>Naravno, kod različitih predmeta se mora uzeti različit pristup.</p>
<h2>Na &scaron;ta se svodi na kraju &ldquo;Branin princip&rdquo;</h2>
<p>Nisam siguran da li je to dio moje imaginacije ili ne, ali mislim da  je Brana (vezano za slobodu kori&scaron;tenja literature i svih potrebnih  pomagala rekla):</p>
<p>&ldquo;Kolege, vi ćete sutra biti inžinjeri. Vi ćete kod rje&scaron;avanja zadatak  normalno koristiti literaturu. Pa izvolite: koristite je odmah&rdquo;.</p>
<p>Branin princip je genijalan u tome &scaron;to je ona odmah stavila studente u  poziciju da rje&scaron;avaju probleme na isti način kako će to trebati raditi  kad zavr&scaron;e fakultet.</p>
<p>Brana nas je učila tome da postanemo inžinjeri.</p>

</div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, etf, obrazovanje, sistem</div>
</div>
<div class='post_responses'>
<h4>744 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<!--(bake includes/disqus.html)-->
</div>
</div>
</div>
</div>
</body>
</html>
