<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/hernad-the-dosadni-i-bosanska-administracija.html">Previous</a>
&nbsp; 
<a href="../../../index-12.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/trazimo-knjigovodu.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Blog post o meni</h3>
<div class='post_info'>
<span class='post_time'>December 21 2010,  1:19 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Ja sam poprilično komplikovan čovjek. Gledam svoju djecu. I ona su brate skroz komplikovana. &Scaron;to kod većine dijece "pali", kod njih "ne pali".</p>
<p>Ne mogu reći da mene moja djeca ne slu&scaron;aju. Ali ne mogu reći ni da mi je roditeljski pos'o sa njima, ovakvim kakvi jesu, jednostavan :).&nbsp;</p>
<p><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>Samra je babin "orkan"</strong></span></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong><div class='p_embed p_image_embed'>
<img src='../../../image/2010/12/18968761-samra_1.jpg'>
<img src='../../../image/2010/12/18940078-samra_2.jpg'>
<img src='../../../image/2010/12/18940113-samra_3.jpg'>
</div>
</strong></span>Samra je jedna energična djevojčica. Pardon, djevojka. Ona je tako usmjerena na svoja postignuća da nas sve to fascinira. Samra je borac. Veliki borac. Za razliku od mene, Samra je uvijek fokusirana na ciljeve koje pred sebe postavi. Ono &scaron;to Samru razlikuje od svojih vr&scaron;njaka je to &scaron;to je ONA ta koja svoje ciljeve postavlja, a ne mi. Samra neće biti informatičar ko babo, ili psiholog ko majka. Ako &scaron;ta od toga i bude, biće zato jer je ONA to odlučila. Samra je svoja.&nbsp;</p>
<p>Kada neka stvar ne ide prema njenoj zamisli, onda Samra napravi "code red" (ili ti po bosanski "frka te&scaron;ka") u čitavoj kući. Sve se mora podrediti tom njenom cilju ...</p>
<p>Svakim danom ja pred sobom gledam dijete koje, elahmdulillah, ide naprijed - u pravome smijeru. I to naprijed je <strong>njeno naprijed</strong>. To je plod <strong>njenog</strong> truda i zalaganja.&nbsp; Nakon skoka <a href="/babina-10-tka">"u zvijezde"</a> kojeg je napravila u ljeto, Samra je u srednju &scaron;kolu u&scaron;la "k'o orkan". Ja i Dženana smo ostali zaprepa&scaron;teni. <strong>Samra je babin orkan</strong>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Bakir je poseban</strong></span></p>
<p><div class='p_embed p_image_embed'>
<img src='../../../image/2010/12/18969270-bakir_nasl.jpg'>
<img src='../../../image/2010/12/18940173-bakir_3.jpg'>
<img src='../../../image/2010/12/18940163-bakir_2.jpg'>
<img src='../../../image/2010/12/18940186-bakir_4.jpg'>
<img src='../../../image/2010/12/18940156-bakir_1.jpg'>
<img src='../../../image/2010/12/18967693-bakirov_osmjeh.jpg'>
</div>
Bakir je poseban. Kod moga babe i majke on je unuk No1. I to oni ne kriju. Juče me jedna prijateljica, koja je kroz posao poznaje mog babu, pita:</p>
<blockquote class="posterous_short_quote">
<p>Je li Ernade ... &Scaron;ekib i Sabina (op.aut: moji roditelji) ... Je li oni tako pričaju o Bakiru i pred drugima ? Je li to zato &scaron;to je on prvo mu&scaron;ko unuče ?</p>
</blockquote>
<p>Rekao sam:</p>
<blockquote class="posterous_medium_quote">
<p>Vjerovala ili ne, pričaju. Oni pred svim svojim unucima kažu: Svi na jednu stranu, Bakir na drugu stranu. Sigurno ima i toga &scaron;to je on prvo mu&scaron;ko, ali vjeruj mi da to nije jedini razlog.</p>
</blockquote>
<p>Nakon toga, ženi sam ispričao priču o <a href="/bakir-i-dedo">"dedinom zadnjem rođendanu"</a>, i o <a href="/bakir-izumitelj">Bakirovim "izumima"</a>. Kada sam smo se razi&scaron;li, pade mi na pamet:</p>
<blockquote class="posterous_short_quote">
<p>Dobro ova žena sa nama izdura. Prvo je moj babo redovno "tu&scaron;i" sa Bakirom, evo je i ja maločas "utu&scaron;ih" sa svojom djecom ... malo za promjenu :(</p>
</blockquote>
<p>"A &scaron;ta ću joj ja ..." zavr&scaron;im tu raspravu sam sa sobom. Moj Bakir je poseban. On ima toplinu koju malo ko zna pokazati.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Bakir "ljutica"</strong></span></p>
<p>Bakir međutim zna biti i velika "ljutica". Njemu ne treba puno da mu se ko zamjeri. Ono će svakom "normalnom" djetetu "iz jednog uha ući, a na drugo odmah izaći" ... njemu ostane.</p>
<p>Evo jednog događaja od prije par dana.</p>
<p>Bakir je oti&scaron;ao kod tete Jasne, u piljaru preko puta, da kupi sebi slatki&scaron;a. Uzeo je iz svoje sehare(*) dvije marke. Kupio je neke slatki&scaron;e i vratio se kući sa 40 pfeninga. Ja sam mu tada rekao: Kupi babi novine, i reci teti Jasni ili Sabini(**), ako ti ne dotekne para: "Babo će sutra platiti".</p>
<p>Bakir ti je taj zadatak ozbiljno shvatio:</p>
<blockquote class="posterous_short_quote">
<p>Hoću li ja ponijeti papir, da zapi&scaron;em tačno koliko smo dužni ?</p>
</blockquote>
<p>Ja sam se osmijehuo. To je jedna od onih stvari koje su "Bakirova furka", i mi ga od takvih stvari ne odvraćamo. Zato sam mu odgovorio: "Ponesi i zapi&scaron;i koliko trebamo platiti".</p>
<p>On se vratio sa slatki&scaron;ima, ali nije donio novine. "Nema 'Avaza'" rekao mi je. "Pa idi uzmi 'Oslobođenje' - koje god imaju, bitan mi je samo TV program". Bakir je to prihvatio bez pogovora.</p>
<p>Nakon toga, vraća se kući vidno ljut. Ulazi u kuću "stupajući" ...&nbsp;&nbsp; "&Scaron;ta je sad bilo, dragi Allahu ?"&nbsp; pomislio sam. Pa ga upitam.</p>
<blockquote class="posterous_short_quote">
<p>Bakire, &scaron;to si ljut ?</p>
</blockquote>
<p>On nastavi:</p>
<blockquote class="posterous_short_quote">
<p>Ona će meni ... Ona će meni ... Ona će meni reći da sam "lago - lagavi" ...</p>
</blockquote>
<p>Ja uzvratih: "Ma ko bolan Bakire ?"</p>
<p>On jo&scaron; "že&scaron;ćim" tonom:</p>
<blockquote class="posterous_short_quote">
<p>Ma ona Sabina, "Sabinčura". Eto ko!</p>
</blockquote>
<p>&nbsp;"Čekaj malo dijete ... Za&scaron;to ti je to rekla ? ... Nisi ti to dobro shvatio možda ...", poku&scaron;avam da smirim njegovu ljutnju:</p>
<p>Kada sam do&scaron;ao po novine, ona me je naružila:</p>
<blockquote class="posterous_medium_quote">
<p>Za&scaron;to si potro&scaron;io pare &scaron;to ti je tata dao za novine na slatki&scaron;e ... A ja sam joj rekao da pare nisu bile za novine nego za slatki&scaron;e, i da su to moje pare! A ona mi je rekla da sam lago lagavi ...</p>
</blockquote>
<p>Uf ... gdje njemu draga Sabina tu priču "složi", pomislio sam. Skontao sam da je Sabina "preletila", ali sam Bakira tje&scaron;io: "Ma nije ona to tako mislila. To je ona tebi u &scaron;ali .."</p>
<p>Ali te stvari kod Bakira ne pale. On pamti ko slon. Ovo su njemu bitne stvari i džabe ti priča ... On nije "lago" i to je za njega veliki problem.</p>
<p>Sjetio sam se onda svojih <a href="/savjet-moga-babe">"senzora bitnosti"</a>, i pomislio sam.</p>
<blockquote class="posterous_medium_quote">
<p>Džaba ti Ernade, k'o &scaron;to ti ne može&scaron; da kaže&scaron; - ma nije bitno, ne može ni Bakir. To &scaron;to je on malo beba - malo dječak, očigledno ne igra veliku ulogu. Njegov senzor bitnosti se upalio i tu može&scaron; "pjevat' borbene".</p>
</blockquote>
<p>Sutradan sam oti&scaron;ao u piljaru da platim, pa sam rekao Sabini:</p>
<blockquote class="posterous_short_quote">
<p>Molim te Sabina, moj ti je Bakir "k'o prkno osjetljiv". Njemu ne može&scaron; te standardne dječije priče "slagati".</p>
</blockquote>
<p>Ona mi je prepričala sinoćnju priču ... pa pitala:</p>
<blockquote class="posterous_short_quote">
<p>Pa dobro, jesu li to stvarno bile njegove pare !?</p>
</blockquote>
<p>Odgovorio sam: "Jesu".</p>
<p>Moj Bakir je ni beba - ni dječak. Moj Bakir je poseban. I vazda je bio.</p>
<p>Na njegove senzore bitnosti sam ponosan, ali ih se istovremeno pribojavam. Zato &scaron;to znam po sebi da je često puno lak&scaron;e živjeti kada su ti ti senzori usagla&scaron;eni sa "normalnim svijetom".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Faruk, babin "ljepu&scaron;an",&nbsp; "lizga", "zolj"</strong></span></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong><div class='p_embed p_image_embed'>
<img src='../../../image/2010/12/18968969-faruk_naslov.jpg'>
<img src='../../../image/2010/12/18940237-faruk_2.jpg'>
<img src='../../../image/2010/12/18940246-faruk_3.jpg'>
<img src='../../../image/2010/12/18940252-faruk_4.jpg'>
<img src='../../../image/2010/12/18940283-faruk_5.jpg'>
</div>
</strong></span>Hehe .. .. Faruk je Dženanin "biber po pilavu". Faruk je "dinamit". Faruk je <a href="/faruk-zestok-momak">žestok momak</a>. Ja često kažem:</p>
<blockquote class="posterous_short_quote">
<p>Ovaj mi je naljep&scaron;i ...</p>
</blockquote>
<p>pokazujući na Faruka ...</p>
<blockquote class="posterous_short_quote">
<p>... a ovaj mi je najpametniji ...</p>
</blockquote>
<p>pokazujući na Bakira.</p>
<p>Da se razumijemo, moja Samra je ljepotica. Ali ona je žensko. Zato se, kada krenem sa gornjim komentarima, Samra jednostavno isključuje iz "konkurencije" :). I to svi znaju.</p>
<p>Faruk je nasvijetlije puti. Faruk je pun biljega. Jedan biljeg pored lijevog uha mu je tako izražen da nas svako malo pitaju:</p>
<blockquote class="posterous_short_quote">
<p>Kada se to Faruk udario ?</p>
</blockquote>
<p>Međutim, meni su ba&scaron; ti biljezi jedan od razloga da je Faruk babinim "ljepu&scaron;an".</p>
<p>Preuveličavam ? Pa &scaron;ta od babe očekujete ?! Vi to isto za svoju djecu govorite, ali se ne usudite reći. Ja samo to &scaron;to mislim kažem otvoreno. Ja sam hernad.</p>
<p>Ali pustimo se Farukove ljepote. Faruk je "zolj". Iako je Bakir od njega za "tri glave veći" i jo&scaron; vi&scaron;e krupniji ... u "bratskim okr&scaron;ajima" uvijek je Faruk onaj koji ima inicijativu - onaj koji napada. Rezultati tih Farukovih napada su nažalost vidljivi i na inventaru kuće: na usisivačima, fenovima, suđu ponajvi&scaron;e.</p>
<p>Faruk, kada je ljut, bez ikakvih problema uzme neku toljagu i počne mahati prema "neprijatelju". Znanom ili neznanom - svejedno. Zato ga non-stop moramo držati na oku. A to razbijanje suđa ... to je stvarno "kolosalno" ... Uzme tanjir ... gleda mater u oči i ... fljaasss ... ode tanjir u milion paramparčadi.</p>
<p>Faruk je dobio najvi&scaron;e degeneka od matere i babe(***) ... Sa svoje dvije godine on je već sada "van konkurencije".</p>
<p>Faruk je u zadnjih mjesec dana propričao. I kao većina stvari kod Faruka - on po tom pitanju, mashallah, velikom brzinom napreduje.</p>
<p>Pro&scaron;le hefte je Dženana bila u Njemačkoj. Faruk je bio kod dide i majke u Zenici. Kada me je ugledao u hodniku obradovao se na njemu svojstven način.</p>
<p>Uzvikne "Tatooo! ... (po makedonski)", pa se nasmije se i umiri. Pa onda sklopi oči toliko da su mu skoro sklopljene, ko fol' spava ... Dragi Allahu, pa ima li i&scaron;ta ljep&scaron;e na dunjaluku od zagrljalja svog djeteta ? Ja ne znam niza&scaron;ta &scaron;to se sa tim može poredit'.</p>
<p>On je pravo treće dijete. Zna se boriti za svoje mjesto. Faruk je čas najveća "lizga", čas najveći "zolj". Faruk je poseban.</p>
<p><span style="text-decoration: underline;"><strong>Moja djeca</strong></span></p>
<p><span style="text-decoration: underline;"><strong><div class='p_embed p_image_embed'>
<img src='../../../image/2010/12/18969438-samra_faruk_bakir_1.JPG'>
<img src='../../../image/2010/12/18940323-samra_faruk_bakir.JPG'>
</div>
</strong></span>Samra me zna upitati, najče&scaron;će kada neko blizak preseli na onaj drugi svijet:</p>
<blockquote class="posterous_short_quote">
<p>Tata, plače&scaron; li ti ikada ?</p>
</blockquote>
<p>Ja joj na to pitanje odgovorim:&nbsp; "Pa ne znam ... plačem, ali valjda ne često ... pa me ti ne vidi&scaron;"</p>
<p>Da me sada pita, rekao bih joj:</p>
<blockquote class="posterous_short_quote">
<p>Evo sine, plačem sada. Od dragosti.</p>
</blockquote>
<p>Moja su djeca posebna. Moja djeca su moj ponos, moje remek djelo.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>"Žiku" naslova ?</strong></span></p>
<p>Čekaj malo ... pa o čemu sam ja uop&scaron;te počeo pisati ... Ajoj ... O tome kako je moj prijatelj iz Zenice napisao članak o meni <a href="http://politbiro.blogger.ba/arhiva/2010/12/20/2649455">"Imam druga ..."</a>.</p>
<p>E sada, čisto sumnjam da je ko stig'o do ovih redova, jer sam ljude "utu&scaron;io" o svojoj djeci.</p>
<p>Ali ako jeste, želim da kažem da je ba&scaron; lijepo kada čuje&scaron; da neko cijeni tvoj rad i tvoja nastojanja.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Dova</strong></span></p>
<blockquote class="posterous_medium_quote">
<p>Gospodaru moj, podaj mojoj djeci zdravlje i dug zeman.</p>
<p>Podaj da budu korisni i priznati u ummetu, da imaju sretan i sadržajan život.</p>
<p>Podaj da žive i umru ko pravi muslimani.</p>
<p>Podaj da im mi kao roditelji budemo dobar uzor.</p>
<p>Gospodaru moj, budi na pomoći meni i mojoj porodici. Podaj da svojim djelima zaradimo Tvoj rahmet na Danu konačnog polaganja računa.</p>
<p>Moj Bože, hvala Ti na svom bereketu koji spu&scaron;ta&scaron; na mene i moju porodicu u izobilju i bez računa.</p>
</blockquote>
<p>Amin.</p>
<p>---</p>
<p>(*) &Scaron;to mu ostane od bajramluka i sl.</p>
<p>(**) Sabina je kćerka tete Jasne koja uveče pomogne u piljari</p>
<p>(***) Nadam se da ovo neće moji babo i mater pročitati ... oni se plaho zamjere kad im na unučad digne&scaron; glas, a ne kamo li ruku</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dova, dunjaluk, h_bakir, h_faruk, h_samra</div>
</div>
<div class='post_responses'>
<h4>3965 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
