<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/tako-to-mora-biti-mora-li.html">Previous</a>
&nbsp; 
<a href="../../../index-12.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/bringout-marketing.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Danas sam pravo happy</h3>
<div class='post_info'>
<span class='post_time'>December 17 2010,  7:10 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Ujutro sam od vrlo bitnog klijenta dobio podr&scaron;ku za <a href="http://redmine.bring.out.ba/projects/knowhow/wiki">knowhow</a>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Pismo mojoj hanumi</strong></span></p>
<p>Zadovoljan tom informacijom, poslao sam Dženani(*) mail:</p>
<blockquote>
<p><span style="text-decoration: underline;">Subject:&nbsp;<strong>blog super-star</strong></span></p>
<p><span style="text-decoration: underline;"><!--more--></span>Selam alejkum draga moja hanumo,&nbsp; znam da te prepadam svako malo sa novim <a href="/teska-poslovna-odluka">informacijama iz firme</a>. Biće fiskalizacije, pa neće biti fiskalizacije ...<p />Međutim, već sada se pokazuje da  sam napravio ispravnu odluku. Vratio sam se na knowhow i to,  elhamdulillah, ide kako treba.<p />Pride, post'o sam ti pravi blog  super-star :).&nbsp; Na osnovu komentara koje sam dobio tom publicitetu, po svemu sudeći, doprinijelo je i obljavljivanje jedne takve poslovne odluke. <p />Ispred  svih &scaron;ema stavio sam struku i svoj profesionalni sud,  integritet&nbsp; firme -&nbsp; koncept otvorenosti,&nbsp; interese svojih klijenta.</p>
<p>Moja odluka je tako pozitivno uticalo na klimu u firmi, da je to nevjerovatno.<p />Iako  smo "Čagu"(**) i par zeničkih klijenata usmjerili na drugog  provajdera fiskalnih uređaja (one Hercegovce),&nbsp; "Čago" je prihvatio  ponudu&nbsp; za računare i na&scaron;a POS rje&scaron;enja, &scaron;to je zna&scaron; i sama zna&scaron;,&nbsp; ipak na&scaron;  glavni posao :)</p>
<p>Jutros sam od "Vindije"(***) dobio informaciju, da u  novu godinu idu sa nama. Da prate knowhow, ali da se njima  ne žuri - "guraćemo" postojeća rje&scaron;enja dok se knowhow dovoljno ne "iste&scaron;e". Za nas je to idealan odgovor :)<p />"Kockice" se sklapaju. Priča&scaron; sa <a href="/bringout-marketing">pionirom otvorenog biznisa</a> - hernadom :) Para jo&scaron; nema, al' biće aBd, strpi se. Kad' si mogla 15 godina, može&scaron; jo&scaron; koju.<p />Eto  draga moja hanumo, sada ima&scaron; konkurenciju.&nbsp; Neće vi&scaron;e samo meni ljudi u  džamiji, kada te vide na televiziji, govoriti: <em><strong>"Vidjeli smo ti ženu Ernade,  pametno brate zbori"</strong></em>.<p />Sada će neko reći i ovo:&nbsp; <em><strong>"Hej, eno hernadove žene na TV-u !"</strong></em><p />Dragi Allahu, hvala Ti &scaron;to si svom robu usli&scaron;o dove. &Scaron;to si providio i olak&scaron;ao moje poslove i odluke. Samo si Ti kadra sve!<br />Amin</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Božićnice bring.out</strong></span></p>
<p>Moji(****) su danas bili u Sarajevu. Kada su u&scaron;li rekao sam im:</p>
<blockquote class="posterous_short_quote">
<p>Danas sam pravo raspoložen !</p>
</blockquote>
<p>Sa&scaron;a je odmah u svom stilu uzvratio:</p>
<blockquote class="posterous_short_quote">
<p>Pa, kad si tako raspoložen, hoćel' bit' para :) ?</p>
</blockquote>
<p>To je na&scaron;a standardna &scaron;ema. Odgovorio sam: "Pa dobro sad momci ... nemojmo sad pretjerivati, nisam ba&scaron; toliko raspoložen".</p>
<p>Oni su se pripremali za terene, a ja sam vi&scaron;e "&scaron;upljirao" nego li sam &scaron;ta konkretno radio ... Brzo je do&scaron;la i džuma.</p>
<p>Kad sam se vratio sa džume, rekao sam, sebi: "Hajde da ih iznenadim ... Od mog lijepog raspoloženja fakat ljudi nemaju hajra ..."</p>
<p>Kako to u bring.out hoda - slijedi redmine ticket. Otvorio sam ticket #21943, sa naslovom: "božićnice bring.out" sa sljedećim sadržajem:</p>
<blockquote>
<p>Da mi je neko rekao da ću dijeliti božićnice, ja bih mu se slatko nasmijao. Ali tako ispade.</p>
<p>Pa neka budu božićnice, ili post-bajramnice sigurno vam nije previ&scaron;e bitno.</p>
<p>Iako mi nikakva poslovna računica ne daje osnova da radimo bilo kakve isplate osim nužnih, imam "feeling" da to trebam učiniti ...</p>
<p>..</p>
<p>nadam se da će nam ovo dodatno "puhnuti u jedra" pozitivnim procesima koji se, elhamdulillah, nakon objave knowhow de&scaron;avaju</p>
<p>Zavr&scaron;io sam ticket, pričajući sam sa sobom: "<a href="/bosanski-nacionalista">Bosanski nacionalista</a> dijelio božičnice ... ccc e jesam freak definitivno ..."</p>
</blockquote>
<p>Isplaćeni iznosi definitivno nisu takvi da bi ih neko prokomentarisao kao: "hernad poslodavac godine", ali mislim da su ispali dobar fol'.</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>hernade, e ti ga sad ba&scaron; pretjera ...</strong></span></span></p>
<p>Za&scaron;to sve ovo govorim javno?</p>
<p>Marketing? Sigurno da ima i toga. Ali za&scaron;to ne napisati jednostavno ZATO - zato &scaron;to sam danas pravo happy :).&nbsp; Pa ovo je, majka mu stara, moj blog zar ne&nbsp; ?!</p>
<p>---</p>
<p>(*) Dženana je ovu heftu na studijskom putovanju u Njemačkoj, Mannheim. Opravdano joj je jer se na vrijeme na&nbsp; <a href="/stastika-ovo-mi-se-nista-ne-svida-prasologija">ovom blogu na vrijeme</a> najavila :). Oti&scaron;la je na stručno usavr&scaron;avanje iz strukturalnog  modeliranja za kros-kulturalne uzorke. Ma znate kolege sa FIT-a - to je  ono "kros" / "uzorci" / "statistika". To se kod nas na FIT-u radi na  pauzi između vježbi. Dženana Dženana ... a ti po Njemačkoj bez potrebe  hoda&scaron; ...</p>
<p>(**) Na&scaron; klijent, firma "Čago-komerc doo" Zenica</p>
<p>(***) Na&scaron; klijent, "Vindija BH doo" Sarajevo</p>
<p>(***) Moje radne kolege - super-serviseri bjasko i vsasa</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, muž</div>
</div>
<div class='post_responses'>
<h4>2212 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
