<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/bosanski-nacionalista.html">Previous</a>
&nbsp; 
<a href="../../../index-14.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/11/programiranje-2-vjezbe-nepismeno2.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Dopisi državnim institucijama</h3>
<div class='post_info'>
<span class='post_time'>December  1 2010,  1:43 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Bosanska administracija je krajnje interesantan fenomen.</p>
<p>Mi smo primjer dru&scaron;tva u kome su se mnoge stvari stvari izvrnule skroz naopako.</p>
<p>Većina radnika u na&scaron;em administrativnom aparatu uop&scaron;te ne zna da je ovo <strong>normalan poredak stvari</strong>: oni su davaoci usluga - servis građana.</p>
<p>Za&scaron;to je to tako ? Jednostavno: <strong>može im se</strong>.</p>
<p>Svako je to na svojoj koži osjetio ovako ili&nbsp; onako. I kako reagujemo na tu pojavu: "poklopimo se u&scaron;ima" i nastojimo kako tako <strong>svoj problem</strong> rije&scaron;iti.</p>
<p>To &scaron;to će se taj problem ponoviti hiljadama drugih, nije bitno. Kad mogu ja pretrpiti, mogu i drugi.</p>
<p>E, ja nisam standardni bosanski građanin. Ja sam ludak. Ja sam "emailoman" i "dopisoman".</p>
<p><!--more-->U mnogim institucijama i firmama sam poznat kao: <strong>onaj čudni tip &scaron;to pi&scaron;e email-ove i dopise</strong>.</p>
<p>Ovom prilikom ću neke od tih dokumenata publikovati.</p>
<p>Tu se pominju i imena nekih državnih službenika. Za&scaron;to onda ovo postiram ? Ru&scaron;im privatnost ? Želim da ponižavam ljude ?</p>
<p><strong><span style="font-size: medium;">Lekcija No 1: rad u državnoj upravi je JAVNA FUNKCIJA. ZAPAMTITE TO državni službenici. Te fotelje nisu va&scaron;a privatna "prčija".</span></strong></p>
<p>Vi se redovno &scaron;egate kako je narod glup i ne zna popuniti formulare. A vi ? &Scaron;ta je sa vama ?</p>
<p>hernad vam kaže:</p>
<blockquote class="posterous_medium_quote">
<p>Većina na&scaron;ih službenika i organizacija uop&scaron;te ne posjeduje vje&scaron;tinu pisane komunikacije. A to bi trebao biti preduslov za većinu radnih mjesta u toj oblasti. Ali u Bosni je sve moguće.</p>
</blockquote>
<p>No osnovu čega ovo kažem ?</p>
<p>Na osnovu toga, &scaron;to sam na većinu svojih upita dobijao:</p>
<ol>
<li>muk - ignorisanje - no answer</li>
<li>javi mi se neko na telefon i ofirno se izvinjava ili obja&scaron;njava kako to tako mora ... kako "sistem" tako funkcioni&scaron;e</li>
</ol>
<p>hernad jeste usamljeni ludak.</p>
<p>I vjerovatno će se tek poneki internet posjetilac ovo vidjeti kao &scaron;aljive tekstove. Međutim ovo je bosanska zbilja. Ove budale&scaron;tine i maltretiranja od strane državnih službenika svaki bosanac danas će osjetiti ko zna koliko puta.</p>
<p>To vam ne smeta? Ni&scaron;ta se tu ne može učiniti? Pa dobro: <a href="/bosna-glup-lud-il-bahat">ja sam lud, a vi glupi</a>.</p>
<p><span style="text-decoration: underline;"><strong>PIO dopisi 2009</strong></span></p>
<p>Kada je firma 2009 radila preregistraciju, naletila je na klasični  administrativni bosanski zid. A taj zid ... to je ne&scaron;to najbolje u Bosni  napravljeno.  Iako PIO nije jedini slučaj institucije od koje može&scaron; dobiti čir na  želucu, jedan je od dobrih primjera.</p>
<p><a href="http://www.scribd.com/document_collections/2744435">http://www.scribd.com/document_collections/2744435</a></p>
<p><span style="text-decoration: underline;"><strong>Sravnjenje poreznih kartica 2009-danas</strong></span></p>
<p>Evo i ne&scaron;to &scaron;to je jo&scaron; u toku:</p>
<p><a href="http://www.scribd.com/document_collections/2744444">http://www.scribd.com/document_collections/2744444</a></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ti si lud čovječe, "nemoj se sa rogatim bosti"<br /></strong></span></p>
<p>Klasična reakcija na ovakav stav je:</p>
<blockquote class="posterous_medium_quote">
<p>Ma sve je to &scaron;to ti priča&scaron; u redu, ali stvari se ne mogu promijeniti. Dodatno, ako frku napravi&scaron;, ne može&scaron; zavr&scaron;iti posao koji si krenuo. Uvijek ti država može staviti inspekciju na vrat, vratiti ti na ovaj ili onaj način."</p>
</blockquote>
<p>Pa neka. Vi vidite sistem kao vlast, a ja vidim kao nekoga ko meni treba pomoći. Ja i ostali građani te državne budžete punimo, i te službenike hranimo. Zato tražim da me se po&scaron;tuje, i &scaron;to je najbolje, da mi se tamo gdje je to moguće pomogne !</p>
<p>U mom poslu to je sasvim normalnan zahtjev davaoc &lt;-&gt; korisnik usluga, za&scaron;to bi državna uprava bila izuzetak !?</p>
<p>Ja sam lud, a vi glupi.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>administracija, bosna, sistem</div>
</div>
<div class='post_responses'>
<h4>Pregleda 1051, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
