<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/kontekst.html">Previous</a>
&nbsp; 
<a href="../../../index-13.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/hello-world.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Emir i Berin, drugi dio</h3>
<div class='post_info'>
<span class='post_time'>December  7 2010,  1:10 PM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Mislim da sam sa svojim blogom ipak ne&scaron;to konkretno postigao. Kako ? <p /><a href="/emir-i-berin">Emir i Berin</a> su čitali moje članke. Pa &scaron;ta sa tim ? Evo objasniću ba - strpi se malo ...</p>
<p>Po povratku sa ispita sa statistike, krenula je opu&scaron;tena priča ... Emir:</p>
<blockquote class="posterous_short_quote">
<p>Ja čovječe &scaron;to onaj Pra&scaron;o voli Excel. Nije da meni nije dobar Excel, ali brate' ... on izgleda sa njim sve rje&scaron;ava.</p>
</blockquote>
<p>Ernad:</p>
<blockquote class="posterous_medium_quote">
<p>Ja ... Excel je čudo. Sa Excelom se ljudi mogu liječiti. K'o Torabi(*). S tim &scaron;to Torabi puca tu energiju, a Pra&scaron;o to radi "via excel". Berine, kupiću ja tebi Excel. Da brate "otčepi&scaron;" taj OEK(**). Kupiću ti duplu dozu: Microsoft Professionall 2010 Premium - superstar. Najnoviji model. Ma ti će&scaron; sa tim k'o raketa proći komplet gradivo.</p>
</blockquote>
<p>Berin:</p>
<blockquote class="posterous_short_quote">
<p>Da da ... 30 grama svako jutro, i nema zime.</p>
</blockquote>
<p><!--more-->Smijeh ... Ubrzo odosmo na ozbiljnije priče. Emir:</p>
<blockquote class="posterous_medium_quote">
<p>Interesanto je kako ti stvar drugačije gleda&scaron;. Čitao sam tvoje blogove. To &scaron;to pi&scaron;e&scaron;, vezano za fakultet, to stvarno jeste tako. Ali ja nikada nisam na takvav način razmi&scaron;ljao.</p>
</blockquote>
<p>Ernad:</p>
<blockquote class="posterous_medium_quote">
<p>Pa naravno. A i za&scaron;to bi. Ti stvari ne može&scaron; tako posmatrati. Fali ti +20 godina, +3 djece, +15 godina radnog iskustva. Zato se na&scaron; pogled na stvari bitno razlikuje. Da se ne razlikuje, garant bi se moja žena prva zabrinula :)</p>
</blockquote>
<p>E sada je već Emir otvorio temu oko kojje ja povazdan mogu "drviti":</p>
<blockquote>
<p>Ono &scaron;to ja želim, jeste da VI vrijeme otvorite pitanja: Za&scaron;to idem na fakultet ? &Scaron;ta je cilj ? &Scaron;ta time dobijam, a &scaron;ta ipak ne !? Ako budete gajili iluziju da znate ono &scaron;to ne znate, da vrijedite vi&scaron;e nego &scaron;to vrijedite - imate veliki problem.</p>
<p>Evo danas:&nbsp; Mi smo drage moje kolege <strong>prodangubili</strong> dan. I sve dane za pripremu ovog ispita.</p>
<p>Prodangubili smo dan sa stanovi&scaron;ta znanja.</p>
<p>Prodangubili smo dan zato jer se ovaj na&scaron; trud, bez obzira položili ovaj ispit ili ne, nećemo adekvatno valorizirati.</p>
<p><span style="text-decoration: underline;"><strong>Bićemo korak bliže diplomi, al' zar nismo pride mogli dobiti i ne&scaron;to znanja !?</strong></span></p>
<p>Ako vam koji slučajem osnove statistike budu trebale za posao, <a href="/koncept-predmeta-statistika-i-vjerovatnoca-na">imate problem</a>.</p>
<p>Ali, kako god bilo - bolje je da to sada znate, nego da vas to zatekne kad budete tražili posao.</p>
<p>Energija se tro&scaron;i. Vrijeme nepovratno teče. Dana&scaron;nji dan se ne može vratiti.</p>
</blockquote>
<p>----</p>
<p>(*) Marokanski iscjelitelj koji je predhodnih par mjeseci bio u sarajevskoj Zetri</p>
<p>(**) OEK - Predmet "Osnove eknonomije"</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar</div>
</div>
<div class='post_responses'>
<h4>Pregleda 1576, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
