<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/da-li-kolege-nastavnici-na-fit-u-znaju-sta-zn.html">Previous</a>
&nbsp; 
<a href="../../../index-14.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/statistika-prvi-cas-sa-profesoricom-dzenanom.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Gorka istina</h3>
<div class='post_info'>
<span class='post_time'>December  3 2010,  3:59 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Malezijska džamija, džuma, 27.zul-l-hidždže 1431 hdž.g., hutbu vodio imam ef. hdž. Elvedin Klisura.</p>
<p><span style="text-decoration: underline;"><strong>1432 Hdž </strong></span></p>
<p>01. muharrem 1432 nastupa aBd u ponedjeljak (06.12.2010 po gregorijanskom kalendaru)&nbsp; iza ak&scaron;am namaza.</p>
<p><span style="text-decoration: underline;"><strong>Gorka istina</strong></span></p>
<p>Tokom hutbe imam je pomenuo da unutar jednog hadisa(*) postoji dio u kome Allah dž.&scaron;. kaže Poslaniku s.a.v.s.:</p>
<blockquote class="posterous_short_quote">
<p>Muhammede, reci im istinu, pa makar ona i gorka bila.</p>
</blockquote>
<p>I ja se sjetim jučera&scaron;njeg razgovora sa svojim ratnim drugom, dragim prijateljem i bratom muslimanom Almirom.</p>
<p><!--more-->Kaže meni Almir sinoć:</p>
<blockquote>
<p>Brate, previ&scaron;e "lijepi&scaron;" onog <a href="/tag/antiznanje">Bajgorića</a>. To &scaron;to ti govori&scaron; jeste istina, al' daj budi malo milostiv.</p>
</blockquote>
<p>Moj Almir je jedan poseban čovijek. Znam ga od '92-'93 godine. I uop&scaron;te se ne mogu sjetiti situacije da je on ikada podigao glas.</p>
<p>Takvo mille(**), pa eto ti. Ja sam opet "vatra".&nbsp; Kada pričam o nečemu &scaron;to smatram bitnim, nerijetko se počnem - derati. Da, ružna osobina, i nastojim je kontrolisati. Al' da mi izmakne kontroli - izmakne.</p>
<p>I u pisanom izražavanju se taj temperament osjeti. Često su moje riječi ko "sablja", posebno kada izražavam nezadovoljstvo.</p>
<p>Znači, po tom pitanju smo Almir i ja skroz različiti.</p>
<p>Sinoć sam sa Almirom o tome dosta pričao, ali bih tome dodao moju interpretaciju ovog hadisa:</p>
<blockquote>
<p>Brate moj, Allah mi je svjedok da to &scaron;to pi&scaron;em - pi&scaron;em zato jer smatram da je ono za &scaron;to se zalažem ispravno - istina, i da su ovo stvari bitne za ovo <a href="/tag/bosna">dru&scaron;tvo</a>, moju i tvoju djecu.</p>
<p>Za razliku od Poslanika s.a.v.s., koji je znao da je Objava - Istina,&nbsp; ja krajnji sud o tome &scaron;to govorim - ne mogu dati.</p>
<p>Za dunjalučke stvari krajnji sud, to dobro znamo, ne postoji. Međutim, nastojanje da se djeluje dobro, borba za bolje, jeste na&scaron;a obaveza.</p>
<p>Ja i ti se borimo različitim metodama. Jer smo različiti. Nekada je moja metoda bolja - jer je u mnogim situacijama neophodna. Nekada je tvoja metoda bolja jer minimizira tenzije i negativne reakcije.</p>
<p>Meni, a siguran sam i tebi, je najbitnije da na&scaron;oj djeci iza sebe ostavimo &scaron;to bolje možemo. I da im svojim primjerom obajsnimo &scaron;ta je dobro, a &scaron;ta lo&scaron;e. &Scaron;ta je istina, a &scaron;ta neistina. &Scaron;ta je znanje, a &scaron;ta <a href="/tag/antiznanje">antiznanje</a>.</p>
<p>Ja ću brate i dalje "lijepiti" one <strong>ljude</strong> i one <strong>pojave</strong> koji, po mom sudu, to bolje sutra onemogućavaju. &nbsp;&nbsp;</p>
</blockquote>
<p><span style="text-decoration: underline;"><strong>Dova</strong></span></p>
<p>U jednom ranijem članku napisao sam <a href="/politicke-price">dovu</a>, koju i ovom prilikom činim:</p>
<blockquote class="posterous_medium_quote">
<p>Gospodaru moj, podaj da se rije&scaron;imo bahatih, nesposobnih i nepravednih prvaka.</p>
<p>Podaj da naučimo razlučivati &scaron;ta su prave vrijednosti, i kako se boriti za njih.</p>
<p>Podaj da Bosnom zavladaju oni koji će misliti i na moju, a ne samo na sebe i svoju djecu.</p>
</blockquote>
<p>Amin.</p>
<p>---</p>
<p>(*) hadis je (vjerodostojni - potvrđeni) događaj iz prakse posljednjeg božijeg Poslanika s.a.v.s.</p>
<p>(**) mille - narav, ćud</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>antiznanje, bosna, dova, dzuma, islam</div>
</div>
<div class='post_responses'>
<h4>1384 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
