<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/trazimo-knjigovodu.html">Previous</a>
&nbsp; 
<a href="../../../index-12.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/tako-to-mora-biti-mora-li.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>hernad "čačka mečku", eto mu ga sada ...</h3>
<div class='post_info'>
<span class='post_time'>December 18 2010,  4:35 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Nakon &scaron;to sam u kući napisao članak <a href="/tako-to-mora-biti-mora-li">"Tako to mora biti ..."</a>, krenuo sam u kancelariju.</p>
<p>U po&scaron;tanskom sandučiću sam zatekao plavu kovertu. Ko li mi ovo pi&scaron;e ? Da me nije policija "uslikala" radi brze vožnje ? Da me nije neko radi blogiranja tužio ?</p>
<p><!--more--></p>
<p>Ni&scaron;ta od toga. Dobio sam dopis od Porezne uprave Federacije, ispostava Zenica:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>odgovor_porezna_uprava_zenica.pdf</strong>
<a href="../../../file/2010/12/4685537-odgovor_porezna_uprava_zenica.pdf">View this file</a>
</div>
</div>
&Scaron;ta je ovo ? Nakon &scaron;to sam postao <a href="/danas-sam-pravo-happy">bloger-superstar</a>, postao sam i telepata ?! Samo &scaron;to sam napisao članak posvećen Poreznoj upravi, odmah nakon toga od njih dobijam dopis!</p>
<p>Ali vratimo se na dopis. O kakvom zahtjevu za povrat sredstava ovi uop&scaron;te govore? Nikakav mi povrat novca nismo tražili !?</p>
<p>I onda mi "upali". Radi se o onim dopisima Poreznoj upravi - ispostavi Zenica, gdje nas oni terete za nekih 360 KM. Kada smo mi ispitali, utvrdili smo da smo uplatu izvr&scaron;ili, ali da ta uplata radi pogre&scaron;ne doznake nije nikada registrovana. Na tu temu postoji set dopisa koje sam objavio u članku <a href="/dopisi-drzavnim-institucijama">"Dopisi državnim institucijama"</a>.</p>
<p>Zadnji od tih dopisa je bio posvećen gdji Dragani:</p>
<p><a href="http://www.scribd.com/doc/44451969/Dopis-Porezna-Uprava-Zenica-3">http://www.scribd.com/doc/44451969/Dopis-Porezna-Uprava-Zenica-3</a>?</p>
<p>He he he ... Na moj dopis od tri stranice, gdje ja "kukama i motikama" udaram po njihovom tretmanu klijenta,&nbsp; oni mi "mrtvi-hladni" odgovaraju jednim "konfekcijskim" dopisom. Zato sam jedva mogao skontati o čemu likovi uop&scaron;te pričaju. Nisu udostojili staviti ni vezu na na&scaron;e dokumente, pa da skontam o čemu se radi ... A o komentaru na ono &scaron;to sam napisao - to bi veći bila naučna fantastika. Koja bahatost ... Ko tro&scaron;i pare poreznih obveznika čovječe.</p>
<p><strong><span style="font-size: medium; color: #ff0000;">Za jednu prosto-pro&scaron;irenu rečenicu trebala im je godina i po ... Da stvar bude jo&scaron; gora, ni&scaron;ta, ama ba&scaron; ni&scaron;ta na kraju nisu uradili - samo su papire proslijedili drugima ... SRAMOTA. </span></strong></p>
<p>U pasusu <a href="/dopisi-drzavnim-institucijama">"Ti si lud čovječe, nemoj se sa rogatim bosti", članka "Dopisi državnim institucijama"</a>, ja predviđam da ovakvo "talasanje" redovno vodi ka inspekcijama i kontrolama. Ovi iz Zenice mi praktično najavljuju kontrolu - oni su prebacili predmet Poreznoj ispostavi Centar(*).</p>
<p>Ne, nije ovo nikakva zavjera. Ovo je bezvezan činovnički proces, koji će na kraju zavr&scaron;iti inspekcijom. I u tome nije neki problem. Nek' gledaju.</p>
<p>Ono &scaron;to je meni puno interesantnije jeste to da sam ja u zadnjem dopisu:</p>
<ol>
<li>vrisn'o na bezobrazluk službenice koja mi praktično zabranjuje da im se obraćamo</li>
<li>ukazao da je nebulozno da&nbsp; je sravnjenje pogre&scaron;ne uplate porezne kartice, smije&scaron;nog iznosa od 360 KM, bude "slučaj"</li>
<li>ukazao da taj "slučaj", kad ga su ga oni već tako kod sebe smjestili, stoji od 04/2009</li>
</ol>
<p>I &scaron;ta? Ni&scaron;ta. Ernade, čekaj inspekciju, pa će ti oni pretresti knjige, pa će te gnjaviti k'o žvaku ... pa će&scaron; valjda jednom naučiti:</p>
<blockquote class="posterous_short_quote">
<p>Da ne valja "čačkat' mečku", da se ne može&scaron; sa "rogatim bosti"</p>
</blockquote>
<p>A sve si to mogao zav&scaron;iti da si se umilnim i poniznim "glasićem" obratio gdji Dragani:</p>
<blockquote class="posterous_medium_quote">
<p>Gdjo Dragana, znam da imate naporan dan, znam da Vam je život težak, znam da ste gladni ... pa smo Vam kupili jednu porciju janjetine sa kapljevionom ... pa kada Vas snaga sa tom janjenitom obuzme ... možete li, molim Vas, molim Vas, molim Vas ... odvojiti malo vremena za "na&scaron; slučaj"</p>
</blockquote>
<p><span style="font-size: medium;"><strong><span style="color: #ff0000;">Da, to bi bilo najpametnije ... Tako se to radi. Tako se poslovi zavr&scaron;avaju.</span></strong></span></p>
<blockquote class="posterous_short_quote">
<p>MA SIKTER BA. Sja&scaron;ite vi&scaron;e! Radite svoj posao!</p>
</blockquote>
<p>Moji(*) su hiljadu muka vidjeli radi ovih mojih "izleta" - dopisa. Postoje kompletne vic-pričo o bring.out posjetama državnim institucijama. A sve to zato &scaron;to ja u ovih 15 godina nikada nisam uspio savladati abecedu usje&scaron;nog bosanskog biznismena:</p>
<blockquote class="posterous_short_quote">
<p>Pona&scaron;aj se ko "cukica" kad se obraća&scaron; DRŽAVI. To je ba DRŽAVA hajvanu, nije piljara!</p>
</blockquote>
<p>Državo, hajvan ti kaže:</p>
<blockquote class="posterous_short_quote">
<p>Ja ću se ophoditi prema tebi ko prema DRŽAVI&nbsp; kada ti prestane&scaron; biti - PILJARA!</p>
</blockquote>
<p>U stvari, malo me sramota ako ovo pročta neki piljar. Ti ljudi te&scaron;ki i po&scaron;teno zarađuju svoj hljeb.</p>
<p>---</p>
<p>(*) Mi smo bili ranije bili "Sigma-com" Zenica, a februaru 2009 smo promijenili sjedi&scaron;te i ime - "bring.out" Sarajevo.</p>
<p>(**) Moje radne kolege</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>administracija, bringout</div>
</div>
<div class='post_responses'>
<h4>2251 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>