<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/fit-je-drugorazredni-fakultet.html">Previous</a>
&nbsp; 
<a href="../../../index-13.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/bh-telecom-i-sudnji-dan.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Kvazi-fakulteti</h3>
<div class='post_info'>
<span class='post_time'>December  7 2010,  3:51 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Nijedan fakultet ne stvara potpuno formiranje radnike. Fakultet treba da obezbjedi osnove.</p>
<p>Fakultet je ulazna karta za bolje radno mjesto. <p />Fakultet (treba) dati papir na kome pi&scaron;e: ja sam stekao te i te bazne vje&scaron;tine i znanja.<br />&nbsp;<br />Ovisno o fakultetu, ti <strong>papiri nemaju istu vrijednost</strong>. <p />Kažu:</p>
<blockquote class="posterous_short_quote">
<p>Diploma je diploma ...</p>
</blockquote>
<p>... E jest da ne bi!</p>
<p><span style="color: #ff0000;"><strong>Diploma na fakultete koji niču k'o gljive poslije ki&scaron;e je obična 0. Ustvari i gore od toga ...</strong></span><br /><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>Vicoviti travnički univerzitet</strong></span></p>
<p>O Travničkom univerzitetu se pričaju vicevi:</p>
<blockquote class="posterous_medium_quote">
<p>Ulazi autobus u Travnik. Vozač kaže. Imamo pauzu 15 minuta. Lijevo vam je restoran "Plava voda". Ako ko hoće kahvu popit',&nbsp; nek ide tamo. Desno je univerzitet. Ako ko treba diplomu, nek ide tamo.</p>
</blockquote>
<p>Za mene, te diplome su isto &scaron;to i krivotvorena vozačka dozvola!<br />Takve diplome su, pored toga &scaron;to su svjedočanstva <span style="color: #ff0000;"><strong>neznanja</strong></span>, ujedno i svjedočanstva <span style="color: #ff0000;"><strong>niskog morala</strong></span> imaoca.&nbsp; <br />Ukratko, sa takvim diplomama se ne zarađuje halal' dinar.<p />Afere kao &scaron;to je ona kako je pola kiseljačkih partijskih moćnika naprečac na tim "fakultetima" steklo zvanje magistra dovoljno govore. <br />Ti fakulteti imaju za cilj da prave ublehare. Oni su generatori kvazi-inžinjera, kvazi-magistara, i jaaRabbi doktora nauka. To su inkubatori antiznanja.<p /><span style="text-decoration: underline; font-size: medium;"><strong>Al' meni je bio potreban samo "papir" ?!</strong></span><br />&nbsp;<br />Ovo je motiv za mnoge "diplomce" ranije pomenutih "fakulteta".</p>
<p>Informatika kao struka dodatno ima svoj specifikum. To je struka u kojoj radi veliki broj ljudi koji nemaju formalno informatičko obrazovanje. <br />Za razliku od mnogih drugih struka, u informatici je moguće djelovati bez ikakve diplome. Ja pripadam takvoj grupi.<p />Dosta puta sam čuo da ljudi idu na fakultet samo da bi dobili "papir".</p>
<p>FIT je prepun studenata kojima je upravo to glavni motiv studiranja. Peke.</p>
<p>To je samo po sebi sasvim razuman motiv. I to &scaron;to je FIT prepun studenata sa takvim motivom uop&scaron;te nije lo&scaron;a strana FIT-a. Dapače.</p>
<p>FIT je u odnosu na ETF pomjerio granice i otvorio <strong>nove mogućnosti</strong>.<p />Ali motiv studenata ne treba odrediti osnovne principe rada fakulteta. Ali ... ostavimo se FIT-a. <strong>FIT ova diploma ipak nije bezvrijedna</strong>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>100% kvazi, 100% ubleha</strong></span></p>
<p>Vraćam se ove 100% kvazi-fakultete. Na njima se priča "studenata" da im treba samo "papir" gotovo pravilo. <p />Ovo bi mogli uzeti kao podjelu studenata na takvim fakultetima:</p>
<ol>
<li>"meni treba samo diploma"</li>
<li>"nesposoban sam da zavr&scaron;im pravi fakultet"</li>
<li>"ne znam &scaron;ta je obrazovanje, koja mu je svrha, imam &scaron;telu da se uvalim na državno jasle kod tetka/tetke/amidže/dajdže/babe, i &scaron;ta ti meni tu truni&scaron;"</li>
</ol>
<p><br />Da li su oni iz grupe 1. amnestiran od kvalifikacija "nemoralan", "moje znanje je 0" ?<p />Nije. <p />Ako je neko stekao neformalno znanje kroz sopstveni rad, kurseve, rad u firmi, on će na konkursu za pravi posao(*) opet morati na tu "diplomu" dodati i svoj CV gdje će reći: "ja sam tu i tu stekao te i te vje&scaron;tine ..."<p />&Scaron;ansa se naravno može tražiti u konkursima (a takva je većina konkursa u državnim ustanovama) koji imaju formalno postavljene uslove:<br />1) V&Scaron; sprema<br />2) radno iskustvo XX godina<br />3) poznavanje X, Y, Z ...<p />Na diplomi kvazi-fakulteta ne pi&scaron;e: kvazi-diploma. Tako da je kvazi-diploma za takva radna mjesta papir koji ima upotrebnu vrijednost.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Rezultati i efekti kvazi-fakulteta</strong></span></p>
<p>Efekti ovakvog sistema, tačnije anti-sistema, su vidljivi na svakom koraku. To je jedan od ključnih faktora za&scaron;to je na&scaron; državni aparat u&scaron;ao u domen nadrealnog.&nbsp;&nbsp; <p />Neznanje je opasna pojava. Neznalice su opasni ljudi. Kao &scaron;to je za bakterije smrtni neprijatelj "Domestos"(**) sredstvo za či&scaron;ćenje, tako je za neznalice smrtni neprijatelj znanje i rasuđivanje.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kvalzi-diploma i pitanje morala</strong></span></p>
<p>Da se vratim pitanju studenata iz grupe "meni samo treba diploma". Ljudi se bore za bolju mogućnost zaposlenja.</p>
<p>To je pravo svakog čovjeka. Onda oni nisu nemoralni ?!</p>
<p>Ja to ne vidim na isti način. Smatram da su njihove "diplome", ako ni&scaron;ta drugo, identifikatori njihovog niskog stepena morala.</p>
<p>Za dru&scaron;tvo u cjelini, pored gornjih indikatora, imamo i ne&scaron;to &scaron;to se zove <strong><span style="color: #ff0000;">poremećen sistem vrijednosti</span></strong>.</p>
<p>Dru&scaron;tvo koje ima inžinjere i "inžinjere", ekonomiste i "ekonomiste" ima te&scaron;ki problem. Bosna je takvo dru&scaron;tvo.</p>
<p>Ljudi koji idu na fakultete nisu krivci za postojanje kvazi-fakulteta. Kriv je (anti)sistem - država koji takve fakultete "aminuje". A ljudi ko ljudi.</p>
<p>U jednom ranijem <a href="/bosanski-nacionalista">članku</a> sam pomenuo "Ohmov zakon".&nbsp; Za kraju ću pomenuti jo&scaron; jednu "moju" varijaciju tog zakona:</p>
<blockquote class="posterous_short_quote">
<p>Insan upire na onu stranu gdje mu je najlak&scaron;e progulit'</p>
</blockquote>
<p>Dobar sistem insana na pravu stvaru nagoni.</p>
<p>---<p />(*) posao gdje se traži sposobnost, znanje, vje&scaron;tine<br />(**) Hm, ako budem imao dovoljnu posjećenost ovog članka, možda da od ovih Italijana tražim udio u reklami :)</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>antiznanje, bosna, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>976 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<!--(bake includes/disqus.html)-->
</div>
</div>
</div>
</div>
</body>
</html>
