<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/veliki-musliman-veci-od-reisa.html">Previous</a>
&nbsp; 
<a href="../../../index-13.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/12-postova-za-jedan-dan.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Miletova japanska chenifa i čestit posao</h3>
<div class='post_info'>
<span class='post_time'>December  8 2010,  1:15 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Samo genijalac ili totalni ludak <a href="/bosanski-nacionalista">ovaj članak</a> može komentarisati japanskom chenifom.</p>
<p>Mene moj Mile nije iznenadio. Ja sam uvijek znao da je genijalac.</p>
<p>Istina, to ba&scaron; i nije neka utjeha za Mileta, s obziorm da je hernad od mnogih već dobio dijagnozu - "lud ko struja".</p>
<p><!--more-->Bilo kako bilo, to nas ne spriječava da se Mile i ja častimo kako smo genijalci :)</p>
<p>Ali ja ovdje neću uop&scaron;te pričati o Miletovoj ili svojoj genijalnosti.</p>
<p>Pričaću o čestitom poslu.</p>
<p>Da. U pravu ste.</p>
<p>Sada se ja trkam u igri asocijacija sa Miletom. Vi koji ni&scaron;ta ne kontate - <strong>sikter</strong> ! <a href="/citalac">Pa rekao sam vam već da me ne interesujete</a>.</p>
<p>Ako Mile moj nacionalizam može povezati sa chenifom, mogu i ja na njegovu chenifu na&scaron;tiklati priču o čestitom poslu.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Čestit posao</strong></span></p>
<p>Da bih govorio o "čestit posao" moram reći &scaron;ta ja pod tim terminom mislim. Zato ću objaviti jedan interni dokument moje firme:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>cestit_posao.pdf</strong>
<a href="../../../file/2010/12/4604831-cestit_posao.pdf">View this file</a>
</div>
</div>
Ovo je jedno od temeljnih uputstava po kome radnici bring.out moraju postupati.</p>
<p>Uputstvo ima 22 člana, ko jedan dobar zakon. U bring.out postoji na desetine ovakvih uputstava. Kolege me zato sa razlogom zovu "upustvoman".</p>
<p>Prva rečenica daje samo dio odgovora na to &scaron;ta je čestit posao:</p>
<blockquote class="posterous_short_quote">
<p>Čestit posao je onaj koji je koristan.</p>
</blockquote>
<p>Jedan od članova koje često pominjem je ovaj:</p>
<blockquote class="posterous_short_quote">
<p>Jednostavan posao može biti urađen traljavo</p>
</blockquote>
<p>Ali, da sada prestanem nabrajati članove. Za mene - čestit posao je definisan kroz ovih 20-tak članova.</p>
<p>Vratimo se na Miletovu chenifu. Kada mi je poslao odgovor, prvo mi je drago bilo &scaron;to je Mile u mom članku pročitao upravo one poruke koje sam htio poslati. "Plitak" čitalac će ovaj i ovakve članke za seknudu protumačitii kao "pjenjenje" nekog tek osvije&scaron;ćenog muslimana. Ali ne i moj Mile.</p>
<p>Poslao mi je odgovor email-om u kome je atachirao tu svoju japansku chenifu. I ja sam odmah rekao, ovo treba ići na blog.</p>
<p>Ali bez chenife to nije potpun ugođaj :)</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Posterous blog engine</strong></span></p>
<p>Ali onda sam do&scaron;ao, kako postirati chenifu na <a href="http://posterous.com/">posterous blog</a> engine ?</p>
<p>Poku&scaron;ao sam na vi&scaron;e načina, ali to nije to. Komentari ne dozvoljavaju dokumente priloge, za razliku od članaka. Onda sam skontao da ću u fusnotu svog članka staviti link na dokument. Ali i to ima gre&scaron;ku. Ne mogu sada ba&scaron; mijenjati članak sa Miletovom chenifom ....</p>
<p>Kako sa slikom (jpg) fajl nisam uspio postići &scaron;to sam htio, poku&scaron;ao sam sa to rije&scaron;iti sa <a href="http://www.scribd.com/doc/44885789/miletova-japanska-chenifa">pdf dokumentom</a>.</p>
<p>Ali i tu imam istu stvar. U svakoj varijatni moram sliku ili PDF dokument prikazati u originalnom članku. A to je bezveze.</p>
<p>Onda sam se sjetio: posterous ima feature autopost-a. Taj funkcija omogućava da, kada članak po&scaron;aljemo na posterous, blog engine &scaron;alje slike sa vezanim servisima: link na članak ide na <a href="http://twitter.com/hernad">twitter</a>, PDF dokumenti idu na <a href="http://www.scribd.com/hernad">scribd</a> ...</p>
<p>Pa da - onda imam rje&scaron;enje. Trebam samo web picture album, i onda ću to &scaron;to dobijem moći koristiti u ovim situacijama. Kako sam ja google fun, povezao sam blog sa postojećim <a href="http://picasaweb.google.com/ernad.husremovic">picassa web</a> account-om.</p>
<p>Nakon toga sam u članak stavio Miletovu chenifu, pokrenuo autopost funkciju, i chenifa je oti&scaron;la na moj <a href="http://picasaweb.google.com/ernad.husremovic/PosterousPhotos#5548222824132524418">picassa web account</a>.</p>
<p>Taj link sam iskoristio u fusnoti, komentara kako sam prvobitno htio.</p>
<p>Naravno, mogao sam ja ovo uraditi odmah. Moga sam na bilo koji web picture servis ovo objaviti i napraviti link, bez "komplikacija" sa posterous-om.</p>
<p>Ali sad sam svoj blog napravio jo&scaron; boljim, i svaki put kada budem stavio na blog sliku moj blog engine će to "twittati", "scribd"-ati i "picassa"-ovati.</p>
<p>Tako će moj blog ubrzo biti najbolji u Bosni, sa pretenzijom da osvoji svijet :)</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Čestit posao</strong></span></p>
<p>Vrijeme je ograničeno. Za čestit posao, ovako kako sam ga ja definisao, najče&scaron;će fali vremena. Međutim, tu izvr&scaron;ilac uvijek mora prepoznati kontekst. &Scaron;ta su implikacije ako ja ovo uradim, &scaron;ta ako "skalamudim". Nekad je improvizacija, ili "skalamuđenje" kako ja to maloprije rekoh, neophodno. Ali veoma često stvaramo lažnu dilemu da smo "skalamudili" jer nemamo vremena. Međutim, najče&scaron;će su takvi postupci posljedica <strong>nerazmi&scaron;ljanja</strong> i <strong>neznanja</strong>.</p>
<p>Ja sam uočio da u mojoj firmi nije problem u tome &scaron;to se radi sporo (radi uputstava kao &scaron;to je čestit posao), nego zato &scaron;to se pravi puno gre&scaron;aka:</p>
<blockquote class="posterous_short_quote">
<p>Neznanje je najveći neprijatelj dobrog posla.</p>
</blockquote>
<p>Zato moje radne kolege dobro razmisle kada mi kažu:</p>
<blockquote class="posterous_short_quote">
<p>Ernade, ali, nisam imao vremena ...</p>
</blockquote>
<p>Jer znaju da iza toga slijedi:</p>
<blockquote class="posterous_short_quote">
<p>Drži se ti uputstava, a meni pusti firmu da je vodim ...</p>
</blockquote>
<p>Za&scaron;to ovako odgovaram? Zato &scaron;to svako ko sebi daje za pravo da posao, i pored jasnih uputa, radi na "svoj" način, praktično mjenja način rada firme. To se u mojoj <a href="http://www.bring.out.ba">1000-pravila firmi</a> ne smije. Ako pravilo ne valja, ono se treba promijeniti. Ali sve dok je ono na snazi - drži ga se jarane!</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Taj bring.out je gori nego JNA(*) !?</strong></span></p>
<p>Ne nije.</p>
<p>bring.out je vrhunac demokratije. Ali ja razlikujem demokratiju od&nbsp; prava da svako može lupetati "Ko Martin po diviziji" bez razmi&scaron;ljanja:</p>
<p><div class='p_embed p_file_embed'>
<div class='p_embed_description'>
<strong>meritokracija.pdf</strong>
<a href="../../../file/2010/12/4605022-meritokracija.pdf">View this file</a>
</div>
</div>
Mi u bring.out gradimo sistem.</p>
<p><span style="text-decoration: underline; font-size: small;"><strong>Ovo su interni dokumenti firme, i ti ih objavljuje&scaron; ?</strong></span></p>
<p>Mi smo <a href="http://www.bring.out.ba">bring.out</a>. Mi smo otvorena firma. Mi smo najiskrenija firma u Bosni, sa pretenzijama da tu titulu osvojimo na novou komplet' dunjaluka.</p>
<p>Naravno, pod uslovom da u međuvremenu ne propadnemo.</p>
<p>----</p>
<p>(*) JNA - Jugoslovenska narodna armija, mjesto za kvalitetno ispiranje mozga i gubitak najljep&scaron;ih godina života</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, bringout, business, dunjaluk, sistem</div>
</div>
<div class='post_responses'>
<h4>1761 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<!--(bake includes/disqus.html)-->
</div>
</div>
</div>
</div>
</body>
</html>
