<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/dva-bloga-dnevno-u-po-ispita-ne-kontam.html">Previous</a>
&nbsp; 
<a href="../../../index-14.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/bosanski-nacionalista.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Muž, blogiranje, facebook </h3>
<div class='post_info'>
<span class='post_time'>December  2 2010, 12:28 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Jutros mi je za kahvom Dženana rekla: "Dobar ti je onaj naslov bloga. Međutim, interesantno je kako u 5 ključnih atributa koji te određuju nema pojma - muž. Kod mene bi taj atribut postojao".</p>
<p>Da, tačno je da to nisam naveo. Ali takođe, kada sam razmi&scaron;ljao &scaron;ta navesti, na "muž" nisam zaboravio. "Muž" sam nekako svrstato kao &nbsp;dio moje privatnosti. Učinilo mi se bezveznim navesti takvu stvar na zaglavlju bloga.</p>
<p>Puno mi je bitnije da li Dženana smatra da sam ja (i kakav sam) - muž, nego da dunjaluk zna da sam muž. &Scaron;to se tiče toga kao <a href="/pages/about-o-meni ">činjenice, to jednostavno stoji</a>.</p>
<p><!--more--></p>
<p><span style="text-decoration: underline;"><strong>Blogiranje</strong></span></p>
<p>Onda čovjek dođe do logičnog pitanja: &Scaron;ta je uop&scaron;te blog kao forma izražavanja ?</p>
<p>Izlaganje svojih misli javnosti, u &scaron;to je neminovno uključena tvoja privatnost, uvijek predstavlja određeni stepen egizibiconizma.&nbsp;</p>
<p>I tu naravno treba paziti na granice.&nbsp;</p>
<p>Pa za&scaron;to ja uop&scaron;te blogiram? Liječim svoje frustracije ? Imam neki te&scaron;ki problem "u glava" :) ?</p>
<p>Blogiram zato &scaron;to imam svoj stav, koji je često "non-mainstream". I to želim podijeliti.</p>
<p>Blogiram zato &scaron;to mnoge od tih stavova ne mogu (ili ne znam) sažeti u jednu rečenicu.</p>
<p>Blogiram zato &nbsp;&scaron;to ne volim generalizacije i priče kako je sve poznato i kako smo svi isti. Da je to tako, dunjaluk bi bio kao jedna ustajala bara koju ni povjetarac ne talasa.</p>
<p>Da ... bara je ba&scaron; dobra asocijacija za moje viđenje bosanskog dru&scaron;tva. Mi smo postali jedna ustajala bara. Pa ako će moj blog "zatalasati" tu baru za 10 ljudi, dobro i jeste. Ako ću ovakve poruke doći do moje djece, i biti im od koristi, elhamudlillah! &nbsp; Osjećaću se bolje, jer nisam sjedio skr&scaron;tenih ruku i kukao ... A dobacio sam onoliko kol'ko sam kadra dobact'. &nbsp;Nisam se prepustio smradu bare.&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>A facebook ?</strong></span></p>
<p>Facebook je genijalno osmi&scaron;ljen koncept socijalne mreže. &nbsp;Ja međutim nisam veliki ljubitelj facebook-a.&nbsp;</p>
<p>Ne, nisam ja zabrinut za privatnost. Svako dovoljno pametan treba biti svjestan da na socijalnim mrežama treba komunicirati na isti način ka da na ulici priča&scaron; glanim tonom - svako može da te čuje i vidi. Zato mi ne pada na pamet da svom djetetu kažem da ne koristti facebook. To jeste sredstvo komunikacije i iz toga, posebno omladina, ne treba biti isključena. Ali svoje dijete učim KAKO da to sredstvo koristi, i gdje su granice.</p>
<p>Facebook je za mene previ&scaron;e generalan. &nbsp;Previ&scaron;e je tu dangube i &scaron;upljih priča. Pod tim mislim:</p>
<ul>
<li>navođenje tuđih pametnih misli ... ako nema&scaron; &scaron;ta svoje daj' ba ohladi me od Kanta, Hegela i tamo neke kineske mantre</li>
<li>elektronska komunikacija nije zamjena za druženje. Pravo druženje između ljudi mora imati verbalnu formu. U takvom druženju bude i "&scaron;uplje priče", ali tada ta &scaron;uplja priča ima smisao. Ljudi se na taj način odmaraju, pune energiju. Ljudi se druže. Facebook za mene nije mjesto za takva punjenja energije.</li>
</ul>
<p>Zato je blog forma koja meni odgovara. U njoj pričam o stvarima koje me interesuju, za koje mislim da bi drugima mogle biti interesantne. &nbsp;Svako ima veoma jednostavan način me se kutari&scaron;e - jednostavno prestane čitati moj blog :)</p>
<p>Konkretno, na facebook-u me pravo nervira kada raja počne "&scaron;ibati" izjave tipa: "Dragi bez tebe ne mogu, ti si moja ljubav, sunce ne sija kada ti nisu tu &nbsp;...".&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>Senzor: "evo ublehara"</strong></span></p>
<p>Za&scaron;to me to nervira ? Pa i ti ljudi kažu &scaron;to im je na pameti ba&scaron; kao i ja ovdje. Evo za&scaron;to:</p>
<p>1) &nbsp;Kada se takve takve poruke izbacuju neselektivno, one jednostavno devalviraju. Kada me neko u komunikaciji previ&scaron;e puta oslovi sa "<em>Gospodine</em>", mene taj čovjek počne nervirati. Kada mi neko 5 puta u 15 minuta kaže: "<em>Vi ste u pravu</em>", moj detektor senzora "evo ublehara" podigne se na najvi&scaron;i nivo.</p>
<p>2) Pa to je ženo/čovječe dio tvoje intime! &Scaron;ta ti uop&scaron;te želi&scaron; reći ? Idi nazovi tog svog/svoju ljubljenu, pitaj ga kad ima vremena za &scaron;etnju. Pusti se facebook-a i tog ... nja nja nja!</p>
<p>Ali da se razumijemo: ne kažem da bi to nja nja nja ... trebalo zabraniti. Kome voli nek nek nja..nja, ko voli tje&scaron;iti nja..njalice nek ih tje&scaron;i. Mene to nervira.</p>
<p><span style="text-decoration: underline;"><strong>Ponovo, return to subject</strong></span></p>
<p>Drugi put, vratimo se naslovu.&nbsp;</p>
<p>Za&scaron;to ne govorim "volim te" svako malo ? Zato &scaron;to sam mu&scaron;karac ? Pa i nije ba&scaron; tako. To je jednostavno dio mog karaktera.</p>
<p>To mogu da vidim postmatrajući sopstveno dijete: Moja Samra je ba&scaron; slična po tom pona&scaron;anju. Samra se ne voli ljubiti(*). Samra nije ta koja će te onako poljubiti ili ti bez ikakva povoda uputiti toplu riječ. Mnogi kažu da je Samra "pljunuti" babo.</p>
<p>Ah opet ja odoh pričati o svojoj djeci. Definitivno sam tag "babo" na dobro mjesto stavio :).</p>
<p><span style="text-decoration: underline;"><strong>Zaljubljen</strong></span></p>
<p>Ja sam zaljubljen u svoju Dženanu. Uvijek sam bio. Volim njen felerično "r". Volim njene "X" noge. Eto volim je ... skroz. Da to nije tako, takav kakav jesam, ne bih mogao sa njom živjeti 16 i kusur godina. Dženana je žena mog života. I hvala dragom Allahu, &scaron;to me nije stavio u isku&scaron;enje da me spoji sa nekim koga ne volim. To bi za mene bilo veliko isku&scaron;enje.</p>
<p>Ja jednostavno ne pripadam grupi ljudi koji smatraju da je normalno živjeti život organizovati život sa osobom koju ne voli&scaron;, razumije&scaron; i po&scaron;tuje&scaron;. T</p>
<p><span style="text-decoration: underline;"><strong>Svađe</strong></span></p>
<p>Sa Dženanom sam se puno puta znao žestoko posvađati. I te svađe su najće&scaron;će bile radi - djece. Za&scaron;to ? Zato &scaron;to je Dženana Majka(*), a ja Babo. I kada procjenimo da onaj drugi ne postupa dobro sa djecom, tu se dese svađe. Velike svađe. Ali, kako godine idu, te svađe su sve rjeđe. Nakon troje djece, valjda smo dovoljno ispekli roditeljski zanat :).</p>
<p>Najbitnije od svega je to &scaron;to se te svađe zavr&scaron;avju na taj način&nbsp;da se oboje presaberemo, pa se takve stvari&nbsp;u budućnosti ili prestanu događati ili se barem učine podno&scaron;ljivim onom drugome. Ali ono &scaron;to je najbitnije, ishod tih svađa biva na korist na&scaron;oj djeci.</p>
<p><span style="text-decoration: underline;"><strong>Muž pametne žene</strong></span></p>
<p>Nije te&scaron;ko biti Dženanin muž. Zato &scaron;to je ona pametna žena.</p>
<p>Dženana je takođe dominantna žena. Kada mi to zasmeta, često joj kažem: "Halooo direktorice, stani malo ...". I to funkcioni&scaron;e.</p>
<p>Za razliku od mene, koji sam u komunikaciji često "bombastičan"(***), Dženana je vrstan govornik. Ona uspijeva svoju poruku prezentovati u formi koja će slu&scaron;aocu biti maksimalno prihvatljiva. Da se razumijemo, njen govor nisu ublehe(****). To nisu standardne političke priče koje se zavr&scaron;e sa gdje si bio - nigdje, &scaron;ta si radio - ni&scaron;ta. Zato i nije slučajno da je Dženana profesor(****?) na fakultetu.&nbsp;</p>
<p>Dženana ljubavi moja, u headeru mog bloga &nbsp;te nema, &nbsp;al' kada nisi tu, sunce ne sija. Zato ću, &nbsp;barem ovom članku, pokloniti tag "muž"</p>
<p>Čekaj, ovo mi odnekle poznato ? Ah taj facebook. &nbsp;Zaraza prava.</p>
<p>---</p>
<p>(*) Neka tako i ostane dok ne nađe sebi "zakrpu" :)&nbsp;</p>
<p>(**) Ne, nije nije slučajna gre&scaron;ka veliko "M"&nbsp;</p>
<p>(***) Za mnoge zasigurno iritantan, Opet mi Samra, kao moj "klon", najbolje pokazuje kako me drugi mogu vidjeti</p>
<p>(****) Da jesu ubulehe, ja bih sa takvom osobom te&scaron;ko mogao funkcionisati &nbsp;</p>
<p>(*****) Formalno jo&scaron; nije, ali aBd u zimu će se i ta formalnost obaviti</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dunjaluk, muž</div>
</div>
<div class='post_responses'>
<h4>1184 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
