<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/bringout-marketing.html">Previous</a>
&nbsp; 
<a href="../../../index-12.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/internet-service-provider.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Radni dan u bring.out</h3>
<div class='post_info'>
<span class='post_time'>December 15 2010,  9:17 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Pričam puno o <a href="http://www.bring.out.ba/">svojoj firmi</a> u zadnje vrijeme. Sigurno sam dosta puta sam pomenuo i <a href="http://www.bring.out.ba/tag/b_knowhow">knowhow</a> projekat. Međutim, mogu misliti koja je to konfuzija i "magla" za nekoga ko ovo čita sa strane. U takvim pričama se redovno "dohvatim" na&scaron;eg sistema rada, otvorenog pristupa prema klijentima, opensource orjentacije firme ... bukuri&scaron; živi.</p>
<p>Dobio sam par komentara kako ljudi čitaju moj blog redovno. Iskreno, iznenađen sam. Ali da budem jasan: To je lijepo čuti. Kada bih rekao da blogiram radi sebe, a ne radi toga da neko drugi ne pročita, to bi brate bila čista laž. A ja volim biti iskren. Mnogi će reći i previ&scaron;e :). Moja Dženana mi je jednom prilikom rekla:</p>
<blockquote class="posterous_short_quote">
<p>Ti si Ernade "brutalno" iskren</p>
</blockquote>
<p>S obzirom da sam za bilo kakva naučna postignuća zakasnio, mogu poku&scaron;ati "furati" na iskrenost. Bilo bi "cool" kad bi nakon mene ostala "hernad" - <strong>mjera za iskrenost</strong>. Zamisli tamo negdje 2060:</p>
<blockquote class="posterous_short_quote">
<p>Ovaj čovjek ba&scaron; iskren - ocjenjen je sa 0.75 "hernad"-a.</p>
</blockquote>
<p>He he he. Ali pustimo mene. Pričamo o mojoj firmi. Mi smo "freak" firma. Mi smo IT firma. Mi smo opensource firma. Dobro, dobro, dobro. Ali na &scaron;ta to konkretno liči !?</p>
<p><!--more--><span style="text-decoration: underline; font-size: medium;"><strong>"Nužno zlo" poslovi</strong></span></p>
<p>Nakon &scaron;to sam objavio <a href="/knowhow">knowhow projekat</a> prije 20 dana, za njega vi&scaron;e nisam "sjeo". Prvo su me poklopili <a href="/tag/fit_2_godina">ispitni rokovi</a>, pa su me onda <a href="a/teska-poslovna-odluka">neočekivano "poklopili" problemi sa fiskalizacijom</a>. Te stvari su me iscrpile. Čitavo vrijeme sam sebi govorio: "Ernade, rije&scaron;i jo&scaron; ovo pa će&scaron; se moći vratiti na knowhow".</p>
<p>Knowhow vidim ba&scaron; kao svjetlo na kraju tunela, kako za mene tako i za moju firmu. Po prvi put nakon dosta godina, jedva čekam da dođem na posao. I da se prihvatim računara. Da se prihvatim "prave" informatike.</p>
<p>Nisam ja predhodnih godina bio van informatike. Ali to su uvijek bili neki zadaci koje bih najradije dao drugima, ali to nisam uspio postiči.</p>
<p>Zadnjih godina sam puno radio na system admin poslovima. Zato &scaron;to sam želio firmu pogurati na toj serverskoj strani. I znam ja te stvari dobro. Pametan sam vam ja :)</p>
<p>Ali to nije to. Ja sam programer. Ja volim bazu(*), volim se "vozati" po source kodu, volim se boriti sa bug-ovima na software-u.</p>
<p>Tih stvari ima i u sistem admin poslovima, ali za mene to nije dovoljno.</p>
<p>Sistem admin poslovi su međutim opet informatika. Ono &scaron;to najvi&scaron;e mrzim su moje obaveze i zaduženja mimo informatike.</p>
<p>Ne volim firmu. Mene vlast i moć me ne mogu učiniti "kompletnim". Ja sam "freak". Programer. Ja volim doći u situacija da kažem:</p>
<blockquote class="posterous_short_quote">
<p>Vidi &scaron;to sam pametan, kako sam ovo isprogramir'o, kako sam ovo skont'o.</p>
</blockquote>
<p>Čak mi ni publika ne treba. Mogu ja sam sebi to ispričati. Freak totalni.</p>
<p>Zato me ne može ispuniti pozicija moći:</p>
<blockquote class="posterous_short_quote">
<p>Jesam tom i tom "bukvicu" očit'o. Pokaz'o&nbsp; sam mu ja ko je ovdje glavni ...</p>
</blockquote>
<p>Da se razumijemo, ja ovakve stvari govorim, kada procijenim da treba. Tako nerijetko moram postupiti, jer mi je takva funkcija u firmi. Ali takve stvari me nikada nisu ispunjavale. One su me uvijek "praznile".</p>
<p>Za&scaron;to ja to ne volim? Zato &scaron;to sam neki "dobričina"? Ne, ja mislim zato &scaron;to sam hard-core informatičar.</p>
<p>Međutim, da se razumijemo: Ja sam direktorski zanat sticajem okolnosti "ispekao". Ne treba mi puno da uočim probleme u firmi ili probleme sa poslovnim partnerima. Brzo skontam kada me neko "ublehari", ili kada stvari idu u lo&scaron;em smjeru. Nakon 15-tak godina rada, te stvari čovjeku jednostavno "uđu u krv".</p>
<p>Kako te poslove smatram nužnim zlom,&nbsp; moj prag tolerancije na gre&scaron;ke kolega je često vrlo nizak. Ne treba mi puno da svom kolegi kažem:</p>
<blockquote class="posterous_short_quote">
<p>Radi svoj posao! Misli! Nisam ti ja sekretarica !</p>
</blockquote>
<p>A sve te reakcije potiču od činjenice da u tim situacijama svoje kolege vidim kao one koji me onemogućavaju da radim posao koji najvi&scaron;e volim - <strong>programiranje</strong>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>&Scaron;ta je programiranje ? </strong></span></p>
<p>Programiranje je&nbsp; mozganje ... testiranje ... proučavanje ... učenje ... pa opet mozganje ... testiranje ... proučavanje ... učenje.&nbsp; E tu se osjećam svoj na svom. Svako ostalo radno okruženje za mene je - <strong>nužno zlo</strong>.</p>
<p>Kada bih sa ovom pameću ponavljao karijeru, sigurno bih bježao od ove uloge koju sada imam - uloge direktora firme.</p>
<p>Međutim, ova moja konstrukcija je od bring.out-a napravila jednu krajnje interesantnu firmu.</p>
<p>Boreći se da sve &scaron;to ne volim "otresem" od sebe, ja sam napravio dobar sistem. Većina direktora takvo &scaron;to niti bi znali, niti bi smjeli praviti.</p>
<p>Ispričaću vam ne&scaron;to o tome ...</p>
<p><a name="redmine"></a><span style="text-decoration: underline; font-size: medium;"><strong>redmine projekt menadžment</strong></span></p>
<p>Pro&scaron;li petak smo imali lijep radni dan. Radili smo testiranje i <a href="http://www.bring.out.ba/fiskalizacija">programiranje fiskalnih uređaja</a>. Sa&scaron;a je radio clipper-icu(**), jasko je radio serviserske poslove na uređaju, ja sam se povremeno uključivao u njihove poslove. To povremeno uključivanje znači:</p>
<blockquote class="posterous_short_quote">
<p>Čitao u redmine-u njihove izvje&scaron;taje.</p>
</blockquote>
<p>Tu dolazimo do jedne stvari po kome je bring.out definitivno specifičan. Kakve izvje&scaron;taje ? Prilčamo o vi&scaron;e izvje&scaron;taja u jednom danu !?</p>
<p>E dragi moji, u na&scaron;oj firmi se informacije non-stop postiraju na na&scaron; redmine project management sistem. To praktično znači, da izvr&scaron;ilac može u toku sahat-dva napisati 10-tak bilje&scaron;ki na redmine tickete(***). To naravno ovisi o prirodi posla koji obavlja, ali u toku dana se u bring.out-u u prosjeku otvori 10-tak novih ticketa. Svaki ticket predstavlja neku radnu aktivnost. Svaki taj ticket opet sadrži u prosjeku 10-15 promjena.</p>
<p>To znači da u na&scaron; sistem svaki dan preko 100 "mikro" izvje&scaron;taja.</p>
<p>Ja volim reći:</p>
<blockquote class="posterous_short_quote">
<p>U bring.out ne postoje izvje&scaron;taji - postoje pisane informacije, koje se "same" pretvaraju u izvje&scaron;taje</p>
</blockquote>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;"> zimbra email<br /></span></span></strong></p>
<p>Zbog upotrebe redmine-a, kori&scaron;tenje email-a u na&scaron;oj firmi je bitno drugačiji nego li u "običnim" firmama. Svakodnevno provjeravamo email radi prijema faksova(***), eksternih mail-ova. Ali, sve te informacije izvana na kraju zavr&scaron;avaju u redmine sistem-u.</p>
<p>Zato, prilikom rje&scaron;avanje nekog zadatka mi ne komuniciramo tako &scaron;to kažemo: "Pogledaj email", nego uvijek: "Pogledaj ticket".</p>
<p>Iz tog razloga, email se u internoj komunikacji koristi isključivo da informi&scaron;e o promjenama na redmine-u.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>chat sistem</strong></span></p>
<p>Za razmjenu kratkih informacija koristimo chat sistem. Ako neko želi da ode na pauzu, on na chat stavi: "oti&scaron;ao sam tu i tu, vraćam se tada i tada ..."</p>
<p>I to je sva procedura.&nbsp; Ako se ne&scaron;to hitno treba rje&scaron;avati sa kolegom se komunicira chat-om-</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>A telefon ?</strong></span></p>
<p>Telefon se kod nas vrlo malo koristi u internoj komunikaciji. Razlog je jednostavan:</p>
<blockquote class="posterous_short_quote">
<p>Svaka relevantna informacija mora zavr&scaron;iti u redmine-u</p>
</blockquote>
<p>Ako se priča telefonom, onda se nakon komunikacije moraju ključne informacije iz razgovora napisati. Znači dupli posao.</p>
<p>Zato mi vi&scaron;e volimo chat-ati, i onda sa copy-paste bitne dijelove chat-a stavljamo na odgovarajuće redmine tickete.</p>
<p>Ja sam dokazani telefonomrzac.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Vi niste normalni ? Vi &scaron;ta radite - samo pi&scaron;ete po tom va&scaron;em redmine-u !?</strong></span></p>
<p>Ovo su uobičajene reakcije onih kojima prvi put izložimo na&scaron; način rada. Međutim, dragi moji čitaoci, pojma nemate kako je ovo produktivan način rada ....</p>
<p>Kada se ekipa osposobi, ovaj način uop&scaron;te ne usporava operacije.</p>
<p>A korist od njega je ogromna. Mi svaki dan<strong> povećavamo znanje - knowhow - kapacitet firme</strong>. Jo&scaron; jednom: povećavamo: <strong>povećavamo kapacitet firme</strong>. Evo jo&scaron; jednom po srpski bre: <strong>povećavamo knowhow firme</strong>.</p>
<blockquote class="posterous_short_quote">
<p>Za&scaron;to ponavljam ... firma ... k'o "pokvarena ploča" !?</p>
</blockquote>
<p>Zato &scaron;to većina firmi ovome ne posvećuje pažnju. U firmama postoje pojedinci koji jedini znaju kako se ne&scaron;to radi. Tako da de-facto knowhow - znanje - sposobnost da se ne&scaron;to uradi ne pripada firmi nego tim pojedincima. Oni su gurui. I firma je ovisna o njima. Takve firme su iznimno ranjive na kadrovske promjene. Zato je na&scaron; koncept dobar. Odličan. Genijalan.</p>
<p>Drugi faktor koji na&scaron; sistem čini sjajnim je <strong>koordinacija</strong> i mogućnost <strong>timskog rada</strong>. Kada je neka frka, de&scaron;ava se da nas trojica(*) svi "udarimo" na isti zadatak. Kada se to desi, mi ga fakat ko "borna kola" "sameljemo".&nbsp; Malo je firmi koje imaju tu sposobnost - da na jednom zadatku po potrebi može udariti vi&scaron;e ljudi odjednom. Kod nas to funkcioni&scaron;e k'o &scaron;vajcarski sahat.</p>
<p><strong>Jednostavna kontrola</strong> je treća bitna karakteristika na&scaron;eg sistema. Izvr&scaron;ioci "ne mogu lupetati" bez posljedica. Uvijek postoji mogućnost da se vratimo unazad i da pogledamo &scaron;ta je ranije rađeno. To opet kao posljedicu da izvr&scaron;ioci na svim zadacima, bez obzira da li ih neko trenutno prati ili ne, uvijek daju svoj maksimum. To znači podiže <strong>kvalitet</strong> na&scaron;ih operacija. Radnik može biti čitav dan sam u firmi, ali sistem praćenja i kontrole uvijek postoji. A to je redmine.</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Dobro "marsovci", a kako to uvesti ?</strong></span></span></p>
<p>E to jeste problem. <strong>Ovaj sistem je te&scaron;ko uvesti</strong>. Ali ne zato &scaron;to je sistem komplikovan. Nego zato &scaron;to su ljudi u većini ... nepismeni.</p>
<p>Ejs nepismeni. Da dragi moji <span style="font-size: medium; color: #ff0000;"><strong>nepismeni</strong></span>. U na&scaron;oj lijepoj Bosni, pola inžinjera je nepismeno. Pola ekonomista je nepismeno. Pola tehničara je nepismeno .. Ti nepismeni odmah kažu:</p>
<blockquote class="posterous_short_quote">
<p>Mene to usporava. Ja ne mogu ni&scaron;ta ovako zavr&scaron;iti.</p>
</blockquote>
<p>I oni su u pravu. Međutim, kvaka je &scaron;to nije problem sa sistemom, nego sa njima - odnosno njihovom nepismeno&scaron;ću.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Nepismenost</strong></span></p>
<p>Nakon ove artiljerijske paljbe na radni narod Bosne i Hercegovine, dajem poja&scaron;njenje nepismenosti:</p>
<blockquote class="posterous_short_quote">
<p>Ovdje prije svega pričam o vje&scaron;tini pisane komunikacije</p>
</blockquote>
<p>Ali, da tome i dodam - kada ti "nepismeni" kažu:</p>
<blockquote class="posterous_short_quote">
<p>Ja to ne znam napisati, ali znam uraditi</p>
</blockquote>
<p>to uzmite sa rezervom! Mnogi od njih to ne znaju ni čestito uraditi! Oni ne znaju &scaron;ta da napi&scaron;u jer ne znaju kako se posao radi.</p>
<p>Kada ljudi počnu stavljati na papir ono &scaron;to rade ... joj &scaron;ta tu čovjek sva&scaron;ta pročita. Kako neznanje "ispliva" na povr&scaron;inu ... Zato imajte na umu:</p>
<blockquote class="posterous_short_quote">
<p>Vje&scaron;tina pisane komunikacije visoko korelira sa općom sposobnosti da obavi postavljene zadatke</p>
</blockquote>
<p>Naravno, ja ovdje čitavo vrijeme pričam o radnicima koji obavljaju složenije poslove. Radnici "na lopati" su sasvim druga priča.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">bring.out radnik</span></strong></span></p>
<p>Svaki bring.out radnik mora biti "pismen". Ako radnik tu vje&scaron;tinu ne posjeduje, njegova glavna borba kod ulaska u firmu je borba otklanjanje te mahane.</p>
<p>Zato su bring.out radnici prave "mrake". "Marsovci".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Radni dan u bring.out</strong></span></p>
<p>Ah čovječe ... opet sam ispisao čitav "čar&scaron;af" o stvarima o kojima u prvi mah uop&scaron;te nisam imao namjeru pisati ... &Scaron;teta ako sam ljude otjerao ovim "Markovim konacima".</p>
<p>A upravo ovo sam i htio ispričati, odnosno pokazati.</p>
<p>Evo kako u video formi, gledajući na desktop mog računara, izgleda jedan radni dan u bring.out:</p>
<p><iframe src="http://www.youtube.com/embed/TW22j9x4WcM?wmode=transparent" allowfullscreen frameborder="0" height="417" width="500"></iframe></p>
<p>Prikazao sam radni dan koji volim - radni dan kada sam direktor, ali i programer. Obavezni dio takvog radnog dana su:</p>
<ul>
<li>redmine i zimbra</li>
<li>linux konzola</li>
<li>chat sa radnim kolegama</li>
</ul>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Poja&scaron;njenja video materijala</strong></span></p>
<p>Ko je Đuro? Pitajte kolegu Jaska. Pretpostavljam da je mislio na <a href="http://sr.wikipedia.org/sr-el/%D0%82%D1%83%D1%80%D0%BE_%D0%9F%D1%83%D1%86%D0%B0%D1%80_%D0%A1%D1%82%D0%B0%D1%80%D0%B8">Đuru Pucara "Starog"</a>.</p>
<p>&Scaron;ta je komunizam? To vi&scaron;e ni zakleti komunisti ne znaju.</p>
<p>&Scaron;ta je <a href="http://sh.wikipedia.org/wiki/Zadruga">zadruga</a>? To vam je rad za druga. Jedini je problem &scaron;to tog "druga" niko ne zna.</p>
<ul>
</ul>
<ol> </ol><ol> </ol>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Dova</strong></span></p>
<blockquote class="posterous_medium_quote">
<p>Allahu moj, podaj da u narednom periodu &scaron;to vi&scaron;e sahata provedem kao programer.</p>
<p>Da obećanja(******) data na&scaron;im klijentima ispunimo.</p>
<p>Da ciljeve koje sam postavio pred sebe i svoju firmu ostvarim na najbolji način</p>
<p>Da Ti bude&scaron; zadovoljan sa mnom.</p>
<p>Olak&scaron;aj, a ne otežaj moje poslove.</p>
<p>Ti si jedini kadra postići sve.</p>
</blockquote>
<p>Amin.</p>
<p>---</p>
<p>(*) bazu podataka</p>
<p>(**) programiranje u programskom jeziku clipper u kome su pisane na&scaron;e postojeće - "legacy" <a href="http://www.bring.out.ba/tag/fmk">poslovne aplikacije</a>.</p>
<p>(***) Redmine ticket - na njemu se bilježe informacije o zadatku</p>
<p>(****)&nbsp; Nemamo klasičnog fax uređaja. Imamo fax server preko koga elektronske dokumente &scaron;aljemo na standardne fax uređaje, a faxove drugih primamo u elektronskoj formi putem na&scaron;eg email sistema kao PDF dokumente</p>
<p>(****) Sa&scaron;a, Jasko i ja radimo tehničke poslove, Željka isključivo administrativne</p>
<p>(*****) <a href="http://www.bring.out.ba/sta-sa-fmk">http://www.bring.out.ba/sta-sa-fmk</a></p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, b_knowhow, dova, dunjaluk</div>
</div>
<div class='post_responses'>
<h4>2694 views and 5 responses</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Dec 15 2010,  1:27 PM</div>
<div class='response_name'>op responded:</div>
</div>
<div class='response_body'>Samo što ste izbrali ubuntu kao OS ?<br />Btw jako mi se svidio video. :)</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Dec 15 2010, 11:08 PM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>@op, prije svega hvala na komentaru.<p>Moram reći da sam se pribojavao da oni koji pogledaju video ne prokomentarišu: "koga je briga šta radiš na svom desktopu ?!"</p><p>a što se tiče ubuntu-a: on je dovoljno linux i dovoljno "šminka" za prosječnog korisnika :)</p><p>Može i ovakav odgovor: bolje i ubuntu nego windoze, zar ne :) ?</p><p>Neki ozbiljniji odgovor, drugom prilikom. "Stay tuned", što bi naš narod rek'o</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Dec 15 2010, 11:45 PM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>na videu sam uhvatio chat sa kolegom. on pojma nije imao da će ovakvo što osvanuti na videu. <br />Jutros sam taj "reality show" pristup ponovo primijenio. Evo našeg chat-a:<p>hernad: bjasko osvano si na youtube-u<br />bjasko: jesam li<br />bjasko: trebao sam se obrijati<br />bjasko: heheh<br />hernad: vjeruj da nisi<br />hernad: <a href="http://hernad.bring.out.ba/radni-dan-u-bringout" rel="nofollow">http://hernad.bring.out.ba/radni-dan-u-bringout</a><br />hernad: sviđa li vam se ovaj članak ?<br />- 08:17 -<br />bjasko: evo čitam povelik je<br />hernad: vi sutra dolazite  u sa ?<br />bjasko: trebali bi da počistimo tih stvari <br />bjasko: ima i ta roba i računari za čagu <br />hernad: da to treba na vrijeme pripremati<br />hernad: planirajte sa<br />bjasko: ok<br />bjasko: dobar ti ovaj erp web, ovo nešto brzo nije java <br />- 08:23 -<br />hernad: dobar jašta<br />hernad: pa rekao sam da je cilj najbolji ERP na bosanskom tržištu<br />hernad: momci momci ni vi mi ne vjerujete ccc<br />hernad: pročitao si članak ?<br />hernad: kada bi bio informatičar koji traži posao, kako bi ovo prokomentarisao ?<br />hernad: budi iskren sa indeksom hernad=1<br />bjasko: pa prvo odmah se vidi, ne samo iz ovog posta, da si uvijek iskren <br />- 08:30 -<br />bjasko: legenda si sa ovim marsovcima <br />vsasa: he he<br />hernad: a jesam li uspio dočarati naš način rada ?<br />bjasko: jesi <br />hernad: članak je pravo dugačak, je li ti u datom momentu bilo "fjaka" čitati ... opet kažem zamisli da si posjetilac "sa strane"<br />bjasko: hehe teško je sad to sa strane  se ufurati <br />hernad: ma jest' u pravu si<br />bjasko: ko prvi puta čita nešto od tebe  mislit će da si puk'o<br />hernad: hehe znam<br />bjasko: a ko zna tvoje radove od prije to je već druga stvar <br />- 08:35 -<br />hernad: ma dobro, rekao sam vam da bring.out neće ići na konvencionalni način zapošljavanja<br />hernad: nismo konvencionalni u mnogo čemu, pa nećemo ni u  tome<br />bjasko: mi smo nekonvencionalna firma<br />bjasko: trebamo u memorandum stavit'<br />hernad: krenuo sam ovo pisati sa jednom mišlju, da bih na kraju skontao: pa hajde da ljudima objasnim kako mi to radimo<br />hernad: pa kada neko ovo pročita ko nije kompatibilan sa nama, neće mu pasti na pamet da kaže: "ja bih ovdje radio". ako ima klijent "freak" filter, neka bude i insajder freak filter<br />hernad: zato mi je baš drago što sam nešto ovakvo napisao<br />hernad: sa sličnom namjerom sam napisao i ovaj članak <a href="http://hernad.bring.out.ba/miletova-japanska-chenifa-i-cestit-posao" rel="nofollow">http://hernad.bring.out.ba/miletova-japanska-chenifa-i-cestit-posao</a><br />hernad: naravno, ko je "plićak", on će pročitati samo "chenifa", a ko zna pročitati od početka do kraja, njemu će zapasti "čestit posao"<br />bjasko: moglo bi se na prvo čitanje pomisliti  nekonvencionalni, pomalo buntovni, ekscentrični <br />hernad: a vi dobro znate šta znači u bring.out čestit posao :-)<br />bjasko: znamo <br />hernad: danas je lijep dan, aBd, danas je knowhow dan, vomzdra, ne dirajte me ako vam nije priša ... i radite brate nešto</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Dec 16 2010,  8:27 AM</div>
<div class='response_name'>herniFun responded:</div>
</div>
<div class='response_body'>Hernada cemo predloziti za IT osobu godine u BiH, Siguran sam da mu popularnost drasticno raste, bwt ovo je jako dobar marketinski potez.<br />Svaka cast ; )</div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Dec 16 2010,  1:52 PM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>@herniFun, <a href="http://hernad.bring.out.ba/bringout-marketing" rel="nofollow">http://hernad.bring.out.ba/bringout-marketing</a></div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>