<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../index-13.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/krojac.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Neću da budem fikus</h3>
<div class='post_info'>
<span class='post_time'>December 10 2010,  5:47 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Moj babo na "izlete" tipa <a href="/bh-telecom-i-sudnji-dan">"BH Telecom i Sudnji dan"</a>&nbsp; odgovara uvijek slično:</p>
<blockquote class="posterous_short_quote">
<p>Da, u pravu si. Al' žao meni je &scaron;to se tro&scaron;i&scaron; na to. De ti ganjaj to &scaron;to je bitno.</p>
</blockquote>
<p>Ključna riječ predhodne rečenice meni je:</p>
<blockquote class="posterous_short_quote">
<p>Bitno.</p>
</blockquote>
<p>Moj babo je u pravu. Ja imam drugačije kalibrirane senzore bitnosti. Ono &scaron;to su meni krupnice, drugima su sitnice.</p>
<p><!--more-->Nakon takvih savjeta se počnem presabirati(*). Na kraju uvijek dođem do istog. Vi "normalni", za&scaron;to mi, kad ste takvi cooler-i ne odgovorite:</p>
<blockquote class="posterous_short_quote">
<p>Zar sudbina moje djece nije bitna ?! Zar sistem obrazovanja moje zemlje nije bitan ?!</p>
</blockquote>
<p>Iza toga redovno sljedi komentar:</p>
<blockquote class="posterous_short_quote">
<p>Ma ne kažem da nije bitno, ali ti tu ni&scaron;ta ne može&scaron; uraditi.</p>
</blockquote>
<p>Pa čekaj malo. Ko može !? Valentin Incko !? Barack Obama !? Na takve konstatacije se "upalim k'o sijalica".</p>
<p>E sada, <a href="/odakle-ja-na-fit-u">moj babo je moj fun</a>. Nema ama ba&scaron; nikoga na dunjaluku ko mi vi&scaron;e dobro želi, ko mi je veća podr&scaron;ka. Kako to da se toliko razlikujemo ?!<p />Stvari o kojima pričam su bitne. Te stvari me svaki dan "&scaron;amaraju". I ne samo mene. &Scaron;amaraju one većinu Bosanaca, ali malo ko kaže:</p>
<blockquote class="posterous_short_quote">
<p>Daj ba prestanite lupetati. Dosta vi&scaron;e !</p>
</blockquote>
<p>Zato, prije nego mi bilo ko predloži da malo "popustim", neka mi odgovori na ova pitanja:</p>
<blockquote class="posterous_medium_quote">
<p>Nebitno je &scaron;to djeca zavr&scaron;avaju fakultete i znanje im je, u najboljem slučaju k'o &scaron;vajcarski sir ?!<p />Nebitno je &scaron;to je državna administracija nemarna i bahata ?!<p />Nebitno je &scaron;to je uobičajeno mi&scaron;ljenje da se u biznisu mora malo slagat'&nbsp; ?!<p />Nebitno je &scaron;to ne posjedujemo osnovnu kulturu komunikacije(**) !?</p>
<p>Nebitno je &scaron;to krađu ne zovemo krađa(***) !?</p>
</blockquote>
<p>I kad sve ovo gore saberemo:</p>
<blockquote class="posterous_short_quote">
<p>Nebitno je to &scaron;to smo dru&scaron;tvo koga nije briga, dru&scaron;tvo neznanja, dru&scaron;tvo poremećenog sistema vrijednosti ?!</p>
</blockquote>
<p>Babo, znam tvoje odgovore na ova pitanja. Znam da i ti ove stvari smatra&scaron; bitnim. Zato te molim da shvati&scaron; da je ovo &scaron;to radim borba protiv bitnih stvari. Hoće li to &scaron;to radim za "zehru" promijeniti na&scaron;e stanje ? Ne znam. I ne pitam se previ&scaron;e.</p>
<p>Međutim, ako ni&scaron;ta ne poduzmem onda se garant ni&scaron;ta neće promijeniti. Onda sam objekat a ne subjekat. Onda sam "fikus". Onda ću i moju djecu trenirati da budu "fikusi". E ne dam.</p>
<p>Ako &scaron;ta pametnije smislim da učinim, ja ću promijeniti taktiku. Prestaću "palamuditi". Samo mi, molim te, nemoj predlagati da se "poklopim u&scaron;ima". Ti dobro zna&scaron; da ja to ne mogu.&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>Bez "žaoka</strong></span>"</p>
<p>Kada si pročitao članak sa vrha ovog teksta, prokomentarisao si:</p>
<blockquote class="posterous_short_quote">
<p>Dobro bi bilo da si ovo "bez žaoka", napisao. Ljudi bi te prije saslu&scaron;ali. Ljudi su sujetni. Kada ih napadne&scaron; oni vi&scaron;e neće da slu&scaron;aju.</p>
</blockquote>
<p>Slično kako sam u jednom <a href="/gorka-istina">ranijem članku odgovorio</a>, odgovoriću i tebi:</p>
<blockquote class="posterous_short_quote">
<p>Nemamo mi vi&scaron;e vremena za lijepo upakovane priče. Mi smo u hendeku.&nbsp;</p>
</blockquote>
<p>Neko mora "vri&scaron;tati" na ove stvari i bacati "žaoke". Meni je izgleda suđeno da budem taj.&nbsp; Iako atipičan Bosanac po mnogo čemu, zavr&scaron;iću riječima koje se kod nas često čuju:</p>
<blockquote class="posterous_short_quote">
<p>Džaba ti sve, ja sam tak'i čo'jek.</p>
</blockquote>
<p>----</p>
<p>(*) istina sve manje i manje ...</p>
<p>(**) Kada te neko ne&scaron;to pita, odgovori mu ! Kada ti se po&scaron;alje email, ne mora&scaron; odmah dati pun odgovor, ali može&scaron; reći: Hvala, primio sam va&scaron; email, detaljnije ću odgovoriti u narednih 5 dana, 10 dana, mjesec dana ... NIKADA ... Sve je to bolje od no-answer.</p>
<p>Naučite to <a href="/dopisi-drzavnim-institucijama">državni službenici</a>, nauči to <a href="/uciteljica-nina">učiteljice Nina</a>, naučite to dragi moji poslovni partneri. Ja drčan i bezobrazan ? Izvinite al' vi ste napravili najobičniju zamjenu teza. Nema nikakve razlike između spu&scaron;tanja slu&scaron;alice u telefonskom razgovoru i neodgovaranja na email upit. Onaj ko ne odgovara je nekulturan, a ne onaj koji traži odgovor.</p>
<p>(***) Kr&scaron;enje autorskih prava je <a href="/veliki-musliman-i-software">krađa</a>. I tačka.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, dunjaluk, moj_babo</div>
</div>
<div class='post_responses'>
<h4>2250 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
