<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2010/12/hello-world.html">Previous</a>
&nbsp; 
<a href="../../../index-13.html">Index</a>
&nbsp; 
<a href="../../../posts/2010/12/koncept-predmeta-statistika-i-vjerovatnoca-na.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Statistika, 1. parcijalni, ispit</h3>
<div class='post_info'>
<span class='post_time'>December  7 2010,  6:21 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><span style="text-decoration: underline;"><strong>Noć i jutro uoči ispita </strong></span><p />Za razliku od svih drugih ispita koje sam spremao, kod ovog sam ostao do dva sahata ujutro. Takav režim vi&scaron;e nije za mene.<p />Za razliku od uobičajenog režima, kad nakon sabaha jo&scaron; malo otkunjam, to jutro sam odmah napravio kahvu i sa Dženanom počeo pretresati gradivo.</p>
<p><!--more-->Dženana je krenula postavljanjem pitanja, ali sam ja na svako njeno pitanje govorio: "Dobro, de mi reci koji je odgovor ..."<p />U glavi mi je bila totalna konfuzija. Iako sam ostao uveče dokasno, ni&scaron;ta od onoga &scaron;to sam prvobitno planirao nisam pro&scaron;ao. <p />Kad se sve sabere, najvi&scaron;e radio po Đapinim predavanjima(*). Tamo negdje iza pola noći sam od&scaron;tampao FIT predavanja i kri&scaron;om ih pre&scaron;ao.<p />Ukratko moje "znanje" je bilo pravi franke&scaron;tajn: nit' sam u potpunosti skontao Dženanu i Đapu, a jo&scaron; manje Pra&scaron;u.<p />&Scaron;to se tiče FIT video materijala - to nisam ni otvorio.<p />Zato mi je ujutro bukvalno plovio statistički ko&scaron;mar ... Zato sam se usmjerio na to da Dženanina pitanja bez plaho razumjevanja poku&scaron;am <a href="/genijalac">memorisati</a>.</p>
<p>Kako je to jutro bila prisiljena čitati FIT materijale, i Dženana se poprilično uznemirila - "prolupala". Na osnovu toga sam napisao <a href="/koncept-predmeta-statistika-i-vjerovatnoca-na">predhodni članak</a>.<p /><span style="text-decoration: underline;"><strong>Put Mostar-Sarajevo</strong></span><p />Na ispit sam i&scaron;ao sa svojim mladim kolegama <a href="/emir-i-berin">Emirom i Berinom</a>.&nbsp; Berin je krenuo na OEK koji mu je ostao iz 1. godine.&nbsp; <p />Ja i Emir smo počeli pričati o statistici. Krenem ga "bockati" pitanjima. Ja počnem: "Ova Statistika, ovo je katastrofa ...".</p>
<p>Emir prihvati:&nbsp;</p>
<blockquote class="posterous_short_quote">
<p>Ufff ... konfuzija brate. Vježb'o sam jutros do 4. Evo me nosa pravo ... Na&scaron;ao sam ona pitanja teoretska, pa sam ih vježbao.</p>
</blockquote>
<p>Onda meni sinu:</p>
<blockquote class="posterous_short_quote">
<p>Je li ti problem da ta pitanja uzme&scaron;. Ja sam ti te&scaron;ka truba i konfuzija. Kad bi ti to nama i&scaron;čitao, možda &scaron;tagod i zapamtim.</p>
</blockquote>
<p><br />I onda je Emir počeo čitati ... pa ja njega vraćao: "De ponovi ... deder vidi &scaron;ta pi&scaron;e u knjizi ...". <p />Tako smo većim dijelom puta pro&scaron;li kroz teoriju. Emire, hvala :)<p /><span style="text-decoration: underline;"><strong>Ispit</strong></span><p />Ispit traje 1:40 minuta. Ima 4 zadatka.<p />Prvi zadatak je set od 10-tak teoretskih pitanja. Zatim idu tri praktična zadatka.<p /><span style="text-decoration: underline;"><strong>Teorija</strong></span><p />Postoji set teoretskih pitanja koja se vrte. Studenti nagla&scaron;avaju da je bitno da ti odgovori budu kratki. Ja međutim nisam tu sugestiju prihvatio.<p />Odgovarao sam na "svoj" način. Ba&scaron; me interesuje kako će se ovaj dio ocijeniti.<p />Recimo imali smo pitanje:</p>
<blockquote class="posterous_short_quote">
<p>Radni list.</p>
</blockquote>
<p><br />Ja sam na to pitanje odgovorio:</p>
<blockquote class="posterous_medium_quote">
<p>Prema Va&scaron;im materijalima, Radni list (eng. "Sheet") je pojam koji se koristi za da označi jedan dio MS Excel dokumenta (koji se opet kod vas označava kao "Radna knjiga").&nbsp; Tako su Radni listovi ovog dokumenta: "Identifikacija, Zad1, Zad2 ... Zad4".</p>
</blockquote>
<p><br />Odgovor definitivno nije ono &scaron;to studenti preporučuju, niti profesor očekuje :)</p>
<p>Za&scaron;to sam tako odgovorio ?</p>
<p>"&Scaron;ta je to "Radni list" u MS Excel aplikaciji ?"&nbsp; je potpuno pitanje. Pitanja treba formulisati na taj način da i oni koji nisu pročitali materijale, a tu materiju poznaju, mogu dati odgovor. <p />Znam, znam, znam. Znam da se trebaju uzeti nastavni materijali. Ali ispiti ipak ne mogu biti ispiti znanja o tome:</p>
<blockquote class="posterous_short_quote">
<p>Da li ste pročitali knjigu nastavnika ?</p>
</blockquote>
<p>O tome sam već ranije pisao u članku <a href="/uos-pitanja-sta-me-briga">UOS pitanja &scaron;ta me briga ?!</a>. Ova pitanja su me i načinom i sadržajem neodoljivo podsjećala na pitanja iz UOS-a za koje sam rekao: &scaron;ta me briga ?!</p>
<p>Pitanja moraju dati odgovor na pitanje:</p>
<blockquote class="posterous_short_quote">
<p>Znate li materiju koju smo obradili ?</p>
</blockquote>
<p><br />Zato sam ja na pitanja kao &scaron;to je:</p>
<blockquote class="posterous_short_quote">
<p>Op&scaron;ta aritmetička sredina.</p>
</blockquote>
<p>odgovarao na slijedeći način:</p>
<blockquote class="posterous_medium_quote">
<p>Va&scaron;a literatura(*) pominje termin op&scaron;ta (sinonim: ponderisana, frekvencijska) aritmetička sredina za proračun aritmetičke sredine kod skupa rezultata grupisanih po frekvencijama. Koristi se formula SUM(Xi*fi) / N, gdje je Xi - grupa rezultata koja ima određenu vrijednost, fi - frekvencija ponavljanja tog rezultata, N - ukupan broj mjerenja</p>
</blockquote>
<p>Dodatno sam u fusnoti(*) stavio ne&scaron;to kao: "Prema mom mi&scaron;ljenju aritmetička sredina je jedan pojam, bez obzira na način proračuna".<br />&nbsp;<br /><span style="text-decoration: underline;"><strong>&Scaron;to mi je trebalo da ovako "palamudim" ?</strong></span><p />1) Uvijek odgovaram na ovaj način. Smatram da ovakav odgovor jedini kaže KAKO vladam materijom. Svaki drugi odgovor je za mene isto kao da pjevam pjesmicu. A ja u tom pjevanju <a href="/genijalac">često zaboravim neku riječ</a>.<p />2) S obzirom da je koncept ispita krajnje nekompatibilan sa onim smatram korektnim ispitom, uzeo sam sebi za zadatak da ispitam &scaron;ta mogu u narednom roku očekivati.</p>
<p>Tato sam se na teoretskim pitanjima puno zadržao. Čitav sahat sam pisao. Na kraju sam neočekivano odgovorio na sva pitanja!</p>
<p>Koliko sam "lupio", ne znam. Mislim da sam definitivno pre&scaron;ao prag 60%, sa mog stani&scaron;ta, tačnih odgovora.<p />Naime, moguće je da će moje konstrukcije izazvati ocjenjivanje: "E evo tebi pametnjakoviću 0 poena, pa ti onda izražavaj svoje mi&scaron;ljenje".<p />Vidjećemo. To me ba&scaron; interesuje.<p /><span style="text-decoration: underline;"><strong>Zadatak bazni, lančani indeksi</strong></span><p />Sljedeći sam uzeo zadatak sa baznim i lančanim indeksima/statistika-bazne-i-lancane-stope. To je jedna od rijetkih tema koje pripremio.<p />Njega sam kompletnog uradio.<p /><span style="text-decoration: underline;"><strong>Zadatak aritmetička sredina, standardna devijacija</strong></span><p />Nakon toga sam uzeo zadnji zadatak. Zadatak je bio ovakav:<p /><p><a href="https://gist.github.com/730536">https://gist.github.com/730536</a></p><p />Kako sam na tu temu <a href="/statistika-prvi-cas-sa-profesoricom-dzenanom">radio sa Dženanom</a>, mislio sam da to znam.<p />Nažalost, tu&nbsp; sam se žestoko "izlupetao" :(<p />Krenuo sam da utvrđujem razredne sredine "do 1.g", "2-3", "3-4" .. i tu sam uočio da postoje rupe.<p />Onda sam u postavci zadatka rekao:</p>
<ol>
<li>Mora biti kontinuitet razreda (&scaron;to je pretpostavljam tačno)</li>
<li>Pretpostaviću da ne postoje vozila koja su starija od 30 godina, na cesti</li>
</ol>
<p><br />razredi: 0+(1.99-0.0)/2 = 0.995, 2+(3.99-2.0)/2 = 2.995, 4+(5.99-4)/2 = 4.995, 6+(10.99-6)/2 = 8.495,&nbsp; 11+(15.99-11)/2 = 13.495, 16+(30-16.99)/2 = 22.505, 16 + (30-16)/2 = 23<p />E sada pretpostavka 2)&nbsp; je bila totalna budale&scaron;tina :(. Moja izmi&scaron;ljotina. Kasnije ću nazvati Dženanu, i ona mi je odmah rekla: "To se Ernade u Statistici tako ne radi ... Pa pokazala sam ti ..."<p />I stvarno. Ja sam na&scaron;ao neke ranije ispitne zadatke pa sam joj ranije da mi ih rije&scaron;i. Ona je to rije&scaron;ila, ali ja to jednostavno nisam ni pogledao :(<p />Ajoj ... kad sam to skontao, bilo mi je pravo krivo &scaron;to me je asistentica <a href="/da-li-kolege-nastavnici-na-fit-u-znaju-sta-zn">Nina tu&scaron;irala</a>.<p />Da nakon njenog tu&scaron;a nisam izgubio čitavo poslijepodne na "triježnjenje", jo&scaron; bih stigao pogledati i te zadatke koje koje je Dženana rije&scaron;ila. Da sam tu uradio, zadatak bih vjerovatno uradio kako treba.<p />Ubrzo presabrao: "Ma budi zadovoljan. Kakav si krenuo, mogao si biti čista 0. Ovo je, kad se sve sabere, odličan rezultat. K'o lav si se borio. &Scaron;to si&nbsp; znao, to si i uradio."<p />U ovom zadatku je bio zadatak uraditi i grafički prikaz rezultata, gdje se, pored ostalog, tražio grafički prikaz standardne devijacije. Znao sam da je standardna devijacija broj, tako da je trebalo prikazati ne&scaron;to drugo. Pa sam poku&scaron;ao po sjećanju utvrditi z-vrijednosti. Ali tu sam se zapetljao. Na kraju sam ne&scaron;to dobio, ali to je takođe najvjerovatnije bilo opet čisto "lupetanje".<p />Čak sam grafikon tih z vrijednosti (pojma nemam &scaron;ta sam ja dobio, ja sam to vabio z vrijednosti :)) poredio sa godi&scaron;tima, pa sam taj dijagram i protumačio - konstatovao kako z vrijednost visoko korelira sa starosti vozila.<br />&nbsp; <br />To sam rekao Dženani nakon ispita, a ona me je pitala: "Pa je li to uop&scaron;te normalna distribucija ?". "Pojma nemam", odgovorio sam. "To je već bio fini&scaron; ispita, tako da se nisam mogao plaho presabrati", dodao sam na kraju. Uh, fakat sam se izlupetao. <p />Ali dobro, tako je to kada čovjek ne "svari" stvar. Ja ovo definitivno nisam svario.<p /><span style="text-decoration: underline;"><strong>Zadatak Anketa</strong></span><p />Ovaj zadatak sam ostavio za kraj, jer ovakve zadatke ni pogledao nisam tokom priprema ispita. Znam da oni ne mogu biti te&scaron;ki, ali je problem kada to nikada do sada nisi gledao, kao &scaron;to je to slučaj bio kod mene.<p />Za njega mi nije ostalo nimalo vremena, tako da ga nisam ni poku&scaron;ao uraditi.<br />&nbsp;<br /><span style="text-decoration: underline;"><strong>Rezime</strong></span><p />Zadovoljan sam kako sam uradio ispit. Nisam bio "blećak" koji je pogledao ispit i oti&scaron;ao, a bojao sam se da će se upravo to desiti. <p />Ponosan sam na sebe &scaron;to sam tokom puta, uz Emirovu pomoć, pripremio teoriju. Eto, i ja mogu učiti sistemom: "pjevam pjesmicu".<br />S obzirom na sve okolnosti, bio sam super :) <p />&Scaron;to se tiče poređenja ovog ispita sa drugim, interesantno je da sam na njega utro&scaron;io daleko najvi&scaron;e vremena.<p />Međutim, njegov <a href="/koncept-predmeta-statistika-i-vjerovatnoca-na">koncept</a> je problematičan, i to mi predstavlja veliki problem.<p />Ovaj ispit normalan student može spremiti na sljedeći način:</p>
<ol>
<li>"nabubati" teoriju</li>
<li>prevježbati zadatke, jer se stalno ponavljaju isti zadaci sa sitnim varijacijama</li>
<li>ne postavljati sebi pretjerano pitanja <a href="/stastika-ovo-mi-se-nista-ne-svida-prasologija">&Scaron;TA, ZA&Scaron;TO</a>, posebno kod teorije.</li>
</ol>
<p><br />Rezltat će biti ocjena u indeksu, al' &scaron;to se tiče znanja o statistici - na to zaboravite.<p /><span style="text-decoration: underline;"><strong>Emir</strong></span><p />Emir je dobro uradio ispit. On bi trebao položiti. To mi je pravo drago.</p>
<p><span style="text-decoration: underline;"><strong>Berin</strong></span></p>
<p>Berin je lo&scaron;e uradio OEK. &Scaron;teta. Uh, on taj ispit ni&scaron;ta nije spremio. Al' kad se prisjetim gradiva, nemam mu srca previ&scaron;e prigovarati.</p>
<p>----<br />(*) doc.dr. Nermin Đapo, predavač na Psihologiji.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>fit_2_godina, fit_mostar, ispit</div>
</div>
<div class='post_responses'>
<h4>Pregleda 1637, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
