<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/04/zamislite-ovakvu-poreznu-upravu-fbih.html">Previous</a>
&nbsp; 
<a href="../../../index-8.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/04/screencast-windows-aplikacije-na-ubuntu-deskt.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Porezna uprava FBiH: "Problem fiskalizacije nije 'naš rejon' ... Obratite se Ministarstvu Finansija"</h3>
<div class='post_info'>
<span class='post_time'>April 11 2011,  6:04 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Jutros nam se pojavio jedan problem po pitanju fiskalizacije:</p>
<p>Radi razlika u zaokruženju, postoje situacije u kojima "stara" porezna faktura i fiskalni isječak "ne &scaron;timaju" za znatan iznos.</p>
<p>Obratio sam se, pored ostalih Poreznoj upravi FBiH, i dobio odgovor da oni za to nisu nadležni:</p>
<p><a href="http://redmine.bring.out.ba/boards/8/topics/4954?r=4969#message-4969">http://redmine.bring.out.ba/boards/8/topics/4954?r=4969#message-4969</a></p>
<p>U prvom momentu sam prihvatio to, jer sam svjestan da je <strong>Porezna uprava implementator zakona</strong>, a ne <strong>zakonodavac</strong>.</p>
<p>Međutim, koliko god to bilo tačno sa jedne strane, kada se stvar posmatra u cijelini to ba&scaron; i nije tako ...</p>
<p>Zato sam krenuo da napi&scaron;em novi email kolegi informatičaru iz Porezne uprave:</p>
<p><!--more--></p>
<blockquote>
<p>Po&scaron;tovani,<br /> shvatam da je Va&scaron;a institucija implementator zakona, te da nas radi toga upućujete na Ministarstvo.<br /> Međutim, ipak postoji dio koji je u nadležnosti Porezne uprave. Zato ću preformulisati pitanje:<p />  Kako se va&scaron;i inspektori postavljaju u ovakvom slučaju ?<br /> Koji je dokument "jači" ? Porezna faktura ? Fiskalni isječak ? Nijedan ?<p />  Na&scaron; klijent je, nakon &scaron;to je konstatovao razliku, panično tražio od nas  instrukcije da uradi storniranje dokumenta. To sve stvar dodatne  komplikacije i probleme kod njega i kod nas. Mi smo blokirani jer  korisnik od nas očekuje rje&scaron;enje, korisnikov posao stoji jer ne može  ispostaviti fakturu ... zbrka živa.<p />  A za&scaron;to ? <br /> 1) Zato &scaron;to&nbsp; Zakon o fiskalizaciji bez dvojbe ima rupa k'o &scaron;vicarski sir<br /> 2) Zato &scaron;to se porezni obveznici gotovo iracionalno boje inspektora Porezne uprave(*). <p />  Zato bi od Va&scaron;e institucije morali dobiti informacije koje će ovu zbrku,  probleme i nervozu svesti na najmanju moguću mjeru. Mislim da to JESTE  "va&scaron; rejon" i va&scaron;a obaveza.<p />  Da rezimiram:<p />  Molim da Porezna uprava da informaciju poreznim obveznicima i svojim  inspektorima&nbsp; &scaron;ta treba poduzeti dok se po ovom praktičnom problemu ne  očituje zakonodavac - Ministarstvo.&nbsp; <p />  <span style="color: #ff0000; font-size: medium;"><strong>Obaveza Va&scaron;e institucije je implementacija zakona na terenu. Kada su ti  zakoni manjkavi, ili se tek uvode, logično je da pored mjera represije  (kažnjavanja u slučaju kr&scaron;enja zakona) *pomognete* poreznim obveznicima u  ovakvim situacijama. </strong></span><p />  Vi ste ti koji &scaron;alju svoje porezne insepktore. Ti porezni inspektori u  ovakvim situacijama postupaju *<strong>nekako</strong>*. Postavlja se pitanje <strong>KAKO ?</strong><p />  Valjda nije "rje&scaron;enje" reći poreznom obvezinku: "<em><strong>Zaustavi posao dok se ovo ne rije&scaron;i ?!</strong></em>"<p />  Obraćam Vam se kao informatičar informatičaru. Nas dvojica možemo  napraviti link između va&scaron;ih radnih kolega - poreznih inspektora i na&scaron;ih  klijenata - poreznih obveznika.<p />  Paradoks je da najveću paniku dižu upravo oni radi kojih je ova  fiskalizacijaka "halabuka" bila skroz suvi&scaron;na - oni koji su i do sada  uredno evidentirali sav svoj promet. <br /> ---<br /> <span style="font-size: x-small;"><em>(*) Naravno, ovo je&nbsp; prije svega stvar stava samih poreznih obveznika,  ali i općeg odnosa na relaciji porezni obveznik - inspektor</em>. Inspektori Porezne uprave su trenirani da porezne obveznike kažnjavaju. Prava  je rijetkost da sa terena čujem da je neki porezni inspektor dao  savjete na&scaron;em korisniku ako ne&scaron;to nehotice grije&scaron;i.</span><p /> </p>
</blockquote>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">Kada sam zavr&scaron;io email, uočio sam da sam ustvari formulisao jedan standardni problem na relaciji:</div>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">Zakonodavac (Ministarstvo Finansija) &lt;-&gt; Implementator zakona (Porezna uprava personificirana u poreznim inspektorima) &lt;-&gt; software provajder (bring.out) &lt;-&gt; Porezni obveznik (bring.out klijent)</div>
<p />
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;"><span style="text-decoration: underline; font-size: medium;"><strong>Zaključak </strong></span></div>
<p />
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">U ovakvim situacijama, niko ne bi smio reći:</div>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">
<blockquote class="posterous_short_quote">Nije moj rejon !<br /></blockquote>
</div>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">Obaveza Zakonodavca, Implementatora zakona, Software provajdera mora biti:</div>
<blockquote>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">Pomoći poreznom obvezniko da svoj posao radi sa &scaron;to manje pote&scaron;koća.</div>
</blockquote>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">To opet ne smije biti stvar dobre volje pojedinaca, nego sljedeće činjenice:</div>
<blockquote>
<div style="font-family: Times New Roman; font-size: 12pt; color: #000000;">Sve nas ti porezni obveznici hrane. Mi radimo za njih a ne oni za nas. Zato su ovakvi problemi rejon SVIH NAS !</div>
</blockquote>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>administracija, bosna, business, sistem</div>
</div>
<div class='post_responses'>
<h4>9985 views and 1 response</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Apr 11 2011,  9:09 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'><a href="http://hernad.bring.out.ba/zamislite-ovakvu-poreznu-upravu-fbih" rel="nofollow">http://hernad.bring.out.ba/zamislite-ovakvu-poreznu-upravu-fbih</a></div>
</li>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
