<item>
	<title>Legalizacija i bosanski IT provajderi</title>
	<link>http://hernad.bring.out.ba/legalizacija-i-bosanski-it-provajderi</link>
	<pubDate>Fri Mar 16 23:45:00 -0700 2012</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bring.out"><![CDATA[bring.out]]></category>
	
		<category domain="tag" nicename="business"><![CDATA[business]]></category>
	
		<category domain="tag" nicename="dunjaluk"><![CDATA[dunjaluk]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/legalizacija-i-bosanski-it-provajderi</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Prije par dana imali smo prvi poziv vezano za legalizaciju software-a.</p>
<p>Korisnik na&scaron;ih aplikacija nas je u panici pitao:</p>
<blockquote class="posterous_short_quote">
<p>Radi li FMK(*) pod Ubuntu/Linux-om -om ?</p>
</blockquote>
<p>Nakon tog pitanja slijedilo je isto pitanje od strane lokalne firme koja prodaje računare.</p>
<p>Kako ista firma isporučuje računare na&scaron;em klijentu, nije bilo te&scaron;ko "sklopiti kockice" da sva pitanja dolaze iz istog izvora.</p>
<p>U tom trenutku sam shvatio da je namjera Države da bude &nbsp;Microsoft &amp; Autodesk inkasant ozbiljna.</p>
<p>Ali neću o tome pisati. To je valjda svima jasno (Da li je ?!)</p>
<p>Pisaću o pona&scaron;anju kupaca i prodavaca hardware-a.</p>
<p><!--more--></p>
<p>Na&scaron;a aplikacija je instalirana na nekoliko računara "tajvanaca"(**) kupljenih prije par godina.</p>
<p>Računare je isporučio taj isti provajder sa piratskim windowsima. I podesio na njima sve "džidža-miđe" koje, Bože moj, svaki računar (do sada) ima(o): Microsoft Office, Corel.</p>
<p>Trži&scaron;na vrijednost pojedinačnog računara &nbsp;je 100-200 KM.</p>
<p>Prodavac računara, koji je praktično i uvalio klijenta u ovu situaciju (uz odobrenje ili neznanje klijenta, kako god) dobija ponudu koja je otprilike ovako zvučala:</p>
<p>Eto, država sad traži legalno. Imate dvije opcije:</p>
<blockquote class="posterous_medium_quote">
<p>1) legalizirajte "Windowse". To će vas ko&scaron;tati 400 KM + PDV po računaru</p>
<p>2) Instaliraćemo vam "Ubuntu/Linux" OS za 50 KM + PDV po računaru</p>
<p>3) Provjerite sa proizvođačima knjigovostvenog software-a da li njihov software radi pod Ubuntu-om. Ako ne radi, nije do nas - to oni trebaju obezbjediti.</p>
</blockquote>
<p>Da li su im njihovi "hardvera&scaron;i" pomenuli da se nov računar sa preinstaliranim legalnim OS-om može nabaviti za 600-700 KM, &nbsp;te da je u tom smislu poprilično besmisleno plaćati legalizacijsku markicu 400 KM ?</p>
<p>Da li su im objasnili, &scaron;to je slučaj sa većinom bosanskih IT provajdera, da nemaju nikakvo iskustvo u podr&scaron;ci "Ubuntu/Linux" sistema ?</p>
<p>Da li su im objasnili da &nbsp;svako slobodno može download-ovati Ubuntu instalacijski CD i sa "next-next" uraditi to isto &scaron;to će i oni uraditi (***) ?</p>
<p>Sumnjam.</p>
<p>Sumnjam zato &scaron;to su se na kraju klijenti odlučili za varijantu 1.</p>
<p>U međuvremenu smo mi pripremili ponudu u kojoj smo klijentu ponudili:</p>
<ol>
<li>Instalaciju ubuntu/Linux sa obezbjeđenom podr&scaron;kom</li>
<li>Migraciju na&scaron;eg starog programskog rje&scaron;enja na novo</li>
<li>Migraciju podataka iz ranijih godina na novo rje&scaron;enje</li>
</ol>
<p>Cijena na&scaron;e ponude bila je duplo manja od cijene legalizacijskih markica.</p>
<p>Međutim, u strahu od kazne klijent nije ni dočekao na&scaron;u ponudu.</p>
<p>Noć prije nego je uop&scaron;te dočekao na&scaron;u ponudu kupio je legalizacijske markice. Ukatko odabrao je najgore rje&scaron;enje.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Ko je kriv ?</span></strong></span></p>
<p>Mi, zato &scaron;to smo nismo izbacili ponudu "iz rukava" &nbsp;?</p>
<p>Korisnik koji je donio lo&scaron;u odluku ?</p>
<p>Hardware provajder koji je svom klijentu naplatio "taksu za budale" ?</p>
<p>Ja znam za&scaron;to smo mi "zakasnili" sa ponudom. Nismo htjeli davati ponudu bez analiza potreba i svega onoga &scaron;to treba poduzeti da bi se korisniku na potpuno novoj platformi obezbjedile funkcije koje ima.&nbsp;Od početka smo bili svjesni da je migracija na novi operativni sistem i novo programsko rje&scaron;enje ogroman posao.&nbsp;</p>
<div><span style="text-decoration: underline; font-size: medium;"><strong>Ko je pametan ?</strong></span></div>
<p />
<div>Hadware provajder je dobro zaradio prodajom Microsoft markica.</div>
<p />
<div>Komeracijalno gledajući, zaradili su par stotina maraka za posao od 10 minuta, od čega je najvi&scaron;e vremena utro&scaron;eno na to da se makice donesu i nalijepe na računar klijenta.</div>
<p />
<div>Ekstra profit, nema &scaron;ta.</div>
<p />
<div>Stoga, gledajući isključivo ishod čitave priče, kolege hardvera&scaron;i su genijalci, a mi zadnji "tupsoni".&nbsp;</div>
<p />
<div>Oni su za par minuta stavili par stoja u "padže", mi se pripremali za ponudu dva dana i izgubili posao.</div>
<p />
<div>Međutim, i pored toga ja ne vidim hardvera&scaron;e kao pametne, nego kao <strong>bezobrazne</strong>.&nbsp;</div>
<p />
<div>Okoristili su se na belajima svog klijenta, ignori&scaron;ući činjenicu da su oni velikim dijelom uzročnici te muke.</div>
<p />
<div>Ako se uzme kao olak&scaron;avajuća okolnost "da su svi tako radili, da su kupci htjeli piratske windowse" opet stoji izostanak profesionalne etike.</div>
<p />
<div>Trebali su pomoći klijentu. Trebali su mu objasniti da je kupovina markica u datoj situaciji najlo&scaron;ije rje&scaron;enje.</div>
<p />
<div>Svog klijenta ne smatram glupim.</div>
<p />
<div>Smatram da su nasamareni.</div>
<p />
<div>---</div>
<p>(*) FMK - na&scaron;a aplikacija za podr&scaron;ku poslovanju</p>
<p>(**) Računari sklopljeni iz dijelova, mi smo to u moje vrijeme zvali "tajvanci", a računare poznatih proizvođača "brand" &nbsp;(od "brand name")</p>
<p>(***) Ako im ne nude podr&scaron;ku, onda IT provajder ne nudi ni&scaron;ta vi&scaron;e od onoga &scaron;to većina korisnika može i sama učiniti ako ubaci Ubuntu instalacijski CD u "go" računar</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Prije par dana imali smo prvi poziv vezano za legalizaciju software-a. Korisnik naših aplikacija nas je u panici pitao: Radi li FMK(*) pod Ubuntu/Linux-om -om ? Nakon tog pitanja slijedilo je isto pitanje od strane lokalne firme koja prodaje račun...]]></excerpt:encoded>	

	<wp:post_date>Fri Mar 16 23:45:00 -0700 2012</wp:post_date>
	<wp:post_date_gmt>Fri Mar 16 23:45:00 -0700 2012</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>112078167</wp:post_id>
	<wp:post_name>legalizacija-i-bosanski-it-provajderi</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
