<item>
	<title> 25 godina hardware-a i software-a</title>
	<link>http://hernad.bring.out.ba/25-godina-hardware-a-i-software-a</link>
	<pubDate>Sun Jun 06 12:58:00 -0700 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="clipper"><![CDATA[clipper]]></category>
	
		<category domain="tag" nicename="etf"><![CDATA[etf]]></category>
	
		<category domain="tag" nicename="nostalgija"><![CDATA[nostalgija]]></category>
	
		<category domain="tag" nicename="zx_spectrum"><![CDATA[zx_spectrum]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/25-godina-hardware-a-i-software-a</guid>
	<description></description>
	<content:encoded><![CDATA[

<h2>80-te i ZX Spectrum 48K</h2>
<p>Kada sam tamo negdje &lsquo;85 (dvadesetok vijeka :)) dobio svoj prvi računar ZX Spectrum 48K, bio sam ubjeđen da ta stvarka može sve.</p>
<p>Evo upravo sada gledam knjigu &ldquo;Spektrum priručnik&rdquo; koja je sva iscufana od silnog čitanja.</p>
<p>Kad malo razmislim, ne znam da sam i&scaron;ta tako i&scaron;čitiavao u narednih 25 godina svog života !?</p>
<p>Vjerovatno bi jedina u konkurenciji bila ruska zbirka zadataka &ldquo;Lja&scaron;ko&rdquo; koju sam koristio za spremanje &ldquo;Matematike I&rdquo; kod Galića na ETF-u. Ali to je bilo zarad polaganja ispita, a na i&scaron;čitavanje Spektrum priručnika me nikad niko nije tjerao.</p>
<p>Svaki novi red je otkrivao novu mogućnost te čudesne sprave.</p>
<p>Limit je bio samo moja ma&scaron;ta i izdržljivost uređaja da podnese moje raznorazne pokuse.</p>
<p>A ti pokusi nisu bili samo ograničeni na prekucavanje koda iz knjige, nego ubrzo i rasklapanja i gledanja &scaron;ta se to &ldquo;pod haubom&rdquo; mog računara nalazi.</p>
<p><!--more--></p>
<h2>ZX80, Ma&scaron;insko programiranje</h2>
<p>Listajući sada knjigu, prisjećam se tih istraživanja.</p>
<p>Poglavlje 4: &ldquo;Programiranja na ma&scaron;inskom jeziku&rdquo;.</p>
<p>Jarane &hellip;</p>
<p>Ne da sam ja to čitao, ja sam to znao !</p>
<h2>Srednja elektrotehnička &scaron;kola &ndash; Bilmi&scaron;će Zenica: Bane Savić</h2>
<p>U srednjoj &scaron;koli sam imao sreću da mi profesor praktične nastave bude Bane Savić.</p>
<p>Bane je bio bio &hellip; jednostavno genijalac.</p>
<p>Za razliku od drugih profesora, koji su po pitanju naobrazbe do&scaron;li do &ldquo;bu&scaron;enih kartica&rdquo; (koliko se sjećam o tome nam je na programiranju pričao Grube&scaron;ić).</p>
<p>Bane Savić se bavio industrijskom elektronikom u Željezari. Za njega personalni računar nije bila nepoznata egzotika. Dapače, on nam je obja&scaron;njavao kakva je moć računara u praksi.</p>
<p>Koji je to bio ouuuuuuuuuu u mojoj glavi.</p>
<h2>ZX Spectrum PIO</h2>
<p>Banetove priče su me totalno zapalile za procesnu elektroniku. Počeo sam tražiti časopise i literaturu koja bi mi pomogla da skontam da li i kako se to  može sa mojim spektrumom raditi.</p>
<p>Dočepao sam se knjige Arhitektura mikroprocesora (žute debele korice) u kojoj su bili pokrivena dva glavna mikroprocesora: ZX80 i men' se čini Motorola (znam da je ona bila procesor u Comodore 64).</p>
<p>I tu sam na&scaron;ao da mi za moje eksperimente to treba PIO &ndash; parallel input output sklop.</p>
<p>Evo mozgam, ali se nikako ne mogu sjetiti &scaron;ta sam ja to htio napraviti.</p>
<p>(Mislim da je to bio sklop kome si stavljao nepoznati otpornik, a on bi A/D konverzijom utvrdio otpornost te prikazao shemu boja za tu otpornost)</p>
<p>&Scaron;ta god to bilo, mi smo Banetu (to je bio zavr&scaron;ni grupni rad u 4.tom razredu) izložili na&scaron; grandiozni plan.</p>
<p>Na sljedećem času, svojim karakterističnim dubokim glasom, Bane je samo rekao: &ldquo;Husremoviću evo ti tvoj PIO&rdquo;.</p>
<p>Isto k'o da mi daje žvaku, a ne sklop koji je u to vrijeme bio prava vrijednost.</p>
<p>Ooouh &hellip;</p>
<p>I mi taj sklop, &scaron;ta god on bio, napravismo &hellip;</p>
<p>Sklopa se ne sjećam, ali se i danas mogu prisjetiti meraka sa kojim sam to radio, i zanosa u kom sam bio.</p>
<p>Bio sam ubjeđen da sa ZX Spectrumom i PIO-m mogu isprogramirati i <em>napraviti</em> &scaron;ta god mi padne na pamet.</p>
<h2>Era IBM PC-jeva</h2>
<p>Moj spectrum je bio ko ratni veteran. Gumena tastatura se već odavno odvajala od ostatka računara, neke tipke su otkazale pa je to premo&scaron;ćavano žicama koje sam zalemio, &scaron;arafi od kući&scaron;ta su se već odavno pogubili.</p>
<p>Već su se počeli pojavljivati prvi PC-jevi. Oni su, za razliku od mog spektruma, imali flopy diskove. A koje je to čudo bilo. 1.4 MB HIGH density pohrana. Za razliku od trake 100x brže i pouzdanije i&scaron;čitavanje. Čovječe &hellip;</p>
<h2>Kupi mi kupi babo, kupi mi IBM compatible PC</h2>
<p>I ja ti svog babu vrlo brzo natjeram da se bez PC-ja ne može živjeti. I on preko svojih prijatelja nađe u Sarajevu firmu koja je počela dovoditi &ldquo;Tajvance&rdquo; koji su bili puno jeftiniji od originalnih IBM PC-jeva, a &ldquo;sve isto rade&rdquo; &hellip; hehe. I stvarno, po super povoljnoj cijeni sam dobio Računar sa AT 286 procesorom, Hercules crno-bijelom grafičkom karticom, 2 MB RAM-a i matričnim &scaron;tampačem citizen ! Sve to za samo 3800 njemačkih maraka. Jo&scaron; malo dodati i eto ti nov auto u to doba.</p>
<p>Bilo kako bilo, moj babo nikad nije žalio svom sinu freak-u ugoditi ovakve stvari. On se uvijek sa mamom &scaron;alio kako to nije tro&scaron;ak nego investicije u biznis.</p>
<h2>IBM DOS, MS DOS</h2>
<p>U to doba, pojma nisam imao &scaron;to su to softwerske licence, &scaron;ta piraterija. Programi (piratski naravno :)) su se prodavali preko novinskih oglasa.</p>
<p>Na moj računar je do&scaron;ao IBM DOS 4.xx. U &ldquo;Svetu računara&rdquo; se počelo pričati kako se pojavio mrak grafički sistem &ldquo;Windows&rdquo;. Bila je to verzija 1.0 i isporučivala se na disketama.</p>
<p>Ubrzo sam do&scaron;ao do instalacijskih disketa. Ali, da bi se taj sistem koristio imati mi&scaron;a.</p>
<p>&Scaron;ta je sad mi&scaron; !? Kako to hoda ?!</p>
<p>Dao sam se odmah u potragu, i ubrzo na&scaron;ao mjesto gdje se mogu kupiti mi&scaron;evi. Cijena sitnica: 100 DM.</p>
<p>Al' neka, stvar je bila genijalna. Windows-i su bili sami po sebi beskorisni, ali koncept rada sa mi&scaron;em je bio super.</p>
<p>Ubrzo će mnogi programi obezbjediti podr&scaron;ku za mi&scaron;a (Ventura publisher), tako da je i ova &ldquo;investicija&rdquo; bila dobra :)</p>
<h2>bye bye hardware, do&scaron;la je era software-a</h2>
<p>Ali jedna se tu lo&scaron;a stvar desila. Za razliku od Spectruma, koga sam u du&scaron;u upoznao, PC je bio crna kutija. Čak ni ja, ovakav znatiželjan, nisam smio plaho &ldquo;&scaron;arafati&rdquo; sa PC-jem, a ne kamo li eksperimentisati i prikopčavati custom-made stvari na njegove portove.</p>
<p>Čak ni moj babo, koji je vazda bio moj bezrezervni &ldquo;fun&rdquo;, ne bi izgaranje 3 i kusur hiljada maraka tako jednostavno progutao.</p>
<h2>ETF, kru&scaron;ke</h2>
<p>Nakon zalud potro&scaron;ene godine u JNA, do&scaron;ao sam na faks. Godina zatupljivanja u JNA, lo&scaron; nivo matematike u srednjoj &scaron;koli, dali su svoj rezultat: Iako sam učio, sve ispite na zimskim rokovima sam pao ko kru&scaron;ka &hellip;</p>
<p>Dodatni problem je bilo moje detaljisanje. Umjesto da se fokusiram na predavanje i sveske profesora, ja sam blento nabavio buljuk knjiga i to proučavao. E tako se jarane ne zavr&scaron;ava fakultet.</p>
<h2>Instrukcije iz matematike</h2>
<p>Nakon zimskog brodoloma, ostao je upitnik kako se spremiti za ljetne rokove. I onda je babo na&scaron;ao instruktora za matematiku (mislim da je taj čovjek i danas asistent na ETF-u).</p>
<p>E on me je &ldquo;prosvijetlio&rdquo;: kani se dijete proučavanja. Evo ti džonovi, ima&scaron; naučiti 10-tak tipova zadataka i to je to.</p>
<p>Nako zavr&scaron;enih instrukcija, imao sam njegovim rukopisom ispisane zadatke.</p>
<p>I to sam navježbao &hellip;</p>
<h2>Ljeto je pametnije od zime</h2>
<p>I doista, po tom principu sam uspio do jeseni sve ispite &ldquo;očistiti&rdquo;. Koje olak&scaron;anje &hellip;.</p>
<h2>A &scaron;ta bi sa informatikom ?</h2>
<p>U toku te prve godine, informatika je bila po strani. Jedini dodir je bio kroz predmet &ldquo;Programiranje I&rdquo;. Taj predmet je naravno bio &ldquo;za odmaranje&rdquo;,  s obzirom na ranije znanje.</p>
<h2>II i III godina &hellip; come back</h2>
<p>E na drugoj godini sam već skontao kako se polažu ispiti, tako da je sve teklo glatko.</p>
<p>Za računar je već moglo naći vremena. Ali to je vrijeme uglavnom tro&scaron;eno u nabavku i gledanju raznoraznog software-a.</p>
<p>Sjećam se da sam se &ldquo;zapalio&rdquo; za prolog, za koga sam na&scaron;ao neku knjigu, da bi mi kasnije kom&scaron;ija Ranko (koji je zavr&scaron;avao ETF), na&scaron;ao i program.</p>
<p>Umjetna inteligencija, deklarativno programiranje: reci &scaron;ta, a prolog će sam skontati kako dođi do rezultata &hellip; cool</p>
<h2>Telekomunikacije</h2>
<p>Na kraju druge godine sam sve ispite bez ikakve puno muke &ldquo;očistio&rdquo;.</p>
<p>Trebalo je odlučiti koji smjer: 1) Energetika ?</p>
<p>To je uglavnom upisivala raja koja je slabije stajala. Energetika mi nije ionako bila interesantna.  Ma jok.</p>
<p>1) Informatika ?</p>
<p>Iza energetike, informatika je glasila za lagan smjer. &Scaron;to će mi informatika &ndash; to može ostati moj hobi.</p>
<p>3) Automatika ?</p>
<p>Tu je bilo dosta &ldquo;prave elektronike&rdquo; i žica koje sam vazda volio, ali gdje ću naći dobar posao kao automatičar u Bosni ?</p>
<p>4) Telekomunikacije ?</p>
<p>E pa tamam. Ima dosta žica, ali i informatike. Idem na TK.</p>
<h2>Koji to student upi&scaron;e treću godinu i ne zavr&scaron;i ETF !?</h2>
<p>Treća godina je započela da bolje ne može biti. Na prvom parcijalnom sam položio zloglasnu &ldquo;Impulsnu elektroniku&rdquo; kod Pa&scaron;ića, nakon toga i sve ostale parcijalne.</p>
<p>Tačka.</p>
<p>Fakultet zdravo.</p>
<p>Rat.</p>
<p>Kako sam ja bio skroz u svom svijetu, za mene je rat bio totalno iznenađenje.</p>
<p>Definitivno sam bio u grupi onih najglupljih &scaron;to se tiče shvatanja: ljudi počeo je rat.</p>
<p>Rat me je dočekao u Zenici kod brata.</p>
<h2>Ratna informatika</h2>
<p>&Scaron;to ti je sudbina &hellip;</p>
<p>Da bi me za&scaron;titili od pje&scaron;adije, gdje bi garant bio dobar kandidat za glavu izgubit', brat, snaha i roditelji su povukli veze da me udome na neko mjesto gdje se &ldquo;ne puca&rdquo;.</p>
<p>I tako sam se ja na&scaron;ao u jesen &lsquo;91 u Press centru okružnog &scaron;taba TO Zenica.</p>
<p>&Scaron;ta sam radio ? Radio na računaru :) Na pripremi &scaron;tampe za &scaron;tabske novine.</p>
<p>Kako je sve &scaron;to je bilo vezano za računare bilo interesantno, fakat sam se brzo ufurao u DTP.</p>
<p>Brzo sam postao DTP guru, i guru za računare općenito :)</p>
<h2>3. Korpus AR BiH, služba informatike</h2>
<p>Početkom &lsquo;92 se formira 3.korpus. I meni u &scaron;tab dođe moj budući načelnik Me&scaron;a. Me&scaron;a je čuo kako ima &ldquo;neki mali &scaron;to rastura računare&rdquo;, pa me je pitao da li bih želio da pređem u informatiku kao programer.</p>
<p>Objasnio sam da sam ja nezavr&scaron;eni student, i čak telekomunikacija, a ne informatike.</p>
<p>&ldquo;Slu&scaron;aj&rdquo;, rekao je Me&scaron;a: &ldquo;Ljudi nema, svi su se inžinjeri razbježali, ako hoće&scaron; to nije problem&rdquo;.</p>
<p>I tu sam ispekao zanat. Nije bilo suđeno da informatika bude samo hobi.</p>
<h2>Clipper-ica</h2>
<p>Od Tuzlanskog korpusa smo dobili aplikaciju za vođenje personalne evidencije. To su radili neki ljudi sa njihovog fakulteta, koji su ubrzo nestali.</p>
<p>Bilo kako bilo, aplikaciju smo instalirali u sve jedinice korpusa, a podr&scaron;ku od Tuzlaka nismo mogli dobiti.</p>
<p>Ja sam predložio da to prepi&scaron;emo đoneći funkcije postojeće aplikacije (nismo imali puni source, samo segmente).</p>
<p>I tako sam postao guru za clipper.</p>
<p>Nakon toga smo radili za službu finansija radili knjigovodstvo.</p>
<h2>Stručnjak za oživljavanje diskova i matičnih ploča</h2>
<p>U vrijeme potpune blokade, nastao je veliki problem za sevisiranje računara. Zalihe &ldquo;zdravih&rdquo; računara iz firmi su istro&scaron;ene. Svi su uveliko bili mobilisani. Najveći problem je bio sa hard diskovima. Oni su prvi počeli crkavati. Tu smo čak i&scaron;li do toga da smo otvarali diskove, pa poku&scaron;avali ih otkočivali ako bi mehanika zakazala.</p>
<p>Sjećam se jednog diska koji je danima radio na mom stolu otvoren. Kad bih računar palio, ja bih ga zavrtio i pokrio da ne ide pra&scaron;ina.</p>
<p>Bad sektori su se pojavljivali, ali smo to uredno da &ldquo;chkdsk /f&rdquo; krpili &hellip; Kino pa eto ti.</p>
<p>Kad se neka na&scaron;a vojna delegacija vratila iz Malezije, Malezijci su im u kofere potrpali matične ploče i diskove.</p>
<p>Kad smo to dobili, to je bilo veselje &hellip; NOVA MATIČNA PLOĆA. NOV HDD &hellip; OUUU</p>
<p>disk kapaciteta 80 MB &hellip; mislili smo da se se do Sudnjeg dana ne može popuniti.</p>
<h2>Montiranje hardware-a Autotech Zenica</h2>
<p>Nakon &scaron;to je sklopljeno primirje sa HVO, ljudi su počeli &ldquo;ganjati&rdquo; posao. Jedan od tih je bio Kemo Ključanin, koji je imao ideju da počne kupovati preko Hrvata računare.</p>
<p>Čuo je kako sam računarski guru-guru :) i predložio da zajedno uđemo u posao.</p>
<p>Na kraju se to zavr&scaron;ilo tako da sam ja preko noći, kad zavr&scaron;im sa službom u Korpusi, dolazio i montirao računare.</p>
<p>Uh, &scaron;ta čovjek izdura kad mora &hellip;</p>
<h2>Fmk</h2>
<p>94' godine sam se oženio. Taman u to vrijeme, moj &scaron;ef mi je predložio: Ja sam prije rata radio u jednoj firmi koja je pravila knjigovodstvene programe (SEB &ndash; Savremeni ekonomski biro).</p>
<p>Ti programi se nalaze na puno mjesta ali ih niko nema održavati.</p>
<p>&ldquo;Ja ne mogu izlaziti iz kruga kasarne, mene uvijek Načelnik može tražiti &hellip; Da li bi ti uzeto te aplikacije pa da zajedno započnemo&rdquo;.</p>
<p>Rad kod Keme je ipak bio manje-vi&scaron;e obično &scaron;arafanje, software je ipak bio veći izazov.</p>
<p>A pare su mi definitivno trebale. I tako i zvanično započe karijera softvera&scaron;a :)</p>
<h2>Korisnički interfejs</h2>
<p>Nakon par mjeseci, do&scaron;lo je razilaženja između mene i Me&scaron;e.</p>
<p>Naime, ja sam čim sa počeo upoznavati te stare aplikacije SEB-a, počeo mjenjati strukture tabela i source kod.</p>
<p>Programe su očigledno pisali odlični ekonomisti ali lo&scaron;i programeri.</p>
<p>Davali su imena poljima tabele p1, p2 &hellip; Niko živ se u tome nije mogao snaći.</p>
<p>&Scaron;to se tiče korisničkog interfejsa, sve se obavljalo na crnom ekranu i biranjem od &ldquo;1&hellip;9&rdquo;.</p>
<p>Kako sam ja na armijskim projektima napravio već niz biblioteka koje su omogućavale (po meni) bolji interfejs,</p>
<p>ja sam nakon pola godine skroz prepisao programe. Ustvari, većinu  koda sam napisao ispočetka gledajući kako stari programi fukcioni&scaron;u.</p>
<p>To sposobnost funkcionalnog đonjenja sam već izučio kod programa za personalnu evidenciju (KORPS).</p>
<p>Kada sam do&scaron;ao do nivoa da je program funkcionalno obzebjedio sve ono &scaron;to su stari nudili, kod korisnika sam počeo postavljati svoje aplikacije.</p>
<p>Kod većine korisnika je to bilo ok, ali je kod jednog nastao veliki problem.</p>
<h2>Vrati mi moje stare programe</h2>
<p>Žena koja je radila, kada sam postavio nove aplikacije je sva u izbezbumljen rekla: vrati mi moje stare programe !</p>
<p>Ja sam je pitao: A Za&scaron;to ? Ona je odgovorila: Ja sam na to navikla, meni ni&scaron;ta drugo ne treba.</p>
<p>Odgovorio sam uredu, ali ja stare aplikacije ne mogu održavati.</p>
<p>I tu je nastao problem. Ta žena je imala poseban status kod direktora, pa se ona njemu (bukvalno) isplakala, pa je direktor zarad svoje miljenice nazvao Me&scaron;u &hellip; Pa je Me&scaron;a meni rekao da programe treba vratiti na staro &hellip;</p>
<p>Međutim, ja sam bio izričit: &ldquo;Ja vraćati neću. Ja se u tim programima ne mogu snaći ni&scaron;ta.&rdquo;</p>
<p>Tako i bi. Me&scaron;a je to vratio, i nastavio održavati te stare programe, a ja nastavio svoju furku.</p>
<p>Dogovor je bio da svak' svojim putem nastavi.</p>
<p>Oni klijenti koji su počeli koristiti moja rje&scaron;enja, a koje smo ranije dogvorili zajednički, su &scaron;to se novaca tiče ostali fifti-fifti. I mirna Bosna.</p>
<h2>Knjigovodstveni program može svaki "levat" napraviti</h2>
<p>Interesantno je bilo moje tada&scaron;nje razmi&scaron;ljanje. Knjigovodstvo mi se činilo ne&scaron;to &scaron;to je super jednostavno.</p>
<p>Nabildan ETF-ovskom matematikom imao sam rezon:</p>
<blockquote class="posterous_short_quote">
<p>Nakon integrala, knjigovodstveni program sa svojim saberi-oduzmi-pomnoži može svaki levat napraviti</p>
</blockquote>
<p>Bio sam ubjeđen kako ću za pola godine - godinu najvi&scaron;e stvar &ldquo;zaokružiti&rdquo;, i da se tu vi&scaron;e neće imati &scaron;ta bitno dodavati ili oduzimati.</p>
<p>Joj bekana &hellip;</p>
<h2>Sigma-com</h2>
<p>Stvar se pred kraj rata počela zahuktavati. Broj korisnika FMK je konstantno rastao.</p>
<p>O iluzijama  o onih 6 mjeseci-godinu sam prestao razmi&scaron;ljati. Ispostavilo se da ono &scaron;to radim ljudi hoće kupovati.</p>
<p>I tu je nastala VELIKA gre&scaron;ka u koracima &hellip;</p>
<p>Umjesto da ko i svi moji drugovi nakon zavr&scaron;etka rata uzmem knjigu u ruke i zavr&scaron;im to studije, ja sam se ufurao u to da sam biznismen.</p>
<p>Iako su na ETF-u pripadnicima armije dali sve moguće povlastice ( svi smo postali apsolventi, trebali smo samo ispolagati preostale ispite) ja sam imao novu furku.</p>
<p>Rekao sam sebi kako sam za rata postao informatičar, i kako nemam namjeru da se ganjam sa telekomunikacijama.</p>
<p>Takođe sam sebi i drugima obja&scaron;njavao kako sam sve sa fakulteta zaboravio (k'o da drugi nisu) i kako mi je bezveze da se u to ufuravam.</p>
<p>Tako i bi. Strikan i  Sadat koji su sa mnom bili zajedno u Korpusu i na istoj godini su u roku od 1 - 1.5 godinu diplomirali.</p>
<p>A ja postao &ldquo;biznismen&rdquo;.</p>
<h2>Biznis</h2>
<p>Sve bi to bilo uredu da ja jesam tip biznismena. Al' nisam. Ja sam popriličan freak, i često sam donosio odluke koje su imale najmanje veze sa mojim biznisom &hellip;</p>
<p>Ali hajde de. Nakon 16 godina sam ipak koliko-toliko naučio svoj &ldquo;freak&rdquo;-luk uskladiti sa potrebam posla.</p>
<h2>bring.out, linux, opensource</h2>
<p>Prije 10-tak godina sam se počeo interesovati za otvorene sisteme.</p>
<p>Vremenom je koncept &ldquo;opensource&rdquo;-a postao polazi&scaron;te za sve nove poslove.</p>
<p>To je bio i glavni razlog &scaron;to sam priliko preseljenja firme u Sarajevo promjenio ime u &ldquo;bring.out&rdquo;.</p>
<p><a href="http://www.bring.out.ba/">http://www.bring.out.ba</a>.</p>
<p>bring.out nije jo&scaron; nije &ldquo;aterirao&rdquo; na tom putu. Nadam se da će i taj dan u dogledno vrijeme doći.</p>
<p>Eto, u ovome je uglavnom pro&scaron;lo mojih 25 informatičkih godina &hellip;</p>

]]></content:encoded>
	<excerpt:encoded><![CDATA[80-te i ZX Spectrum 48K Kada sam tamo negdje ‘85 (dvadesetok vijeka :)) dobio svoj prvi računar ZX Spectrum 48K, bio sam ubjeđen da ta stvarka može sve. Evo upravo sada gledam knjigu “Spektrum priručnik” koja je sva iscufana od silnog č...]]></excerpt:encoded>	

	<wp:post_date>Sun Jun 06 12:58:00 -0700 2010</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>25-godina-hardware-a-i-software-a</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
