<item>
	<title>Emir i Berin</title>
	<link>http://hernad.bring.out.ba/emir-i-berin</link>
	<pubDate>Mon Jun 28 14:42:00 -0700 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="FIT_1_godina"><![CDATA[FIT_1_godina]]></category>
	
		<category domain="tag" nicename="FIT_Mostar"><![CDATA[FIT_Mostar]]></category>
	
		<category domain="tag" nicename="obrazovanje"><![CDATA[obrazovanje]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/emir-i-berin</guid>
	<description></description>
	<content:encoded><![CDATA[

<p>Evo danima mi u glavi &ldquo;stoji&rdquo; ova priča. Pa hajd' da je napokon probam ispričati.</p>
<p>Kad sam se vraćao sa <a href="asp-parc-2">parcijalnog iz ASP-a</a>,  pitao sam dvojicu momaka koje sam ranije na ispitima u Sarajevu treba  li im prevoz. Do tada sam sa sa njima poznavao  &ldquo;zdravo za zdravo&rdquo;.</p>
<p>U kolima smo se i zvanično upoznali. Jedan se zove Emir, drugi Berin.</p>
<p>Put je krenuo, a sa njim i salva mojih pitanja &hellip;</p>
<p>Da li je razlog tome &scaron;to sam pod utiskom svojih silnih &ldquo;pisanija&rdquo; o FIT-u i obrazovanju generalno, ne znam.</p>
<p><!--more--></p>
<h2>Materin sin</h2>
<p>Sigurno se to može pripisati mojoj prirodnoj radoznalosti, ali i činjenici da sam materin sin :).</p>
<p>Moja mati je inače bila sudija.</p>
<p>Kada sam bio mladić, ona je svoje isljedničke vje&scaron;tine redovno  koristila da ispita kako stvari stoje. Tako, čim bi neko od mojih  drugova ostao sam sa njom, taj bi sa par pitanja doživio &scaron;ah-mat. Mati  bi tako svojim unakrsnim ispitivanjem bez problema do&scaron;la do svih  informacija koje su joj interesantne, a od mene ih nije mogla izvući :)</p>
<h2>FIT-ovci, a nisu &ldquo;starohani&rdquo;</h2>
<p>Prva stvar koju sam uočio kod Emira i Berina je da su to mladi ljudi  koji su vjerovatno iz srednje fri&scaron;ko iza&scaron;li. To se i ispostavilo.  Obojica su upisali FIT odmah nakon srednje.</p>
<p>Emir je zavr&scaron;io drugu gimnaziju, a Berin elektro na Buća Potoku.</p>
<h2>ETF-ova legendarna matematika</h2>
<p>&ldquo;Pa dobro, kako odabraste FIT ?&rdquo;, bilo je moje prvo pitanje. Emir je  pričljiviji, pa on i odgovara: &ldquo;Ma razmi&scaron;ljao sam ja o ETF-u, ali  njihova matematika &hellip; Poobara&scaron;e raju, ne može&scaron; se iz toga izvući&rdquo;.</p>
<p>&ldquo;Znači, oni vazda isto guslaju sa tom svojom matematikom &hellip;&rdquo;</p>
<p>Kako on to reće, tako se sjetih narandžastih tvrdih korica &ldquo;Lja&scaron;ka&rdquo;  (op. aut zbirka zadataka iz matematike). Čak sam i onaj miris knjige i  grafitne olovke osjetio. Iza Lja&scaron;ka mi se ukaza Galić (op.aut tada&scaron;nji  profesor matematike I na ETF-u), sa svojim dubokim glasom i  karakterističnom pojavom &ndash; mrk, k'o stijena visok.</p>
<p>Ne mogu ja grije&scaron;it' du&scaron;u i reći da me je taj čovjek patio. Kad sam  uradio ispit za prolaz, tad' sam i pro&scaron;ao. Čak mi je na usmenom, kol'ko  se sjećam i ocjenu povećao &hellip;  Ali da je sve to bilo previ&scaron;e &ndash; jeste.  Nastava matematike na ETF-u ne može biti ista kao na PMF-u (Prirodni  matematski fakultet). A tako je to otprilike bilo.</p>
<p><a href="25-godina-hardware-software">Meni Galić nije sudbinu odredio</a>, ali mnogima jeste.</p>
<p>Da li je <a href="tri-vrste-studenata">Galićeva matematika bila filter za ublehare ?</a> ? Naravno da jeste. Ali je bila filter i za mnoge sposobne.</p>
<p>Ako je to tačno, onda filter nije bio dobro pode&scaron;en.</p>
<p>Iz Emirove priče sam shvatio da ETF nije plaho na tom konceptu mijenjao &hellip; A to je definitivno &scaron;teta.</p>
<p>Pitao sam ih nakon toga kako stoje sa ispitima. Emir je kao i obično prvi počeo: &ldquo;Dobro je, hvala Bogu. Nisam siguran za <a href="http://github.com/hernad/blog/blob/master/articles/pr1-parc-2-1-put-20100621.markdown">PR1</a>, ali ovo ostalo je dobro. Ima jo&scaron; taj AKS u subotu, Algoritme sam danas dobro uradio &hellip;&rdquo;</p>
<p>&ldquo;A Matematika ?&rdquo;, ja ga potaknem da nastavi. &ldquo;Super, položio sam tri i sutra imam četvrtu parcijalu&rdquo;.</p>
<p>&ldquo;Ma pravi si&rdquo;, rekoh. &ldquo;A ti Berine ?&rdquo;</p>
<p>&ldquo;Ja sam ti ovu godinu slab bio. Vi&scaron;e sam se odmarao nego &scaron;to sam  radio. Pola ispita sam oti&scaron;ao zato jer me je Emir podsjetio. Ja i  zaboravim pogledati kad' su ispiti, pa me onda on nazove i kaže hoće&scaron; li  sa mnom &hellip;&rdquo;</p>
<p>&ldquo;E pa pravi je jaran&rdquo;, ja konstatujem. &ldquo;Jeste ja&scaron;ta je &hellip; &rdquo;, složi se Berin.</p>
<p>Onda ja ispričam priču o svojoj muci sa <a href="kad-ti-nesto-ili-neko-ogadi-fakultet">OEK-om</a>. Pa kad sam je ispričao, pitam Berina: &ldquo;Jesi li ti izlazio na OEK ?&rdquo;</p>
<p>&ldquo;Ma jok nisam &hellip;&rdquo;, odgovori on. &ldquo;Žao mi je jedino &scaron;to nisam pro&scaron;ao UPR.&rdquo;</p>
<p>&ldquo;A &scaron;to ?&rdquo;, ja nastavi sa pitanjima.</p>
<p>&ldquo;Ma zadatke sam ja sve tačno uradio, ali oni to ni ne gledaju ako teoriju ne prođe&scaron;.&rdquo;</p>
<p>&ldquo;Kakvu teoriju ?&rdquo;, ja u čudu.</p>
<p>&ldquo;Ma ima teorija nekakve definicije &hellip;&rdquo;, nastavi Berin.</p>
<p>&ldquo;Pa jesi li bar ne&scaron;to napisao onako kako ti misli&scaron; ?&rdquo;</p>
<p>&ldquo;Ma jesam ali, to valjda nije tako kako oni hoće &hellip; Dobio sam 2.5 boda, a trebao 3. I sad čekam septembar radi toga &hellip;&rdquo;</p>
<h2>UPR preduslov za PR1, al nije za ASP</h2>
<p>&ldquo;Ono &scaron;to mi je bezveze je to &scaron;to ne mogu izaći na PR1 radi toga. A ja  bi da mogu to spremao. Nije mi jasno za&scaron;to mmogu izaći na Algoritme a  na PR1 ne mogu. Pa zadaci na algoritmima su puno komplikovatniji nego  UPR &hellip;&rdquo;</p>
<p>Po&scaron;to je Berin položio I parcijalni iz ASP-a pitam ga kako mu je to i&scaron;lo.</p>
<p>Kaže on: &ldquo;Ma super, Na I parcijalnom sam osvojio 85%, a ispit sam spremio u vozu (op.aut na relaciji Sam-Mostar) &rdquo;</p>
<p>U kasnijoj priči ću skontati da me Berin sigurno ne &ldquo;ublehari&rdquo;.  Naime, utvrdiću kasnije da je Berin dobro potkovan programiranjem zato  &scaron;to ga to privatno interesuje i &scaron;to je imao dobru nastavu u srednjoj  &scaron;koli.</p>
<p>Hm, fakat. I ja se tu zapitam. UPR su stavili kao preduslov za PR1 vjerovatno zato da studenti ne bi bili &ldquo;kampanjci&rdquo;.</p>
<p>Efekat je međutim taj da onaj ko ne uspije <em>UPR položiti izvjesno neće ni godinu očistiti</em>.</p>
<p>Hm jesu li oni takav filter htjeli napraviti ? Je li to dobra stvar ?</p>
<p>Meni taj algoritam &ldquo;if UPR then PR1&rdquo; ne&scaron;to nikako ne sjeda.</p>
<p>Do kraja vožnje ću najvi&scaron;e pričati sa Berinom. Kasnije će se on malo  &ldquo;otkraviti&rdquo; pa početi priču o tome da ga interesuju antivirusni  algoritmi. O tome kako je gledao u clamav source kod (op.aut free  software antivirusni alat), ali ga on nije odu&scaron;evio &hellip; Kako ima slabu  heuristiku itd &hellip;</p>
<p>U to malo priče sam skontao da je Berin odgovara profilu  informatičara &ndash; &ldquo;geak&rdquo;-a. Berin će noćima provesti na nekom (za njega)  izazovnom problemu, dok se za &ldquo;obične&rdquo; probleme neće lahko zagrijati.</p>
<p>Da budem jasan: nije UPR niti FIT kriv &scaron;to je Berin za ovakve stvari polijen.</p>
<p>Međutim, činjenica je da, ako sam dobro procijenio Berina, da se on može &ldquo;ispolirati&rdquo; u dobrog informatičara.</p>
<p>Vodeći se tom pretpostavkom, nije ba&scaron; da fakultet tipa FIT ne treba voditi računa o takvim studentima.</p>
<p>Izvinite, za informatiku treba dar. Ako ga Berin ima, a po meni ima, onda bi bilo super da ga koncept nastave stimulira.</p>
<h2>&ldquo;Udica&rdquo; za Berina</h2>
<p>&Scaron;ta to može upecati Berina da on sjedne i radi ? Izazovi. Sadržaj  predmeta koji u sebi imaju elemente izazova kao &scaron;to je to source kod  clamav-a. Naravno, ne može OEK biti takav &hellip; ali ne mora biti ni onakav  kakav je sada. Totalno nesvarljiv.</p>
<p>Slična stvar je sa UPR-om. UPR mora biti filter za ljude koji ne usvoje polazne elemente programiranja.</p>
<p>Ja jednostavno ne mogu skontati kako to da neko ko glatko položi Algoritme nije kandidat da &ldquo;žmireći&rdquo; položi UPR.</p>
<p>Sve ovo &scaron;to pi&scaron;em je čista spekulacija. Nit' sam vidio &scaron;ta je Berin  pisao na UPR-u, niti na osnovu jednog razgovora u autu mogu tvrditi &scaron;ta  Berin zna i &scaron;ta može.</p>
<p>Možda bi, kad bih vidio njegov rad, ja prvi prokomentarisao: &ldquo;Tebi je  sine najbolje da traži&scaron; negdje drugdje selameta &hellip;&rdquo;. Možda, al' te&scaron;ko.</p>
<h2>Da li je sistemski bug &ldquo;if-UPR then PR1&rdquo; ?</h2>
<p>Međutim, ako sam dobro procijenio Berina, onda bi ovo mogao biti indikator jednog sistemskog bug-a na FIT-u.</p>
<h2>Jo&scaron; malo o Emir-u prije kraja</h2>
<p>O Emiru nisam puno napisao. Valjda &scaron;to za njega nema zime :)</p>
<p>Emir je, dok smo Berin i ja pričali o clam-avu, VoIP-u, hakerskim  upadima i sličnim informatičkim &ldquo;vječnim temama&rdquo;, &scaron;utio. I slu&scaron;ao.  Upijao. Emir se u stvari tek na FIT-u susreo ozbiljnije sa informatikom.</p>
<p>Emir je ko spužva. Pažljiv, sve ga interesuje. &ldquo;Hvata&rdquo; &scaron;to mi  pričamo, memori&scaron;e &ldquo;keywords&rdquo; (VoIP, SIP, &hellip;.) da ih kada dođe kući može  prostudirati.</p>
<p>Za razliku od Berina, koji je na fakultet do&scaron;ao sa puno vi&scaron;e znanja (ali i puno manje predanosti) Emir je k'o otvorena knjiga.</p>
<p>Emir je klasični predstavnik <a href="tri-vrste-studenata">sposobnih studenata</a>.</p>
<p>Emir ima sve predispozicije da sutra bude radnik kakvog se samo  poželjeti može.  Međutim, u Emirovom slučaju krajnji ishod uveliko ovisi  o fakultetu.</p>
<p>Upravo zbog Emira i njemu sličnih sam počeo pisati o <a href="bajgorologija-ii-polozena">bajgorologiji</a>, o tome <a href="sta-trebamo-uciti-na-tehnickim-fakultetima">&scaron;ta se treba učiti na fakultetima</a></p>
<p>Emir<strong> sam jo&scaron; ne može razlučiti</strong> &scaron;ta je ubleha a &scaron;ta pravo znanje. A i  kako bi kada tek usvaja pojmove. On će učiti &scaron;ta god mu se zada, I  misliće da je to-to.</p>
<p>Fakultet je taj koji se mora postarati da mu se kroz studije obezbjedi <strong>znanje</strong>, a da ga kutari&scaron;e <strong>ubleha</strong>.</p>
<p>Bila bi velika &scaron;teta da tamo negdje za 10 godina sretnem Emira koji  se bavim nekim desetim poslom (npr. &ldquo;menadžer&rdquo; za sve i sva&scaron;ta - a defacto ni&scaron;ta) umjesto  da bude informatičar.</p>
<p>A to je izvjestan scenario ako mu fakultet obezbjedi obrazovanje koje ima rupa vi&scaron;e nego &scaron;vajcarski sir.</p>
<p>To bi bila velika &scaron;teta. To Emir ne zaslužuje.</p>
<h2>A Berin ?</h2>
<p>Hah &hellip; Berin. Berin ako se trzne (to je moj dojam), on će FIT  rasturit'. Ali se lahko može desiti i to da Berin iz godinu bude  razvlačio &ldquo;ispite ko žvaku&rdquo;. Već naredne godine će Emir, aBd, biti druga  godina, tako da neće ni biti jarana koji će ga posjećati kad je koji  ispit na redu. Ako to tako bude, vjerovatno će brzo doći vakat da će  Berinov babo i mati reći: &ldquo;Sine kani se ćorava posla. Ako neće&scaron; učiti &ndash;  nađi posao&rdquo;.</p>
<p>Čija je to krivica, ako se stvari budu ovako zavr&scaron;ile ? Naravno,  Berinova. Ne bojte se, nije za sve kriv FIT i naopak obrazovni sistem.  Niko ne može Berina natjerati da zagrije stolicu do on sam.</p>
<p>Ali istina je i to da dobar koncept studija ovakve studente može animirati, a lo&scaron; <a href="kad-ti-nesto-ili-neko-ogadi-fakultet">ogaditi</a>.</p>
<h2>Za kraj</h2>
<p>Emir i Berin nisu izmi&scaron;ljeni likovi. Istina je takođe da bih bio  obična budala kada bih rekao da sam u toku vožnje Sarajevo-Mostar Emira i  Berina &ldquo;bolje poznajem nego njihovi babo i mater&rdquo;. Takav freak nisam :)</p>
<p>Ali u mojoj procjeni u tome i jeste poenta. Znam da emiri i berini iz ove  priče postoje, čak i da se ispostavi da to nisu Emir i Berin koje sam  upoznao.</p>

]]></content:encoded>
	<excerpt:encoded><![CDATA[Evo danima mi u glavi “stoji” ova priča. Pa hajd' da je napokon probam ispričati. Kad sam se vraćao sa parcijalnog iz ASP-a, pitao sam dvojicu momaka koje sam ranije na ispitima u Sarajevu treba li im prevoz. Do tada sam sa sa njima poznava...]]></excerpt:encoded>	

	<wp:post_date>Mon Jun 28 14:42:00 -0700 2010</wp:post_date>
	<wp:post_date_gmt>Mon Jun 28 14:42:00 -0700 2010</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>34518924</wp:post_id>
	<wp:post_name>emir-i-berin</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
		<wp:comment>
			<wp:comment_id>6291722</wp:comment_id>
			
				<wp:comment_author><![CDATA[Berin]]></wp:comment_author>
				<wp:comment_author_url><![CDATA[]]></wp:comment_author_url>
			
			<wp:comment_date>Fri Dec 03 07:45:21 -0800 2010</wp:comment_date>
			<wp:comment_date_gmt>Fri Dec 03 07:45:21 -0800 2010</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Haha, ja sam odusevljen tvojom (nema potrebe za persiranje ;) detaljnom analizom i izlaganjem o nama dvojici :D. Doduse, zakasnio sam dobrih 5-6 mjeseci od pisanja ovog posta ali eto, sjetih se danas da imas blog pa rek'o sebi: idi potrazi! Svaka cast za opis i postove; svaki je do bola tacan, a isto tako na neki nacin humoristican. Sretno na ispitu iz statistike, vidjamo se kolega.]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
		<wp:comment>
			<wp:comment_id>6292412</wp:comment_id>
			
				<wp:comment_author><![CDATA[Ernad Husremović]]></wp:comment_author>
			
			<wp:comment_date>Fri Dec 03 10:03:22 -0800 2010</wp:comment_date>
			<wp:comment_date_gmt>Fri Dec 03 10:03:22 -0800 2010</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Berine, drago mi je da ti se blog svidio. Još mi je draže da te vidim na drugoj godini :)  ]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
</item>
