<item>
	<title> Bosnian business: Telefonski spam</title>
	<link>http://hernad.bring.out.ba/bosnian-business-telefonski-spam</link>
	<pubDate>Wed Jul 21 23:34:00 -0700 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="bring.out"><![CDATA[bring.out]]></category>
	
		<category domain="tag" nicename="business"><![CDATA[business]]></category>
	
		<category domain="tag" nicename="krkanluk"><![CDATA[krkanluk]]></category>
	
		<category domain="tag" nicename="sistem"><![CDATA[sistem]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/bosnian-business-telefonski-spam</guid>
	<description></description>
	<content:encoded><![CDATA[

<p>U Bosni postoji jedan interesantan &ldquo;poslovni&rdquo; &scaron;ablon.</p>
<p>Taj &scaron;ablon sam prozvao &ldquo;telefonski spam&rdquo;.</p>
<p>Telefonski spam je strategija koja funkcioni&scaron;e ovako:</p>
<p><!--more--></p>
<ol>
<li>naklapasti&scaron; se na telefon i non-stop zivka&scaron; provajdera (svog davaoca usluga)</li>
<li>bez obzira &scaron;ta ti on rekao, ti ga ne slu&scaron;a&scaron; i ponavlja&scaron; svoje zahtjeve</li>
<li>kuka&scaron; mu kako će svijet propasti ako ti to ne rije&scaron;i&scaron; odmah</li>
<li>pa mu jo&scaron; kuka&scaron; ..</li>
<li>pa ga kudi&scaron; &hellip;</li>
<li>pa onda opet kuka&scaron; &hellip;</li>
<li>drži&scaron; ga na telefonu do iznemoglosti, sve dok ti ne kaže: &ldquo;dobro vidjećemo &scaron;ta možemo učiniti&rdquo;</li>
</ol>
<p>Ova zadnja tačka je ključni dio strategije: ako si dovoljno dosadan. uslugu će&scaron; dobiti preko reda. Provajder će reći: <strong>&ldquo;Odradi onog dosadnog, samo nam ga skini nam s' vrata&rdquo;</strong>.</p>
<h2>Tako to mora biti ?</h2>
<p>Taj je sistem tako banalan da je meni fascinantno kako on uspje&scaron;no  funkcioni&scaron;e. Kažu da je dobar sistem jednostavan sistem. Ali ba&scaron; ovakva  primjena principa jednostavnosti meni nikako u glavu  ne ide :(.</p>
<p>Odmah na početku rada moje firme uočio sam da na&scaron;i klijenti masovno koriste ovu strategijue: Najbolje usluge dobijaju <strong>najbezobrazniji</strong>, a <strong>NE</strong> oni koji su <strong>razumni</strong>, <strong>uredne plati&scaron;e</strong> itd.</p>
<p>Stvar je godinama funkcionisala po gore opisanom algoritmu.</p>
<p>Serviser primi poziv i krene kuknjava: &ldquo;Vaki ste, naki ste &hellip; Meni je  posao stao &hellip; odmah da ste se nacrtali ? Ja sam kupio va&scaron; program a vi  tako &hellip; Jedna glava hiljadu jezika &hellip;&rdquo;</p>
<p>Kako je raspored servisa bio na drugim ljudima, spameri su uvijek prvi rje&scaron;avani.</p>
<h2>Ugovor o podr&scaron;ci</h2>
<p>Od početka sam obja&scaron;njavao servisu da se zahtjevi se rje&scaron;avaju onim  redom koji dođu (uzev&scaron;i naravno u obzir REALNU hitnost problema kao  faktor koji može promijeniti taj redoslijed).</p>
<p>Ali, sve bi to u relnim situacijama palo na vodu. Spamerska strategija je pobjeđivala.</p>
<p>Onda sam shvatio da se stvar mora sistemski rije&scaron;iti. Rje&scaron;enje je bio <a href="http://posterous.com/getfile/files.posterous.com/temp-2010-11-25/ajtjdfexCnvquuxpCvwrCGfmdCFvchgokxjeIfzEygeyAlFGqExwdviAHDeE/ugovor_bring.out_uzorak.pdf">Ugovor o podr&scaron;ci</a> :</p>
<ol>
<li>ponuditi 3-4 kategorije ugovora, gdje će prioritet imati oni sa većom kategorijom ugovora</li>
<li>znači kol'ko para tol'ko muzike</li>
<li> ako želi&scaron; da ti se &ldquo;odmah nacrtamo&rdquo; a ti uzmi najjači ugovor i stvar je gotova.</li>
<li> Ako hoće&scaron; da ti se &ldquo;odmah nacrtamo&rdquo; a pri tome nisi spreman da to plati&scaron; &ndash; razguli</li>
</ol>
<p>To je omogućili da se korisnički zahtjevi puno jednostavnije  obrađuju, te da se na većinu spamerskih komentara da obja&scaron;njenje: &ldquo;Tako  je definisano Va&scaron;im ugovorom o podr&scaron;ci&rdquo;.</p>
<p>Međutim, godine su pro&scaron;le dok ovaj princip nije zaživio &hellip;</p>
<h2>Kako ja reagujem na spamere ?</h2>
<p>Ja zadnjih 10 godina izbjegavam rad sa korisnicima. Glavni problem je  taj &scaron;to brzo planem kada druga strana krene spamerskom ili bilo kakvim  bezobrazlukom tražiti rje&scaron;enje za svoj problem.</p>
<p>Na prve napade se najče&scaron;će uspijem kontrolisati. Na te prve verbalne  napade uspijem odgovoriti: &ldquo;To &scaron;to vi sada radite uop&scaron;te neće pomoći  problemu. Predlažem Vam da se fokusiramo na Va&scaron; problem &hellip;&rdquo;.</p>
<p>Međutim, takvi ljudi su redovno nerazumni. Oni ovakve komentare  pogre&scaron;no interpretiraju kao &ldquo;odbranu&rdquo; i signal da mogu nastaviti sa  svojim napadima.</p>
<p>Ako se to desi, kod mene se u trenutku desi transofmacija Mr. Hyde =&gt; dr. Jekyll.</p>
<h2>Pravo na psovanje niko nije kupio</h2>
<p>Bilo je slučajeva kada su korisnici u &ldquo;trenucima zanosa&rdquo; smatrali da svoje nezadovoljstvo iskažu psovkama.</p>
<p>Pojavio se ovaj član:</p>
<blockquote class="posterous_medium_quote">
<p>Član 27 Izvođač i korisnik se obavezuju da će u toku obavljanja operacija koje  su predmet ugovora po&scaron;tovati pravila pristojnog i profesionalnog  pona&scaron;anja. Nezadovoljstvo ili neslaganje ne smije se izražavati verbalnim napadima  (psovkama i slično) ili prijetnjama drugoj strani.</p>
</blockquote>
<p>I konsekvence takvog pona&scaron;anja:</p>
<blockquote class="posterous_medium_quote">
<p>Član 28 U slučaju da jedna od strana prekr&scaron;i član 27, dozvoljen je trenutni  jednostrani prekid ovog Ugovora od strane strane koja se smatra  o&scaron;tećenom. O&scaron;tećena strana dužna je u pisanoj formi dostaviti zahtjev za raskid  ugovora.</p>
</blockquote>
<p>I najsmje&scaron;nija stvar je ta &scaron;to sam jednom doista napravio prekid Ugovora po članu 28.</p>
<p>A stvar se desila tako &scaron;to je korisnik, ne znajući da se upalila  telefonska sekretarica, na na&scaron;oj telefonskoj sekretarici ostavio zvučnu  poruku u formi &ldquo;buketa&rdquo; sočnih psovki.</p>
<h2>Posebni uslovi za spamere</h2>
<p>Ovo sve naravno nije isključilo pojavu spamera. Uvijek će biti  ovakvih ljudi. Ono &scaron;to sam ja međutim učinio jeste to da spamere  nagrađujem al' po&scaron;teno. Po&scaron;to su takvi klijenti za deset stepenica teži  nego ostali, ja u ponudama ugrađujem činjenicu da su spameri.</p>
<p>Ponude za usluge prema njima su redovno 20-30% veće, a nerijetko i duplo veće.</p>
<p>Hoćete spamirati &ndash; bujrum.</p>
<h2>Ali ti si bezobrazan ?!</h2>
<p>Naravno, ovakve moje akcije se tumače kao bezobrazluk.</p>
<p>Da li je to moj ters i bezobrazluk ? Da li kr&scaron;im prava potro&scaron;ača ?</p>
<p>Ja smatram da to nije tačno.</p>
<p>Iz jednostavnog razloga &scaron;to je pružanje usluga takvim klijentima  objektivno teže i neproporcionalno povećanju cijena usluga koje ja  prakticiram.</p>
<p>Činjenica je da moje kolege jednostavnije obrade 5 zahtjeva razumnih  klijenata nego li jedan ovih posljednjih. A ja cijenu pomnožim najvi&scaron;e  sa 2 :)</p>
<p>&Scaron;to se cijena usluga tiče, &ldquo;spameri&rdquo; su redovno  najglasniji i kod cijena. I to bez razlike da li su cijene povećane za <strong>spam faktor</strong> ili iste kao razumnih klijenata.</p>
<h2>Znači, ako vas kritikujemi, vi nama povećate cijene ?</h2>
<p>Ne. Kritika nije spam. Legitimno pravo kupca je da izrazi nezadovoljstvo uslugom.</p>
<p>I nikome radi toga u bring.out nije povećana cijena, ako nije  umanjena. Ako je kritika argumentirana mi smo dužni da to uračunamo i da  kupcu izvr&scaron;imo povrat novca ili damo odgovarajući popust kod narednih  usluga.</p>
<p>Spamiranje je ne&scaron;to sasvim drugo.</p>
<h2>Vas je najbolje onda ni&scaron;ta ne pitati!</h2>
<p>Ne naprotiv.</p>
<p>Evo nekih tačaka iz bring.out uputstva radnicima o eksternoj komunikaciji (komunikaciji sa klijentima) #20863:</p>
<ul>
<li>2) Preglednost, potpunost  
<ul>
<li>U komunikaciji treba drugoj strani odgovoriti na sva pitanja i truditi se da se to izloži &scaron;to jasnije &ndash; preglednije</li>
</ul>
</li>
<li>3) susretljivost  
<ul>
<li>Pridržavanje po tački 2) je preduslov za susretljivost.</li>
<li>Međutim, ovo je ipak treba biti posebna stavka.</li>
<li>Bez obzira na korisnikovo znanje i razumjevanje problema na&scaron;a je  obaveza da budemo susretljivi. Da budemo oni koje će korisnik prepoznati  kao stranu koja mu želi pomoći i biti na usluzi.</li>
<li>Kada mu ne možemo pomoći moramo mu objasniti za&scaron;to mu ne možemo pomoći.</li>
</ul>
</li>
<li>7) Mi ne prodajemo ublehe  
<ul>
<li>Ako uprskamo mi to kažemo, ako se ne slažemo sa korisnikom po stvarima bitnim za obje strane mi to kažemo.</li>
</ul>
</li>
<li>8) Laganje je zabranjeno  
<ul>
<li>Sjećam se početaka u radu firme. I tada mi je suradnica rekla: hoće&scaron;  li da kažem &ldquo;Direktor je odsutan&rdquo;. Odgovorio sam: &ldquo;Ne, laganje je  zabranjeno u ovoj firmi&rdquo;.</li>
</ul>
</li>
<li>9) Komunikacija bez prostih riječi  
<ul>
<li>Čak postoji klauzula u Ugovoru o podr&scaron;ci bring.out da u slučaju da  smatra da probleme može rje&scaron;avati psovkama, ugovor se može odmah  prekinuti.</li>
<li>Ukoliko se radnik nađe u takvoj situaciji, on bez puno razmi&scaron;ljanja prekida svoju aktivnost.</li>
<li>S druge strane, niti u jednoj situaciji radnik ne smije na psovke odgovarati psovkama.</li>
</ul>
</li>
<li>12) Mi istinski po&scaron;tujemo i uvažavamo svoje klijente  
<ul>
<li>Mi nismo firma u kojoj je dopu&scaron;teno svom klijentu spustiti slu&scaron;alicu ili zalupiti vrata radi nesuglasica.</li>
<li>Mi istinski po&scaron;tujemo svoje klijente. Bez obzira na to da li se sa njima slažemo ili ne.</li>
<li>Istina je da i od svojih klijenata tražimo isto (tačka 9)).</li>
</ul>
</li>
</ul>
<p>Ako neko ima problem sa nama po ovim pitanjima, samo neka samo napi&scaron;e na moj mail da se ne držimo #20863 tačka ta i ta.</p>
<h2>Freak firma</h2>
<p>Po mnogim stvarima mi smo &ldquo;freak&rdquo; firma. Ja sam kreator tog &ldquo;freak&rdquo; sistema.</p>
<p>Je li ovo stvarno blentav sistem  ? Je li  <strong>poku&scaron;aj</strong> da se poslovanje firme bazira na <strong>otvorenosti</strong> i <strong>pravičnosti</strong> samo po sebi utopija ?! Ako je takva postavka neodrživo ovdje, je li ovo globalno blentav sistem ?</p>
<p>Nemam pojma. Ono &scaron;to znam jeste da svaki moj naredni korak firmu jo&scaron; vi&scaron;e tjera u ovom smjeru.</p>
<p>U hendek ? <strong>Lahko</strong>.</p>
<p>Ili je ovo neki novi, odličan model poslovanja ? <strong>Te&scaron;ko</strong>.</p>
<p>Nebitno. Kako god se presaberem, ja i nemam nekog izbora. Siguran sam  da bi neki zaokret ka konvencionalnom poslovanju bio fjasko sa mnom  ovakvim kakav jesam.</p>
<p>Ne znam dobro slagati, ne znam ljude &scaron;armirati &ldquo;onako&rdquo;, gnu&scaron;am se od  podmićivanja &hellip; U svim takvim situacijama pona&scaron;am se k'o zadnji blećak.</p>
<p>Sve to nije svojstveno meni, a sve ključne odluke su u mojim rukama.</p>
<p>Uz sve te moje nesposobnosti prilagođavanja &ldquo;pravom biznisu&rdquo;, ja sam definitivno i nepopravljivi optimista.</p>
<p>Ja vjerujem da posao na ovim principima može biti dobar posao.</p>
<p>Pomoći mi nema. Idem ovako, pa dokle stignem.</p>
<p>Da mi dragi &scaron;to prije Allah providi ako grije&scaron;im.</p>

]]></content:encoded>
	<excerpt:encoded><![CDATA[U Bosni postoji jedan interesantan “poslovni” šablon. Taj šablon sam prozvao “telefonski spam”. Telefonski spam je strategija koja funkcioniše ovako: naklapastiš se na telefon i non-stop zivkaš provajdera (svog davaoca usluga) bez obz...]]></excerpt:encoded>	

	<wp:post_date>Wed Jul 21 23:34:00 -0700 2010</wp:post_date>
	<wp:post_date_gmt>Wed Jul 21 23:34:00 -0700 2010</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>34545465</wp:post_id>
	<wp:post_name>bosnian-business-telefonski-spam</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
