<item>
	<title>RaÄunarske mreÅ¾e, 1. parcijalni</title>
	<link>http://hernad.bring.out.ba/racunarske-mreze-1-parcijalni</link>
	<pubDate>Tue Nov 30 10:36:00 -0800 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad HusremoviÄ‡]]></dc:creator>
	
	
		<category domain="tag" nicename="fit_2_godina"><![CDATA[fit_2_godina]]></category>
	
		<category domain="tag" nicename="fit_mostar"><![CDATA[fit_mostar]]></category>
	
		<category domain="tag" nicename="ispit"><![CDATA[ispit]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/racunarske-mreze-1-parcijalni</guid>
	<description></description>
	<content:encoded><![CDATA[<p><span style="text-decoration: underline;"><strong>Dana&scaron;nja priprema</strong></span></p>
<p>Iako sam imao Äitav dan pred sobom, danas nisam bio pretjerano fokusiran na spremanje ovog ispita.</p>
<p>Razloga je vi&scaron;e: dijelom zato &scaron;to su mi ostali workshop-ovi i vjeÅ¾be za koje <a href="/racunarske-mreze-vjezbe-nepismeno">mi je inaÄe prvi utisak bio: "&Scaron;ta je ba ovo ?!"</a>, dijelom zato &scaron;to sam vazdan ne&scaron;to "Ä‡ukao" po ovom <a href="/fiskalizacija-je-velika-sansa-za-bringout">Älanku</a>, a dijelom i radi toga &scaron;to sam znao da Ä‡u moÄ‡i koristiti literaturu ako negdje zapnem.</p>
<p>Skroz sam podbacio sa planom. Plan je bio da se u prvom dijelu dana proÄitaju vjeÅ¾be i workshop-ovi (1.put), a da na kraju dana jo&scaron; jednom brzinski&nbsp; proÄ‘em po <a href="/racunarske-mreze-predavanja">predavanjjima</a> koje sam jednom proÄitao.</p>
<p>PoÄetak ispita je bio u 18:00, a u 17:30 ja sam tek Äitao vjeÅ¾bu 5: Routeri :(. Workshop-ove ni od&scaron;tampao nisam. &Scaron;ta da radim ?</p>
<p><span style="text-decoration: underline;"><strong>DÅ¾oni hernad, dÅ¾oni</strong></span></p>
<p><!--more--></p>
<p>Idem ja napraviti txt fajlove koje Ä‡u moÄ‡i pretraÅ¾iti. Pa ako ne&scaron;to ne budem znao potraÅ¾iÄ‡u u ovim txt-ovima:</p>
<p><p><a href="https://gist.github.com/722158">https://gist.github.com/722158</a></p></p>
<p>onda sam napravio skriptu za pretraÅ¾ivanje:</p>
<p><p><a href="https://gist.github.com/722162">https://gist.github.com/722162</a></p></p>
<p>i ovo je&nbsp; rezultat jedne pretrage:</p>
<p><p><a href="https://gist.github.com/722165">https://gist.github.com/722165</a></p></p>
<p><span style="text-decoration: underline;"><strong>Koncept ispita</strong></span></p>
<p>Ovaj test se polaÅ¾e od kuÄ‡e.</p>
<p>Bilo je 45 pitanja od kojih nekih 5 esejska.</p>
<p>Esejska su bila (po sjeÄ‡anju):</p>
<ol>
<li>Objasnite &scaron;ta je to switch</li>
<li>Objasnite statistiÄku metodu multipleksiranja</li>
<li>Navedite neke mreÅ¾ne resurse</li>
<li>Navedite <a href="http://en.wikipedia.org/wiki/Nyquist%E2%80%93Shannon_sampling_theorem">Nyquist-Shannon-ovu teoremu</a></li>
<li>Objasni <a href="http://en.wikipedia.org/wiki/Carrier_sense_multiple_access_with_collision_detection">CSMA/CD</a></li>
</ol>
<p><span style="text-decoration: underline;"><strong>Da li je search u redu ?</strong></span></p>
<p>Kod pripreme ispita ni&scaron;ta nije precizirano. Vjerovatno bi bilo smije&scaron;no reÄ‡i studentima: nemojte koristiti literaturu :)</p>
<p>ZnaÄi da je literatura, google, i bilo koji naÄin pomoÄ‡i u ovom polaganju dozvoljen.</p>
<p>E, ja nisam <strong>koristio google ni wikpediju</strong>.</p>
<p>Zato &scaron;to mi je neki dan jedan kolega &scaron;to je ispit poloÅ¾io rekao: "Raja uzme pa jednostavno copy/paste uradi Älanak iz wikipedije i naravno dobije za takav odgovor - 0 poena. Bitno je da barem par rijeÄi izmjeni&scaron; tako da to izgleda kao tvoja formulacija :)</p>
<p>Stvarno, ima smisla. Iako iskreno,&nbsp; i bez njegovog savjeta ne bih nikada mogao biti ofiran. Pa ako i konsultujem wikipediju, smije&scaron;no je da to &scaron;to pi&scaron;em uop&scaron;te ne kontam.</p>
<p>Zato sam se ja pomagao svojim search-om:</p>
<ol>
<li>prelazeÄ‡i predavanja, ionako sam vidio kategorizacije koje mi nisu sjele. Zato su jedini pravi izvor njihovih odgovora Äesto samo materijali sa predavanja i vjeÅ¾bi</li>
<li>Druga je stvar to &scaron;to svako voli da Äuje svoju formulaciju nego li "google top search result"</li>
</ol>
<p>Tako sam i uradio.</p>
<p>Kada bih na&scaron;ao odgovor,&nbsp; prisjetio bih se o Äemu se tu radi, pa onda na svoj naÄin ispisao to &scaron;to sam na&scaron;ao. Tako sam skroz izbjegao copy-paste, a ujedno i to &scaron;to navodim vi&scaron;e ili manje "shavizao". Za&scaron;to da ne: i ispit se moÅ¾e iskoristiti da Äovjek &scaron;tagod nauÄi :)</p>
<p>Adrenalin prisutan na ispitu definitvno pomaÅ¾e pamÄ‡enju.</p>
<p>Vrijeme je ograniÄeno (55 min), pitanja je popriliÄno, ali se Äak&nbsp; i kada ima&scaron; dosta rupa (&scaron;to je sa mnom definitivno bio sluÄaj) moÅ¾e&scaron; se nekako i&scaron;Äupati.</p>
<p>Istina, da sam se spremio kako treba, vjerovatno bi mi za ispit bilo dovoljno 40-tak minuta da uradim bez problema.</p>
<p>Ali sa druge strane, da nisam Äitao, i da mi je tematika strana, izvjesno je da bi bio trofaÄ‡. Bez obzira &scaron;to su mi svi resursi dostupni.</p>
<p><span style="text-decoration: underline;"><strong>LAN kolizijske domene</strong></span></p>
<p>Jedna stvar koju nisam stigao su kolizione domene. To trebam i&scaron;Äitati. To sam taman Äitao na vjeÅ¾bama pa me je ispit omeo :)</p>
<p>Bio je jedan ispit da se defini&scaron;e broj broadcast&nbsp; i kolizijskih domena. Tu sam se zbunio.&nbsp;</p>
<p>Brojao sam tako da je na izmeÄ‘u svakog hosta i switcha postoji jedan domena, dok je izmeÄ‘u hub-a i vi&scaron;e switch-eva to sve jedan kolizijski domen.</p>
<p>IzmeÄ‘u te dvije mreÅ¾e postojao je router. Taj router nisam brojao.</p>
<p>Prema mom brojanju imao sam:</p>
<ol>
<li>5 switch kolizijskih domena (5 hostova vezano sa switchem)</li>
<li>1 hub kolizijski domen (3-4 hosta vezana za switch)</li>
<li>router je odvajao te dvije mreÅ¾e</li>
</ol>
<p>Po meni odgovor je bio:</p>
<p>2 broadcast domene, 6 kolizijskih.</p>
<p>Ali ovog broja 6 u odabiru kolizijskih nisam imao ponuÄ‘enog ?! Je li moguÄ‡e da je odgovor da nije bilo ponuÄ‘enog odgovora ? Ja sam tako ostavio.</p>
<p>Je li to bila zamka ?</p>
<p><span style="text-decoration: underline;"><strong>Ocjena je - prolaz!</strong></span></p>
<p>Bilo ne bilo, na kraju sam dobio rezultat: 60.09%. ZnaÄi prolaz garant. Raspitao sam se i procjena je da esejski dio nosi 20-25%. Od toga me garant sljeduje bar 10% i ja imam Äistu 7. Mashallah!</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[DanaÅ¡nja priprema Iako sam imao Äitav dan pred sobom, danas nisam bio pretjerano fokusiran na spremanje ovog ispita. Razloga je viÅ¡e: dijelom zato Å¡to su mi ostali workshop-ovi i vjeÅ¾be za koje mi je inaÄe prvi utisak bio: "Å ta je ba ovo ?!...]]></excerpt:encoded>	

	<wp:post_date>Tue Nov 30 10:36:00 -0800 2010</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>racunarske-mreze-1-parcijalni</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
