<item>
	<title>Teška poslovna odluka</title>
	<link>http://hernad.bring.out.ba/teska-poslovna-odluka</link>
	<pubDate>Tue Dec 14 05:42:00 -0800 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bringout"><![CDATA[bringout]]></category>
	
		<category domain="tag" nicename="business"><![CDATA[business]]></category>
	
		<category domain="tag" nicename="dunjaluk"><![CDATA[dunjaluk]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/teska-poslovna-odluka</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Jutros sam donio te&scaron;ku odluku. Odluku oko koje sam se "lomio" zadnje dvije hefte.<br />O čemu se radi ?<br />Radi se o <a href="http://www.bring.out.ba/tag/fiskalizacija">projektu fiskalizacije</a>.</p>
<p><!--more--></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Za&scaron;to smo u projekat u&scaron;li kao serviser i distributer fiskalnih sistema ?</strong></span></p>
<p>Na&scaron; pristup tom projektu je bio sljedeći:</p>
<ul>
<li>svi korisnici na&scaron;ih poslovnih aplikacija trebaju fiskalne sisteme</li>
<li>na trži&scaron;tu će se pojaviti "more" distributera i servisera fiskalnih sistema(*) koji će sav svoj posao usmjeriti na "tu&scaron;enje" opreme</li>
<li>da bi prilagodili na&scaron;a rje&scaron;enja fiskalizaciji, postoji velika opasnost da sa takvim "tu&scaron;atorima" moramo "sarađivati"</li>
</ul>
<p>A ta "saradnja" je mučenje. To je isto ko ping-pong loptica. Nije do nas - do njih je. Oni trebaju doći, mi trebamo doći ... To je noćna mora za klijenta, noćna mora za svakog ozbiljnog davaoca usluga. <p />Mi smo smo ozbiljan davaoc usluga. Iako mali, na&scaron;a poslovna strategija nikada nije bolo "levaćenje" klijenata:</p>
<ul>
<li>ne lažemo na telefone.</li>
<li>ne kažemo "sutra ćemo doći" a da pri tome znamo da nećemo</li>
</ul>
<p>Ako silom posla moramo dijeliti poslove sa ovakvima, mi redovno bivamo strana koja "je donja".</p>
<p>Zato je na&scaron; motiv da uđemo u posao fiskalizacije direktno kao serviser i distributer bio, pored zarade i novog posla(*), ova "računica". Ako već ulazimo u ovo sve, hajde da stvari koliko je moguće pojednostavimo sebi i svojim klijentima, i da mi zaradimo a ne tamo neki "ho&scaron;tapleri".</p>
<p>Sve kasnije informacije koje smo dobijali dodatno su potvrdile ova predviđanja. O tome sam ranije <a href="/fiskalizacija-je-velika-sansa-za-bringout">pisao</a>.<p />Sa svih strana je krenula hajka na korisnike:</p>
<blockquote class="posterous_short_quote">
<p>Uvali robu, pa ćemo onda skontati &scaron;ta učiniti".</p>
</blockquote>
<p>Mi smo međutim uzeli jasan pristup: Mi smo uslužna firma. Mi smo "service provider". Za nas je fiskalni sistem uređaj za koji korisnik treba dobiti adekvatnu podr&scaron;ku. A to nije lahko. To ne može svako sa "ledine" učiniti.<p />Na pitanja koliko to ko&scaron;ta na&scaron;a prva rečenica je uvijek bila:</p>
<blockquote class="posterous_short_quote">
<p>Ako od nas tražite bolje cijene, onda se niste na pravu adresu obratili. Mi nismo u hardware biznisu. Mi smo uslužna firma.</p>
</blockquote>
<p>Unutar firme nisam dao mjesta panici. Moje kolege Sa&scaron;a i Jasmin su na početku počeli kukati:</p>
<blockquote class="posterous_short_quote">
<p>Joj biće ovdje puno posla. Joj ovo sve pored na&scaron;ih ostalih obaveza nećemo stići</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>"Freak" klijentski filter</strong></span></p>
<p>Ja sam im odgovarao:</p>
<blockquote class="posterous_short_quote">
<p>Daj prestanite kukati. Nećemo sada trčati po ulici i sazivati ljude: "kupite kupite". Mi ćemo se spremiti na svoj način.</p>
</blockquote>
<p><br />Tako je i bilo. Upiti o fiskalnim sistemima su dolazili, ali većina njih je već nakon prvog kontakta bila:</p>
<blockquote class="posterous_short_quote">
<p>Ja ovih "freak"-ova. Neće da razgovaraju o cijeni hardware-a ... ccc. Ah čudaka ... pričaju o nekakvoj internet podr&scaron;ci ...</p>
</blockquote>
<p>Međutim, taj "freak" sistem je opet imao svoju računicu: nama trebaju klijenti koji znaju da je ovo ozbiljan posao. Takvi klijenti suspremni za tu uslugu i platiti. Klijenti "lahko ćemo", mi to dobro znamo, prave takve glavobolje da se o tome romani mogu pisati.<p />Ukratko, mi smo svojim pristupom napravili selekciju klijenata. <p />Jedan od takvih koraka je bio, da se svakom klijentu koji pokaže istinski interes (vi&scaron;e upita prema nama) odmah otvarao pristup na&scaron;im korisničkim forumima. Na tom mjestu korisniku su sve relevantne informacije o statusu projekta bile dostupne. Tu može na svako pitanje promptno dobiti odgovor. To je ono &scaron;to nas razlikuje od drugih. Mi smo, ko prihvati ovaj način komunikacije, sposobni obraditi puno vi&scaron;e zahtjeva nego vi&scaron;estruko brojnije firme. Ali za to je potrebno da i korisnik "fercera" na taj način. Da, kada mu kaže&scaron;: "po&scaron;aljite email", on ne misli da ga "skida&scaron;" sa dnevnog reda.<p />I opet, od onih koji su se na&scaron;li na na&scaron;im forumima, mnogi se zagube. Takav način komunikacije traži vje&scaron;tinu sa strane korisnika, a to mnogi jednostavno nemaju.<p />Ne, ovo nije priča o tome kako su korisnici "glupi", kako "neće da čitaju", kako su nesposobni a mi "genijalci". Jer to jednostavno nije tako. Mi samo fokus stavljamo na korisnike kojima ovaj vid podr&scaron;ke odgovara.<p />Na&scaron;a ponuda nije stavila "rampu" na korisnike koji ne koriste internet. Takvi, nazovimo ih konvencionalni korisnici, jednostavno moraju vi&scaron;e plaćati za na&scaron;e usluge zato &scaron;to angažuju vi&scaron;e na&scaron;ih resursa.</p>
<p>Ali pustimo se toga. To je dio na&scaron;e poslovne politike, i strategije nastupa prema korisnicima.</p>
<p>To u ovoj priči nije posebno bitna stvar.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Na&scaron; dobavljač</strong></span></p>
<p>Presudan faktor u ovoj priči bilaočekivanja koja smo stavili prema na&scaron;em provajderu - na&scaron;em dobavljaču.<p />Za razliku od kupaca, gdje je nerealno reći: vi morate imati vje&scaron;tinu pisane komunikacije, na relaciji mi - na&scaron; dobavljač, stvari smo drugačije postavili. To je za nas "must be feature" dobavljača. Mi pisanu komunikaciju preferiramo iz jednostavnog razloga:</p>
<blockquote class="posterous_short_quote">
<p>Pisana komunikacija je najefikasniji način komunikacije</p>
</blockquote>
<p>Usmena komunikacija, bla bla sistem tro&scaron;i vrijeme i energiju. A mi kao mala firma tih resursa imamo malo. Vrlo malo. Pa čak i da tih resursa imamo vi&scaron;e, način komunikaciji smatramo faktor na&scaron;e konkurentnosti. Ako jednu te istu stvar može&scaron; ponuditi sa manje resursa, tvoja konkurentnost se povećava.<p />Zato nepostojanje kvalitetnog toga informacija na relaciji kupac &lt;-&gt; dobavljač za nas predstavlja veliki problem.<p />Ako se za svaki problem mora jedan i ba&scaron; jedan čovjek naći, pa ga onda saziva&scaron; telefonom ... to nije to ... takve firme su bez obzira na broj ljudi "one man show firma". Kada mi dobavljač za neku najobičniju informaciju odgovori: "To može odgovoriti samo taj i taj ..." ja se prepadnem.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Sistem</strong></span></p>
<p>Da se razumijemo. Sve odluke u mojoj firmi donosim ja. Ali 99% operacija u firmi su operativne prirode, i one se sve mogu do izvjesne mjere dovesti bez mene. Komunikacija unutar firme mora obezbjediti bezličnost operacija. To i to može uraditi "bring.out" a ne SAMO Sa&scaron;a ili samo Jasko ili samo Ernad.<p />Firma ima veći kapacitet ako se operacije na ovaj način ustroje. Mi smo puno na tom planu postigli. "bring.out" je sistem. Mikro sistem, ali sistem. I ja sam ponosan na to. To je na&scaron; veliki kapital. To je na&scaron; ključni knowhow. Ako taj kapital ne možemo iskoristiti mi smo na velikom gubitku.<p />Nakon neizbježne priče o sistemu, bližim se problemima.<p /><span style="text-decoration: underline; font-size: medium;"><strong>Problemi</strong></span><p />Svako ko i&scaron;ta zna o informatici, kreće od ove činjenice:</p>
<blockquote class="posterous_short_quote">
<p>Svaki software ima bug-ove.</p>
</blockquote>
<p>Svako ko i&scaron;ta zna o hardware-u, zna i ovo:</p>
<blockquote class="posterous_short_quote">
<p>Svaki dana&scaron;nji hardware u sebi sastoji software =&gt; Svaki hardware ima bug-ove.</p>
</blockquote>
<p>Filozofiram? Ako tako mislite, pa onda brate komotno razgulite. Ne znam ni kako ste dovdje do&scaron;li sa čitanjem :)<p />Sljedeća stavka u gornjem nizu postavki je:</p>
<blockquote class="posterous_short_quote">
<p>Svaki service provider zna da software i harware imaju bug-ove. Da bi korisnik bio zadovoljan service provider treba dobro "hendlirati" (obrađivati) te bug-ove.</p>
</blockquote>
<p>To mora biti mantra service provider-a. Ako servis provajder počne da lupeta kao "salesman":</p>
<blockquote class="posterous_short_quote">
<p>Ma kod nas sve radi, ni&scaron;ta se ne brinite - samo kupite ...</p>
</blockquote>
<p>taj service provider ulazi u zamku da on ima prefix "ublehar" service provider.<p />Napravimo kratki rezime:</p>
<ul>
<li>software i hardware imaju bug-ove</li>
<li>service provajder je zadužen da te bug-ove rije&scaron;ava</li>
</ul>
<p>Kako ? Kako onda jedan service provider bude bolji od drugoga. Opcija je vi&scaron;e:</p>
<ol>
<li>odabire proizvod sa manje bug-ova</li>
<li>odabire dobavljača - proizvođača koji je brži u otklanjanju bug-ova u odnosu na konkurenciju</li>
<li>odabire dobavljača koji ne baca lopticu: "do vas je ..."</li>
<li>odabire dobavjača koji zna &scaron;ta je davanje usluga krajnjem korisniku</li>
</ol>
<p>Uočite: nigdje se ne pominje <strong>idealan proizvod</strong>. Takvo &scaron;to na dunjaluku nema.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Princip spojenih posuda</strong></span></p>
<p>Pogledajmo ovu shemu:<p /><strong>krajnji kupac &lt;-&gt; dobavljač (dob_1) &lt;-&gt; generalni dobavljač (dob_2) &lt;-&gt; proizvođač</strong><p />U ovoj shemi imamo tri linije komunikacije. Dok se proizvod dostavi krajnjem kupcu desi se komunikacijama na svim ovim linijama.<p />Ako bilo koja linija pukne:</p>
<blockquote class="posterous_short_quote">
<p>kupac je donji.</p>
</blockquote>
<p>Ako bilo koja linija između "dob_1" i proizvođača pukne, niko ne može "dob_1" "oprati" kod kupca. Imamo princip spojenih posuda.<p />Ako bilo ko počne "ublehariti" ta "ubleha" dolazi kupcu. I za kupca je "dob_1" uvijek glavni krivac. <p />A ja tome dodajem: "Pa i jeste - dob_1 je mogao birati svog dobavljača i krajnjeg proizvođača. To je njegova obaveza".<p /><span style="text-decoration: underline; font-size: medium;"><strong>Osnovna funkcija firme - isporuči svojim klijentima ono &scaron;to trebaju</strong></span></p>
<p>Poslovne veze uvijek imaju vi&scaron;e dimenzija. U Bosni i jo&scaron; vi&scaron;e nego li drugdje. <p />Recimo, ja sam <a href="/bosanski-nacionalista">bosanski nacionalista</a>. To utiče na moje poslovne odluke i stavove. Jedna od ključnih stvari koja određuje moju firmu je:</p>
<blockquote class="posterous_short_quote">
<p>bring.out, ako ikako može nudi&nbsp; "bosanski knowhow".</p>
</blockquote>
<p>Međutim, u poslu moraju postojati granice. Mogu ja biti &scaron;ta god hoću, ali moram imati na umu:</p>
<blockquote class="posterous_short_quote">
<p>Ako moja ponuda kupcu ne odgovara, ja sam donji.</p>
</blockquote>
<p>"Slatkim pričama" - "ubleharenjem" se može dobiti kupac. Ali to ima svoj rok trajanja. Takođe, sama firma mora biti spremna da "ubleharenje" zove "manevrisanjem", da lo&scaron;u uslugu zove "pa nije to ba&scaron; ni tako lo&scaron;e".</p>
<p>Takvog "biznisa" ima i biće dok je dunjaluka. Ali svako ko na tim principima zasniva svoj "biznis" mora imati sposobnost <strong>samolaganja</strong>, <strong>relativizacije sopstvenih nedostataka</strong> ili jednostavo djelovanja na principu: "<strong>ja sam lopov, al' dobro zaradim pa &scaron;ta sad ?!</strong>".<p />Ne ne ne! Ne zovem ja nikoga lopovom. Niti markiram bilo kojeg svog partnera kao takvog. Ako nekoga smatram lopovom, neću se libiti da to kažem. Zato smirite doživljaj ...<p /><span style="text-decoration: underline; font-size: medium;"><strong>"bring.out" ubleharenja</strong></span><p />Ja se prije svega bavim svojom firmom. I poku&scaron;avam rad svoje firme organizovati na taj način da moje poslovanje ne krene u dubioze "muljanja" i "ubleharenja". Puno puta to nisam uspio. Nisam ulazio u posao sa namjerom da nekoga prevarim. Ali se de&scaron;avalo da sam na kraju svoje klijente, kad se sve sabere - o&scaron;tetio. Obećavao, a nisam ispunio. Nisam namjerno ? Pa &scaron;ta. To je bilo u dobroj namjeri ? Pa &scaron;ta.</p>
<p>Da bi čovjek ove gre&scaron;ke ispravio, on ih prije svega mora sebi pred lice "fljasnuti". Ja sam tu sposobnost, elhamdulillah, uvijek imao. Ponese čovjeka sva&scaron;ta, počne pričati lupetati, obećavati. Ali na kraju se mora "ćiza" podvući.</p>
<p>U na&scaron;oj frmi se to na kraju uvijek pravim imenom nazivalo:</p>
<blockquote class="posterous_short_quote">
<p>Uprskali smo !</p>
</blockquote>
<p>Tek kada bi do&scaron;li do tog zaključka, stvari bi se počele kretati nabolje.</p>
<p>Nakon svakog pogre&scaron;nog projekta, dolazio sam do istog zaključka:</p>
<blockquote class="posterous_short_quote">
<p>Sistem. Mi nemamo sistem. Kada ima&scaron; sistem, onda se ovakve gre&scaron;ke mogu izbjeći.</p>
<p>Znanje. Mi nemamo znanje. Kada ima&scaron; znanje onda čuda može&scaron; napraviti.</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Al' nije bilo do nas !?</strong></span></p>
<p>U sistemu poslovanja svake firme postoje eksterni faktori:</p>
<ul>
<li>dobavljači</li>
<li>država</li>
<li>konkurencija</li>
</ul>
<p>Svaki do tih faktora utiče na svoj način. Kombinacija tih faktora određuje poslovanje firme. Država je faktor koji je za sve firme konstanta. Konkurencija takođe, najvećim dijelom. Dobavljači su elementi koji svaka firma može i treba odabrati.<p /><span style="text-decoration: underline; font-size: medium;"><strong>Povjerenje</strong></span><p />Međutim, promjena dobavljača nije isto &scaron;to i promjena čarapa. To je u većini slučajeva bolan proces.<p />Mnoge firme upravo na ovu kartu i računaju: kada "ćopim" kupca, onda mi on neće tako lahko ispasti. "bring.out" nikada nije takvo pristupao. Mi takav nastup smatramo prevarom. Zato smo uvijek nastojali na&scaron;em kupcu objasniti &scaron;ta i kako nudimo. <p />Uvijek smo puno polagali u stvaranje odnosa povjerenja. <p />Na jednoj od na&scaron;ih stranica postoji sekcija koju ja jednim imenom zovem <a href="http://www.bring.out.ba/pages/knowhow-level#halal">halal sekcija</a> :) <p />Ja sam budala ? Po&scaron;tenjačina ? To tako ne može u realnom svijetu ?!<p />Ok. Ok. Ok. Svakom svoje. Ja mislim da ovako MOŽE.<p />Ako imam knowhow, ako to nudim po konkurentnoj cijeni, uop&scaron;te nema potrebe za ubleharenjem. To je moj princip, i ja taj princip prenosim na djelovanje moje firme.</p>
<p>Za&scaron;to mislim da je to moguće ?</p>
<p>Kao musliman, da to nije moguće, onda bi u Qur'anu časnom pisalo ne&scaron;to ovako:</p>
<blockquote class="posterous_short_quote">
<p>Budi po&scaron;ten, osim u poslu gdje ..</p>
</blockquote>
<p>JaaRabbi. Tamo pi&scaron;e:</p>
<blockquote class="posterous_short_quote">
<p>Ne zakidaj na kantaru ... budi iskren ...</p>
</blockquote>
<p>Ako u Knjizi, koja je Istina za svakog muslimana, ne postoji "izuzetak" po pitanju po&scaron;tenja u biznisu, onda mora biti moguće na tim principima raditi!</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Konsekvence "halal" principa</span></strong></span><p />Na dunjaluku ni&scaron;ta nije idealno. Svemu treba tražiti granicu i mjeru.<p />Gre&scaron;ke ne pravi samo onaj ko ni&scaron;ta ne radi. A ja moram raditi i djelovati. Svaki posao nosi rizik problema i neuspjeha:</p>
<blockquote class="posterous_short_quote">
<p>Posao i problemi su dva nerazdvojna druga.</p>
</blockquote>
<p>Poslovni interesi, borba za novcem veoma često udare na principe o kojim govorim. <p />&Scaron;ejtan za sekundu čovjeka počne savjetovati:</p>
<blockquote class="posterous_short_quote">
<p>Nije to prevara. To je poslovni rizik. Ako ti ne uzme&scaron;, neko će drugi!</p>
</blockquote>
<p>Ne bojte se ... ne haluciniram. Ovo je literalna alegorija(**) :)<br />&nbsp;&nbsp; <br />&Scaron;alu na stranu, ovakve situacije u poslu nisu rijetke. Dapače. <p />U projektu fiskalizacije sam napravio jednu gre&scaron;ku: bez previ&scaron;e analize sam odabrao jednog dobavljača. <p />Time sam poziciju svoje firme i svojih klijenata u startu ograničio. Moja odluka je bila bazirana vi&scaron;e na povjerenju, manje na provjerenim činjenicama. Do mene.<p />Međutim, kako god stvari stajale, ja uvijek predo dobavljača nastupim na način koji je u skladu sa principima djelovanja na&scaron;e firme:</p>
<ul>
<li>ako mi se ne&scaron;to ne sviđa - ja to jasno kažem</li>
<li>ako ne&scaron;to želim - ja to opet jasno kažem</li>
<li>ako ne&scaron;to ne želim - ja to bez dileme kažem</li>
</ul>
<p>I onda pratim kako druga strana djeluje ... Iskrenost i povjerenje su osnova dobrog odnosa.</p>
<p>Dobavljači na kritike odgovaraju na različite načine:</p>
<ol>
<li>no answer</li>
<li>biće sve uredu - ali ni&scaron;ta bitno po tome ne poduzme</li>
<li>počne ti držati lekcije kako si ti papak, i kako je sve do tebe</li>
<li>detaljno pročita tvoje zahtjeve,&nbsp; kritički se obrati po svim stavkama i kaže: ovo prihvatam zato i zato, ovo ne prihvatam zato i zato, ovo trebate vi popraviti tako i tako ...</li>
</ol>
<p>Kada imam posla sa dobavljačem 4), bez obzira koliki problemi bili, ja imam povjerenje. Kada "namiri&scaron;em" da je moj dobavljač iz klase 1-3) ja se prepadnem "samo tako".<p />U poslu sa fiskalizacijom nam se to desilo. Kako u poslu stvari uvijek idu, vremena za djelovanje uvijek ima malo ili nikako.<p />Kockice se ne mogu složiti u trenutku, a kada se počnu slagati, često je stvar već gotova!<p />Sinoć sam bio u totalnoj magli. Jučera&scaron;nji kontakti sa dobavljačem su ličili na pravu parodiju. Međutim, smijehu nije bilo mjesta. <p />Mi smo bili akteri parodije. Sistemom spojenih posuda ta parodija se "prelijevala" na&scaron;im klijentima. U 14:00 kažemo sve je ok, u 15:00 ni&scaron;ta nije ok ... u 16:00 opet je sve ok ...<p />Ne, neću iznositi detalje. To je sada najmanje bitno. <p />Nakon &scaron;to su na&scaron;i kupci svi prihvatili na&scaron;e ponude u 16:00 i rekli: ujutro pu&scaron;tamo novac ... ja opet nisam mirovati.<p />Sve mi je govorilo:</p>
<blockquote class="posterous_short_quote">
<p>Ernade, zanemaruje&scaron; struku. Ernade, zanemaruje&scaron; principe poslovanja "bring.out"</p>
</blockquote>
<p>Dobavljač nije bio spreman da se uhvati u ko&scaron;tac sa problemima na način kako sam ja očekivao,&nbsp; a mi bez te pomoći možemo samo "lajati na zvijezde".</p>
<p><span style="font-size: small;"><strong>Nije problem u samoj činjenici da postoje problemi. Problem je neprihvatanje te činjenice - nepreuzimanje svog dijela odgovornosti. Nije čak dovoljno niti reći: "Ja sam pogrije&scaron;io". Treba ponuditi rje&scaron;enja: "Tada i tada ćemo to ispraviti, ovo ne možemo ispraviti zato i zato, ovo ne želimo ispraviti zato i zato ..."</strong></span><p />Nakon &scaron;to smo zavr&scaron;ili radni dan, i &scaron;to je dogovor sa na&scaron;im klijentima bio: "Ujutro plaćate, potpisujemo ugovore"<p />... ja nisam mogao mirovati. Poluo&scaron;amućen proteklim danom rekao sam svom kolegi Sa&scaron;i:</p>
<blockquote class="posterous_short_quote">
<p>Otiđi kod tih Zeničana(***) &scaron;to raja od njih masovno kupuje uređaje po Zenici i vidi kakvi su - kakvi su im uređaji, kakvi su oni</p>
</blockquote>
<p>Sa&scaron;a se vratio sa pozitivnim utiscima.</p>
<blockquote class="posterous_medium_quote">
<p>Oprema mi izgleda robusna,&nbsp; Dočekali su me krajnje ljubazno, uveli u magacin, pokazali uređaje, objasnili da su tokom dana isporučili 100 uređaja ... Nude nam distributerski rabat ...</p>
</blockquote>
<p>"Ma pusti sad rabat ...", odgovorio sam. <p />Ostavio sam da stvar prenoći.<p />Čitavu noć sam u magnovljenju pravio računicu<p /><span style="text-decoration: underline;"><strong><span style="font-size: medium;">nastaviti&nbsp; sa postojećim dobavljačem</span></strong></span>:<br /><strong><span style="font-size: medium;">+</span></strong> dobri prihodi za firmu<br /><strong><span style="font-size: medium;">-</span></strong> prihvata&scaron; odnose sa dobavljačem koji nisu u skladu sa tvojim principima<br /><span style="font-size: medium;"><strong>-</strong></span> laže&scaron; sebe i govori&scaron; neutemeljeno: "ma biće sve u redu". <p /><span style="text-decoration: underline;"><strong><span style="font-size: medium;">stopiraj operacije sa postojećim dobavljačem</span></strong></span><p /><span style="font-size: medium;"><strong>-</strong></span> većina dosada&scaron;njih aktivnosti na projektu fiskalizacije padaju u vodu<br /><strong><span style="font-size: medium;">+</span></strong> &scaron;titi&scaron; svoje klijente<br /><span style="font-size: medium;"><strong>+</strong></span> &scaron;titi&scaron; integritet i principe djelovanja svoje firme: nastupa&scaron; prema klijentima otvoreno, bez obzira &scaron;to udara&scaron; direktno po svom džepu<br /><span style="font-size: medium;"><strong>-</strong></span> "ustupa&scaron;" svoje klijente drugima<br /><span style="font-size: medium;"><strong>-&nbsp; </strong></span>bez obzira &scaron;to misli&scaron; na svoje kupce, oni će jedino uočiti kako si 5x u toku 24 sahata promjenio odluku<br /><span style="font-size: medium;"><strong>+</strong></span> prema postojećim parametrima, postoji veliki rizik da ovaj posao brzo postavne VELIKA GLAVOBOLJA za bring.out. <p />Odluka je pala. Ujutro sam javio Sa&scaron;i:</p>
<blockquote class="posterous_short_quote">
<p>Sa&scaron;a reci svim klijentima da ne uplaćuju nama</p>
</blockquote>
<p>Usmjeri ih na drugog dobavljača. Informi&scaron;i ih da ćemo mi obezbjediti podr&scaron;ku za na&scaron; software fiskalnog sistema tog dobavljača uz toliku i toliku naknadu.<p />Sa&scaron;a je podržao moj odgovor. I on je dijelio mi&scaron;ljenje da je to u ovom trenutku najbolji potez na nas.<p />Mi smo service provajder. Nama je klijent na prvom mjestu. <p /><span style="text-decoration: underline; font-size: medium;"><strong>Na&scaron; odnos prema dobavljaču</strong></span><p />Čitav ovaj proces je "podgrijan" na&scaron;om informacijom o rezultatima <a href="http://www.bring.out.ba/fiskalizacija">testiranja fiskalnog sistema</a> <p />Ta informacija je pored ostalo bila i "udica" da se isprovociraju reakcije.<p />Ali da budem jasan, to je bio samo jedan od ciljeva tog članka. <p />Glavni cilj članka je bio:</p>
<blockquote class="posterous_short_quote">
<p>Informi&scaron;imo svoje klijente dokle smo "dobacili".&nbsp;</p>
</blockquote>
<p>Na članak smo dobili komentare dobavljača:</p>
<ul>
<li>bring.out je nesposoban</li>
<li>bring.out je bezobrazan</li>
</ul>
<p>Ovo mi je pomoglo da svoje odluke objektiviziram i da dam konačan sud o dobavljaču. Ko ne vidi dalje "od svog nosa" i ne primjeti da je ovo bio poziv da se stvari poprave dok jo&scaron; ima vremena (*****), da je ovo poziv za pomoć, sva dalja priča gubi smisao.</p>
<p>Koncept izlaganja informacija putem video materijala je odlična stvar, posebno podr&scaron;ka korisnicima. Međutim, kolege su u tome svemu vidjeli samo "pljuvanje" i indiskreciju. Peke. Mi očigledno nismo kompatibilni.<p />S obzirom da je informacija poslana na niz adresa(*****), pratio sam reakcije. I one su, kao niz puta do sada, izostale. <p />Rezultati analize dobavljača su bili jasni k'o dan. Da mi je brat rođeni sa druge strane, on nije dobar dobavljač za bring.out.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Knowhow projekat<br /></span></strong></span></p>
<p>U bring.out-u se u posljednjih mjesec dana puno toga izde&scaron;avalo. Fiskalizacija jeste označena kao bitan projekat za firmu, ali je na ponderu bitnosti&nbsp; daleko iza <a href="http://www.bring.out.ba/knowhow">knowhow projekta</a>. Knowhow je na&scaron; strate&scaron;ki projekat. Knowhow je biti ili ne biti bring.out-a.</p>
<p>Problemi koji su se desili na projektu fiskalizacije su negativno uticali na knowhow. Princip spojenih posuda: Umjesto da se posvetimo knowhow projektu, svi smo se u firmi "zakucali" na problemima oko fiskalizacije.</p>
<p>Odluka o suspenziji na&scaron;ih aktivnosti u ulozi servisera i distributera fiskalnih sistema će nam, aBd, pomoći da svoj strate&scaron;ki projekat nastavimo u punom kapacitetu.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Otvorena firma</span></strong></span></p>
<p>bring.out je otvorena firma. Ovu informaciju smo objavili na <a href="http://www.bring.out.ba/bringout-suspenduje-svoje-operacije-u-ulozi-s">na&scaron;oj službenoj stranici</a>.</p>
<p>---<p />(*) kao &scaron;to je slučaj sa prodajom hardware-a<br />(**) ili &scaron;ta već pojma nemam, ah taj moj bosanski, pravi sam neznalica<br />(***) Drugi distributer i serviser fiskalnih sistema<br />(****) Objektivno ima sigurno jo&scaron; 10-tak dana dok ne krenu inicijalne fiskalizacije prvog kruga korisnika<br />(*****) Kada govorim: "dobavljač", ne mislim na jednu firmu ili jednog čovjeka, mislim na sve koji su u ovom projektu imali tu ulogu naspram nas</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Jutros sam donio tešku odluku. Odluku oko koje sam se "lomio" zadnje dvije hefte.O čemu se radi ?Radi se o projektu fiskalizacije. Zašto smo u projekat ušli kao serviser i distributer fiskalnih sistema ? Naš pristup tom projektu je bio sljede...]]></excerpt:encoded>	

	<wp:post_date>Tue Dec 14 05:42:00 -0800 2010</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>teska-poslovna-odluka</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
