<item>
	<title>100-ti blog post</title>
	<link>http://hernad.bring.out.ba/100-ti-blog-post</link>
	<pubDate>Fri Dec 24 12:33:00 -0800 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="dunjaluk"><![CDATA[dunjaluk]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/100-ti-blog-post</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Kada sam u junu napisao članak <a href="http://hernad.bring.out.ba/bosna-glup-lud-il-bahat" class="postlisting_title">Bosna: glup, lud il' bahat</a><span class="postlisting_title">, i objavio <a href="https://github.com/hernad/blog/blob/master/articles/glup-lud-bahat-20100605.markdown">njegov link na facebook</a>-u, nije mi palo na pamet da ću u narednih pola godine ispisati 100 članaka ... čitav roman čovječe.</span></p>
<p><span class="postlisting_title">U početku, moja najveća insipracija je bilo iskustvo studiranja na <a href="/tag/fit_mostar">FIT</a>-u.&nbsp; Članak po članak, uočio sam jednu stvar:</span></p>
<blockquote class="posterous_medium_quote">
<p>Ljudima je &scaron;okantno kada neko priča otvoreno, iskreno, bez pardona. Do&scaron;ao je vakat da je &scaron;okantnije biti iskren nego li nekoga nožem probosti ili gologuz gradom prohodati. JaaRabbi!&nbsp;</p>
</blockquote>
<p><!--more-->Za razliku od priča na temu "svi su isti, sve ne valja ...", &scaron;to psiholozi(*) zovu "generalizacija", ja probleme konkretiziram. I personaliziram. I to je &scaron;okantno. Ba&scaron; interesantno ...</p>
<p>Prosto je nevjerovatno do kog stadija smo mi kao dru&scaron;tvo do&scaron;li ...&nbsp; Koliko smo otupili. Koliko nas nije briga. I koliko smo kukavice.</p>
<p>Moja Dženana je jedna od rijetkih osoba od koje dosta toga pametno čujem(**). Kada se svojevremeno desila tragična smrt Denisa Mrnjavca, svi su vikali:</p>
<blockquote class="posterous_short_quote">
<p>Koja sramota ... kako se takvo &scaron;to moglo desiti. Svi su samo gledali kako dijete bodu !?</p>
</blockquote>
<p>Dženana je to prokomentarisala otprilike ovako:</p>
<blockquote class="posterous_medium_quote">
<p>&Scaron;ta je ovim ljudima? Za&scaron;to ne pitaju psihologe? (Ne)reagovanje, posebno u dru&scaron;tvu kakvo je na&scaron;e, nije uop&scaron;te frapantno. Da bi ljudi reagovali drugačije, oni moraju imati pozitivne poticaje da to učine. Ako toga nema, većina će se, da bi sebe za&scaron;tititla, povući. I to se desilo. Sa naučnog stanovi&scaron;ta očekivano.</p>
</blockquote>
<p>Niko nema hrabrosti reći:</p>
<blockquote class="posterous_short_quote">
<p>Desilo nam se, i to nije slučajno. To je očekivano! I objasniti to bez ubleha i "&scaron;upljiranja".</p>
</blockquote>
<p>Ali, da bi se na taj način govorilo treba <strong><span style="color: #ff0000; font-size: medium;">znanje</span></strong>. I treba <span style="color: #ff0000;"><strong><span style="font-size: medium;">hrabrost</span></strong></span>. Ovakve izjave često ne idu "niz dlaku" &scaron;irokim narodnim masama. Ovakve izvjave su redovno nepopularne.</p>
<p>Ne može svak' "po selu pjevati" o informatici, o psihologiji, o obrazovanju ...</p>
<p>Osim u Bosni ... Ma kakvi "pjevati" - u Bosni može i predavati !</p>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;">Semiha Borovac</span></span></strong></p>
<p>Sjetim se sada da je u to vrijeme gradonačelnica Sarajeva bila Semiha Borovac. Dovoljno mi je od nje ranije bilo čuti par rečenica da bih zaključio:</p>
<blockquote class="posterous_short_quote">
<p>Jedna prosječna, ako ne i ispodprosječna žena. Mediokritet.</p>
</blockquote>
<p>Njene izjave: "Majka Sarajeva i slično" taj moj stav su samo "zabetonirale".</p>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;">I gdje je danas Semiha ?</span></span></strong></p>
<p>Danas je <a href="http://razglasaj.ba/?p=8317">Semiha državna koordinatorica za reformu javne uprave u BiH</a></p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Na&scaron;i mediji su "prdimahovina"</span></strong></span></p>
<p>Na&scaron;i mediji vole govoriti o sebi kao perjanicama demokratije. Osim sporadičnih izuzetaka, oni su međutim vjerva slika dru&scaron;tva.&nbsp; Oni su "ordimahovina", poligon za "ubleharenja" i "&scaron;upljiranja" na svakojake teme.</p>
<p>Otkud mi sad dođe priča o medijima ?</p>
<p>Nađite mi samo jedan članak u kome se neko uhvatio za glavu zato &scaron;to je ova žena-mediokritet vođa ovako bitnog projekta. Ljudi, ta žena ne može reformisat mahalu a ne kamo li državnu upravu BiH !</p>
<p>Te stvari se vi&scaron;e ne tiču "pljuvača" iz "Avaza"(***). Ni senzacionalista iz "Dana" ... Na&scaron;ih perjanica demokratije.</p>
<p>Kada je bilo "trendi" pljuvati po nesposobnosti Semihe kao gradonačelnice Sarajeva, to se radilo iz svih oružja i oruđa. Čim je "sjahala" sa pozicije koja je pogodna za "medijsku trehačinu", nema vi&scaron;e priče o Semihi ... papa Semiha.</p>
<p>A ta Semiha je&nbsp; sada deset puta "ubojitija" nego li je bila kao gradonačelnica:</p>
<blockquote class="posterous_short_quote">
<p>Državna uprava će "landarati" uprazno jo&scaron; narednih 50 godina, ako se po Semihi pita ...</p>
</blockquote>
<p>Ne zato &scaron;to je Semiha bezobraznica koja nam želi zlo. <span style="font-size: medium;"><strong><span style="color: #ff0000;">Nego zato &scaron;to Semiha: NE ZNA !</span></strong></span></p>
<p>Semiha ne zna ni &scaron;ta je reforma ni &scaron;ta je državna uprava, ni &scaron;ta je sistem. Semiha pojma nema. Semiha je tu, zato &scaron;to se u ovom dru&scaron;tvu sve izvrnulo naopačke.</p>
<p>U tom istom dru&scaron;tvu je prof. dr. Nijaz Bajgorić <a href="/uos-knjiga-1-procitana">uvaženi profesor</a>. Takvih "velikana" ima kol'ko ti du&scaron;a želi: Nežad Branković - mr. "Razguligu" , onaj kabadahija SBiH gdin.&nbsp; Bahtić iz Unsko-sanskog kantona ... Gdje su oni sada ?</p>
<p>Oni medijima vi&scaron;e nisu bitni. Da bi te mediji "prali" to valjda mora&scaron; zaslužiti ... Mora&scaron; biti na adekvatnoj poziciji, a ne tamo neka sitna riba k'o &scaron;to je sada Semiha &amp; jarani.</p>
<p>Da se razumijemo:</p>
<blockquote class="posterous_short_quote">
<p>Glavni krivci nisu ni Nijaz ni Semiha ni Nedžad ni gdin Bahtić ...</p>
</blockquote>
<p><span style="font-size: medium;"><strong><span style="color: #ff0000;">Krivi su njihovi politički mentori, mentori na  fakultetima, recenzenti njihovih "naučnih" knjiga i radova.</span></strong></span> Oni su morali reći:</p>
<blockquote class="posterous_medium_quote">
<p>Ti Nijaze , &scaron;to se informatike tiče, može&scaron; samo držati početne kurseve računara, a i sa tim budi zadovoljan. <br />Ti Semiha može&scaron; reformisati MZ Buća-potok i to ti je sestro maksimum ... <br />Ti Nedžade zaboravi na to da bude&scaron; veliki manager i priča&scaron; o velikom business-u - "usr'o" si državu ko rijetko ko - a im'o si brate jaku konkurenciju ...<br />Ti gdine Bahtiću može&scaron; samo organizovati "Čevljansku koridu". To će ti "pasati". Pa kad se naljuti&scaron;, a ti udri na bika - i mirna Bosna!</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Meritokracija</strong></span></p>
<p>Par puta sam već pisao o tome za&scaron;to blogiram. Zadnji, možda i najcjelovitiji članak na tu temu je <a href="/savjet-moga-babe">"Neću da budem fikus"</a>. Zato ću se potruditi da izbjegnem ponavljanja.&nbsp;</p>
<p>Moji tekstovi su te&scaron;ki, zahtjevni, nerijetko konfuzni. Moji tekstovi znaju biti arogantni, na granici bezobrazluka. Ali svi oni imaju jednu zajedničku crtu:</p>
<blockquote class="posterous_short_quote">
<p>Ja svoje stavove nastojim, kako znam i umijem, argumentirati !</p>
</blockquote>
<p>Takav način komunikacije, ma koliko on bio grub, je poziv na dijalog. Na dijalog na principima <a href="http://en.wikipedia.org/wiki/Meritocracy">meritokracije</a>.</p>
<p>Meritokraciju sam pomenuo u članku <a href="/miletova-japanska-chenifa-i-cestit-posao">"Miletova japanska chenifa i čestit posao"</a>, kao koncept djelovanja u <a href="http://www.bring.out.ba">bring.out</a>-u:</p>
<ul>
<li>odluke po određenim pitanjima donose oni koji su u predmetnoj oblasti najmeritorniji - oni koji posjeduju najveći stepen znanja i kompetencija</li>
<li>svako može da izrazi svoje neslaganje sa postojećim stavovima i načinom djelovanja - ali pri tome mora biti dovoljno upućen u temu, te pružiti smislenu argumentaciju svojih teza</li>
<li>ko lupeta k'o "Martin po diviziji", taj se po kratkom postupku biva eliminisan iz diskusije =&gt; "pametnjakovićima" pristup zabranjen</li>
</ul>
<p>Generalno, meritokracija se bazira na činjenici da se produktivna diskusija može desiti tek onda kada svi koji učestvuju u diskusiji utro&scaron;e dovoljno energije na pripremu za diskusiju.</p>
<p>Da bi kritikovao moje članke, mora&scaron; ih pročitati. Ako se određena tema obrađuje na vi&scaron;e članaka, mora&scaron; sve te članke proći ako želi&scaron; ozbiljno razgovarati sa mnom ... Bez toga je svaka diskusija besmislena. Ako ti ne cijeni&scaron; trud koji sam ja uložio na izlaganje svojih stavova, za&scaron;to bih ja sa tobom uop&scaron;te diskutovao ? Jesi li to krenuo reći:</p>
<blockquote class="posterous_short_quote">
<p>Zato &scaron;to sam profesor ! Zato &scaron;to sam vlast ! Zato &scaron;to sam ja neko !</p>
</blockquote>
<p><a href="/kvazi-fakulteti">Formalne titule</a> nikoga apriori ne čine meritornim. One su samo indikatori da bi neko mogao biti meritoran.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">hernad-ovi bug-ovi</span></strong></span></p>
<p>Iskreno bih volio da se na mom blogu pojave diskusije sa neistomi&scaron;ljenicima. Ali isključivo na principima meritokracije. Nažalost takvo &scaron;to se jo&scaron; nije de&scaron;avalo. Za&scaron;to ?</p>
<blockquote class="posterous_short_quote">
<p>Možda zato &scaron;to mi je "svaka na mjestu" !?</p>
</blockquote>
<p>He he he&nbsp; ... Dragi moji čitaoci, možda sam lud, al' takav glupan ili egocentrik nisam. Ja dobro znam da sam u 100 članaka barem 50 "bombi kragujevki bacio". Ja sam informatičar:</p>
<blockquote class="posterous_short_quote">
<p>Svaki sistem, svaki proizvod ima bugove.</p>
</blockquote>
<p>Zato znam da u mojim člancima, koji su opet refleksija mojih stavova, ima "more" bug-ova. Ono &scaron;to ne znam jeste:</p>
<blockquote class="posterous_short_quote">
<p>Koliki su ti bug-ovi? Jesu li prežno minor ili major(****) ? Jesam li na kraju stvarno budaletina, ili sam pametan čovjek u koji živi u antisistemu ?</p>
</blockquote>
<p>Kako to saznati ?</p>
<blockquote class="posterous_short_quote">
<p>Komunikacijom ... Komunikacija je zakon. Ali ponovo - ta komunikacija mora biti na principima meritokracije ...</p>
</blockquote>
<p>Ljudi u Bosni izbjegavaju diskusije. Mi na tom nivou da se diskusijama nazivaju takmičenja u psovanju. Iz tog razloga, većina tih diskusija zavr&scaron;i i prije nego započne:</p>
<blockquote class="posterous_short_quote">
<p>Neću da se prepirem ...</p>
</blockquote>
<p>je čest odgovor kod nas. Nikada nisam čuo da je neko izjavio:</p>
<blockquote class="posterous_short_quote">
<p>Ne znam da se prepirem, ili ne znam da diskutujem !</p>
</blockquote>
<p>Takvo &scaron;to nikada nisam čuo. A najče&scaron;će upravo ovo zadnje posrijedi.</p>
<p>Jesam li vam dosadan sa svojim "soljenjem pameti" ? Valjam li gluposti ? Pretjerujem li&nbsp; ?</p>
<p><span style="font-size: medium;"><strong><span style="color: #ff0000;">Pa udarite ljudi !&nbsp; Budite hrabri ! Ne budite "njanje". Budite odrasli ... "Krehnite" mi aperkat pa onda odmah direkt svojim pametnim zapažanjima ! Pomozite mi da ispravim svoje bug-ove !<br /></span></strong></span></p>
<p><span style="font-size: medium;"><strong><span style="color: #ff0000;">Ako kojim slučajem dijelite moje stavove, recite to. Ne bojte se !</span></strong></span></p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Želim da ostanem amomiman</span></strong></span></p>
<p>Danas, neposredno prije ovog članka desilo se ne&scaron;to sjajno. I to desilo se ba&scaron; na ovom blogu.</p>
<p>U predhodnom <a href="/ipak-tako-ne-mora-biti">članku</a> sam uz pomoć gdje Amele, državnog službenika, dobio prvi konkretan rezultat svog blogiranja. Moje pisanje je proizvelo ne&scaron;to konkretno. I dodatno, taj državni službenik se ikakve ograde konstruktivno uključio u diskusiju i potpisao punim imenom i prezimenom. E pa svaka čast gdjo Amela.</p>
<p>Ovako sam ja pročitao Amelin puni potpis:</p>
<blockquote class="posterous_short_quote">
<p>Ja sam državni službenik koga je briga za moje korisnike - građane, porezne obveznika.</p>
</blockquote>
<p>To je u Bosni golema stvar. To je u Bosni nažalost prava rijetkost.</p>
<p><span style="text-decoration: underline;"><strong>Jubilej<br /></strong></span></p>
<p>hernade, sretan ti 100 post.</p>
<p>Bil' hajr.</p>
<p>---</p>
<p>(*) Jesam li ovo dobro rek'o ženo, jesam li ?</p>
<p>(**) omjer budale&scaron;tina / pametnih izjava, po mom sudu&nbsp; &gt; 1.&nbsp; Istina da sam sad neki socijalan tip - nisam. Zato moj sud po ovom pitanju ba&scaron; i ne može biti neki reper.</p>
<p>(***) Njih u zadnje vrijeme inače ni&scaron;ta ne interesuje osim kako bi "Utemeljitelj" mog'o "ćopit" svoj komadić vlasti</p>
<p>(****) minor - mali - neznati; major - veliki, te&scaron;ka "fula".&nbsp;</p>
<p>Kada uzmem u obzir činjenicu da sam pročitao tek par knjiga mimo   obavezne lektire, sigurno je da su oni prepuni raznoraznim gre&scaron;aka  &scaron;to  gramatičke &scaron;to semantičke prirode. Koliko sam kadra "dobaciti" po  tom  pitanju, ja činim. U srednjoj Elektrotehničkoj &scaron;koli u Zenici kod "Čede  bijeli luk" se nije morala čitati lektira ... Ah ... o Čedi, tom  nadrealnom "profesoru" spsko-hrvatskog jezika, može se čitav roman  ispisati ...</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Kada sam u junu napisao članak Bosna: glup, lud il' bahat, i objavio njegov link na facebook-u, nije mi palo na pamet da ću u narednih pola godine ispisati 100 članaka ... čitav roman čovječe. U početku, moja najveća insipracija je bilo is...]]></excerpt:encoded>	

	<wp:post_date>Fri Dec 24 12:33:00 -0800 2010</wp:post_date>
	<wp:post_date_gmt>Fri Dec 24 12:33:00 -0800 2010</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>37347058</wp:post_id>
	<wp:post_name>100-ti-blog-post</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
