<item>
	<title>Allah mubareći nova 2011. godina</title>
	<link>http://hernad.bring.out.ba/allah-mubareci-nova-2011-godina</link>
	<pubDate>Fri Dec 31 07:02:00 -0800 2010</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="dova"><![CDATA[dova]]></category>
	
		<category domain="tag" nicename="dunjaluk"><![CDATA[dunjaluk]]></category>
	
		<category domain="tag" nicename="dzuma"><![CDATA[dzuma]]></category>
	
		<category domain="tag" nicename="islam"><![CDATA[islam]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/allah-mubareci-nova-2011-godina</guid>
	<description></description>
	<content:encoded><![CDATA[<p style="text-align: right;"><em><span style="font-size: x-small;">Džuma, Malezijska džamija Nova Breka, imam ef. hadži Elvedin Klisura, 25. muharrem 1432 hdž, 31.12.2010. </span></em></p>
<p style="text-align: left;">Na hutbama uoči Nove godine redovno se govori sljedeće:</p>
<blockquote class="posterous_short_quote">
<p>Braćo ne zaboravite:&nbsp; U novogodi&scaron;njoj noći, koja se često naziva "najluđom" noći, ne zaboravite da ste muslimani!</p>
</blockquote>
<p>Peke. ... Međutim, iza toga ide priča koju manje-vi&scaron;e "ne varim". Naime, tu se obja&scaron;njava kako slavljenje Nove godine nije dio islamske tradicije, kako smo mi Bo&scaron;njaci - muslimani u ranijem sistemu bili najpodložniji asimilaciji ...</p>
<p>I sve te teze - kada se pojedinačno uzmu jesu tačne. Ali, integralno gledano, takve priče često bivaju obrađene na način koji u sebi prokomentari&scaron;em:</p>
<blockquote class="posterous_short_quote">
<p>... "plićak" te&scaron;ki ...</p>
</blockquote>
<p><!--more--><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Fetva o "Deda-mrazu"(*)</strong></span></span></p>
<p>Priču na ovu temu je ef. Elvedin započeo:</p>
<blockquote class="posterous_short_quote">
<p>Pretpostavljam da ste iz medija čuli da je Rijaset izdao fetvu po pitanju "Deda-mraza". U toj fetvi je rečeno da je "Deda mraz" nije dio islamske tradicije.</p>
</blockquote>
<p>JaRabbi ... Fetva od "Deda-mrazu" ?!&nbsp;</p>
<blockquote class="posterous_short_quote">
<p>Pod jedan - o tome nisam ni&scaron;ta čuo. Pod dva - pa zar je "Deda-mraz" tema za fetvu(**) ?! Pod tri - zar muslimanima ovo uop&scaron;te treba obja&scaron;njavati ?!</p>
</blockquote>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kalendar</strong></span></p>
<p>Čitav svijet, islamski i neislamski obilježava novu godinu po gregorijanskom kalendaru. I to radi iz jednostavnog razloga: svi <strong>primarno vrijeme računamo</strong> po tom kalendaru. Gregorijanska Nova godina je standard za računanja vremena na dunjaluku.</p>
<p>Kad smo kod kalendara, evo ba&scaron; sam danas u džamiji za kancelariju kupio ovaj kalendar:</p>
<p><div class='p_embed p_image_embed'>
<a href="http://getfile1.posterous.com/getfile/files.posterous.com/temp-2010-12-31/xsFtnsjhiDcwCcxczBlhIuFdsenkjvhdbajncoiIofsDDJCAkCfwJDuJJxdE/cal_1.jpg.scaled1000.jpg"><img alt="Cal_1" height="682" src="http://getfile5.posterous.com/getfile/files.posterous.com/temp-2010-12-31/xsFtnsjhiDcwCcxczBlhIuFdsenkjvhdbajncoiIofsDDJCAkCfwJDuJJxdE/cal_1.jpg.scaled500.jpg" width="500" /></a>
<a href="http://getfile9.posterous.com/getfile/files.posterous.com/temp-2010-12-31/jeuoJeJzxslDsuhslwxgqvsvcnmwoAmpECFxioBbmEhtJqnglFlxDucfesGt/cal_2.jpg.scaled1000.jpg"><img alt="Cal_2" height="381" src="http://getfile7.posterous.com/getfile/files.posterous.com/temp-2010-12-31/jeuoJeJzxslDsuhslwxgqvsvcnmwoAmpECFxioBbmEhtJqnglFlxDucfesGt/cal_2.jpg.scaled500.jpg" width="500" /></a>
</div>
Koje je primarno računanje vremena na ovom kalendaru ?</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kontekst</strong></span></p>
<p>Deda-mraz, dijeljenje paketića su adeti - običaji preuzeti iz hri&scaron;ćanskog svijeta. Međutim, paketići, "Deda-mraz" i crvene kapice danas su dio obilježavanja Nove godine. Koja nam je svima zajednička.</p>
<p>Nova godina je jedini praznik koji je usagla&scaron;en na nivou čitave BiH.</p>
<p>Jedini praznik ni Srbi ni Hrvati ni Bo&scaron;njaci ni ostali ne spore!</p>
<p>I sada ćemo se mi praviti "pojedinci" ?! Mi trebamo objasniti narodu da je odlazak na proslavu Nove godine ne&scaron;to &scaron;to ne dolikuje pravom muslimanu ?!</p>
<p>Pa za&scaron;to smo onda dozvolili, ako je to tako "grdna" stvar, da to bude državni praznik ?!</p>
<p>Moj <a href="/tag/h_bakir">Bakir</a> je danas imao "veseli čas". Donijeli su slatki&scaron;e u razred i počastili se. Družili se. "Deda-mraza" i paketića nije bilo.</p>
<p><strong><span style="color: #ff0000;">Na način kako na&scaron;a <a href="http://en.wikipedia.org/wiki/Ulama">ulema</a> (lo&scaron;e) obja&scaron;njava</span></strong> ove stvari, mi bi trebali svojoj djeci zabraniti da ide i na ovakve proslave. Ako jo&scaron; neko jo&scaron; pomene i "Deda-mraza" - fuj fuj fuj!</p>
<p>U čitavoj priči, zanemaruje se na&scaron; kontekst, te ne daje odgovor na logično pitanje:</p>
<blockquote class="posterous_short_quote">
<p>&Scaron;ta je onda alternativa ?!</p>
</blockquote>
<p>Ako ovakve stvari nisu za na&scaron;u djecu, koje su jo&scaron; prilike da se druži sa svojim Nikolom, koji mu je jedan od najboljih &scaron;kolskih drugara ? Da ga zovnemo za Bajram ?</p>
<p>Zato, ako je "veseli čas", bilo tu "crvenih kapica" ili ne bilo, način da se moj Bakir druži sa&nbsp; svojim drugovima, nema &scaron;anse da mu to uskratim !</p>
<p>Ja svom djetetu želim da bude i svjetski čovjek i musliman. Ako bih mu rekao: "Ti si musliman, ovo nije tvoja Nova godina", ja bih ga pripremao da bude - "papak". A papak te&scaron;ko može biti bilo svjetski čovjek, bilo dobar musliman.</p>
<p>Sa "papcima" može svako kako "hoće". "Papci" podmeću bombe ljudima u ime islama. "Papci" su nas klali u predhodnom ratu samo zato &scaron;to smo nosili muslimanska imena.</p>
<p>Zato, iz moje perspektive, odlazak u mekteb i odlazak na "veseli čas" i "paketiće" nisu sukobljene stvari.</p>
<p>Pravi problem je taj, &scaron;to će se mnogi muslimani večeras nalokati "ko majke". I &scaron;to je nemali broj takvih danas bio na džumi. Ali čekaj malo ! Pa kakve to opet veze ima sa Novom godinom ?! Pa ti isti će naći i drugu priliku da se napiju. Nova godina takvima je samo dobar povod.</p>
<p>Takva pona&scaron;anja su rezultat asimilacije?&nbsp; Da bi ovakve pojave i pona&scaron;anja elimnisali, pomoći će nam fetva od Deda-mrazu !?&nbsp;</p>
<p>Izvinite al' ja ne kontam. S druge strane, sigran sam da će većina od tih "after-džuma-&scaron;ljokenzi" po pitanju zabrane, poslu&scaron;ati Islamsku zajednicu, pa na prvi pomen "Deda-mraza" reći:</p>
<blockquote class="posterous_short_quote">
<p>Moje dijete na novogodi&scaron;nje paketiće - nema &scaron;anse !</p>
</blockquote>
<p>Za&scaron;to će oni tako reći ? Zato &scaron;to su se osvijestili ?! Zato &scaron;to je kod nas "mainstream" reći NE "onamo onima" ... A ti "onamo oni" ... hah ... Ako ih i nema, mi ćemo ih stvoriti.</p>
<p>Pa vi vidite &scaron;ta smo dobili... Novu generaciju osvje&scaron;tenih muslimana ? Ja prije vidim da na ovaj način gradimo: <strong>novu generaciju "papaka"</strong>.</p>
<p>Zato kod kvalificiranja ovakvih stvari ne smijemo stvari banalizirati, te zanemariti kompletan kontekst odnosa u na&scaron;em dru&scaron;tvu.</p>
<p><span style="color: #ff0000; font-size: medium;">Treba jasno razdvojiti situacije kada su ovakve svečanosti i pona&scaron;anja muslimana rezultat negiranja sopstvenog identiteta (prihvatanje asimilacije, podilaženje adetima drugih), od onih u kojima se de&scaron;ava druženje po pitanjima i događajima koji nas spajaju.</span></p>
<p>Ukratko, kontekst je bitan.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Srpska varijanta</span></strong></span></p>
<p>Pro&scaron;le godine sam na televiziji gledao kako Srbi u istočnom bosanskom entitetu, u nekoj &scaron;koli skontali da paketiće treba dijeliti "Sveti Nikola", u skladu sa izvornom hri&scaron;ćanskom tradicijom. Naravno, dio tog folklora je bio krst "ko kuća" na dedi Nikoli. To je dio njihove tradicije, pa &scaron;to mi to smeta ?</p>
<p>Smeta to &scaron;to se svečanost ne de&scaron;ava u crkvi, nego u javnoj ustanovi - &scaron;koli. E to su manifestacije gdje bo&scaron;njačkoj djeci - muslimanima nema mjesta.</p>
<p>Ne sjećam se da je po tom pitanju bilo ikakvih reakcija. Sada bi vjerovatno, oni &scaron;to su gornju fetvu izdali, rekli: "Pa da, to je neskriveni poku&scaron;aj asimilacije.&nbsp; Opasniji je skriveni - gdje nam se poku&scaron;ava pod "kapu" svjetskog poturiti tuđe !"</p>
<p>&Scaron;ta da kažem - mene i moju djecu nemojte tako "osvje&scaron;ćavati".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kraj hutbe</strong></span></p>
<p>Dobro se sjećam da je i pro&scaron;le godine kao i ove, ef. Elvedin hutbu zavr&scaron;io istim riječima:</p>
<blockquote class="posterous_short_quote">
<p>... Pa eto, ako je to nekome bitno, sretna mu Nova 2011.</p>
</blockquote>
<p>Ostao sam do kraja džume. Kad smo se na kraju selamili(***), ja sam Elvedinu rekao:</p>
<blockquote class="posterous_short_quote">
<p>Selam ajekum brate, Allah mubareći(****) i tebi Nova 2011 godina!</p>
</blockquote>
<p>Elvedin me je pogledao, malo sam ga zatekao. Pa kad je skontao, uzvratio mi pozdrav i nasmijao se. Elvedin nije papak. On je jedan pametan i razuman čovjek. Ali da mu je vakat da promijeni priču na ovu temu - to definitivno.</p>
<p>Moramo izaći iz ovih stereotipa. Ne ide to tako brate. Ako nastavimo <strong>potencirati&nbsp; razlike</strong>, i to na trivijalnim stvarima kao &scaron;to su ove, kako možemo očekivati bolji vakat ?!</p>
<p>Ovo je put u getoizaciju, a ne put ka osvije&scaron;tenim muslimanima. Getoizacija - pa to je ono &scaron;to na&scaron;i du&scaron;mani i priželjkuju !</p>
<p><strong><span style="text-decoration: underline;"><span style="font-size: medium;">Sretna nova godina</span></span></strong></p>
<p>Ja lično nisam "fun" rođendana, niti veselja kao &scaron;to je Nova godina. Ne &scaron;aljem raji čestitke za Novu godinu. Međutim, kada mi neko po&scaron;alje čestitku, to tumačim kao znak pažnje.</p>
<p>Na email sam dobio puno poruka, uglavnom od poslovnih partnera: "Sretna Nova godina". To je k'o eto op&scaron;te prihvatljivo, pa to svi "&scaron;ibaju": i "pravi" i "krivi" muslimani, i nemuslimani ...&nbsp;</p>
<p>Dobio sam čestitku od mog prijatelja <a href="/miletova-japanska-chenifa-i-cestit-posao">Mileta</a>. Htio sam da mu uzvratim, pa sam odustao. Izbjegavam "konfekcijski" odgovarati .... Volim ljudima, kad im se obratim, pokazati da sam ih se sjetio, a ne da je to javljanje "pro-forme".</p>
<p>Sada će moj Mile znati da sam ga se sjetio, pa ću mu proslijediti ovaj blog:</p>
<blockquote class="posterous_short_quote">
<p>Mile, sretna i berićetna bila Nova godina tebi i tvoj porodici !</p>
</blockquote>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Dova</span></strong></span></p>
<blockquote>
<p>Gospodaru moj, podaj u narednoj godini mojoj porodici zdravlje.</p>
<p>Gospodaru moj, podaj da poslove koje sam započeo na najbolji način i dovr&scaron;im, posebno <a href="http://www.bring.out.ba/knowhow">knowhow projekat</a> i <a href="/tag/fit_2_godina">obaveze na fakultetu</a>.</p>
<p>Gospodaru moj hvala na svom bereketu &scaron;to spu&scaron;ta&scaron; na mene i moju porodicu, bez računa i u izobilju.</p>
<p>Gospodaru moj, podaj nama Bosancima vi&scaron;e iskrenosti, znanja i razumijevanja. To je, ubijeđen sam, na&scaron;e najbolje oružje protiv du&scaron;mana ove zemlje!</p>
</blockquote>
<p>Amin</p>
<p>---</p>
<p>(*) Jel' ovo ide malim ili velikim slovima ?</p>
<p>(**) Fetve su je izno&scaron;enje stavova po <strong>bitnim dunjalučkim</strong> (ovosvjetskim)<strong> pitanjima</strong> za muslimane, od strane islamskih učenjaka u skladu sa Objavom - Qur'anom i Sunnetom - praksom Božijeg poslanika s.a.v.s.</p>
<p>(***) Nakon namaza (klanjanje) i zikra (zajednička dova), džematlije (učesnici namaza) se poselame (pozdrave)</p>
<p>(****) Allah mubarek olsun =&gt; "Allah mubareći" je kod nas u narodu "pretesano"&nbsp; (kao "Bajram &scaron;erif mubarek olsun" =&gt; bajrambarećullah)</p>
<p>(*****) Islamijet - pripadnost islamu, vjera u Allaha dž.&scaron;.</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Džuma, Malezijska džamija Nova Breka, imam ef. hadži Elvedin Klisura, 25. muharrem 1432 hdž, 31.12.2010. Na hutbama uoči Nove godine redovno se govori sljedeće: Braćo ne zaboravite: U novogodišnjoj noći, koja se često naziva "najluđom" ...]]></excerpt:encoded>	

	<wp:post_date>Fri Dec 31 07:02:00 -0800 2010</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>allah-mubareci-nova-2011-godina</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
		<wp:comment>
			<!-- <wp:comment_id>5</wp:comment_id> -->
			<wp:comment_author><![CDATA[]]></wp:comment_author>
			<wp:comment_author_email></wp:comment_author_email>
			<wp:comment_author_url></wp:comment_author_url>
			<wp:comment_date>Tue Jan 04 00:37:47 -0800 2011</wp:comment_date>
			<wp:comment_date_gmt>Tue Jan 04 00:37:47 -0800 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Kako inače običavam, link na ovaj članak sam proslijedio i ef. Elvedinu.

On mi je zauzvrat proslijedio ovaj link na Fetvu rijaseta - &quot;Odgovor na pitanje o islamskom stavu prema liku Djeda Mraza&quot;

http://www.rijaset.ba/index.php?option=com_content&amp;view=article&amp;id=10031:odgovor-na-pitanje-o-islamskom-stavu-prema-liku-djeda-mraza&amp;catid=254:mina-vijesti-kat&amp;Itemid=185

Uvaženi Fetva-emin je dao komentar baš u skladu sa onim što sam ovdje napisao.

Da sam prije njega pročitao ovu fetvu, ovaj članak bi vjerovatno bio još žešći:

1) mislim da narod koji je postavio ova pitanja ovo traži puno precizniji, jasniji, i za primjenu PRAKTIČNIJE odgovore

2) mislim da se na ovaj način praktično &quot;udara&quot; na elementarnu pamet i sposobnost rasuđivanja ummeta - pa mi to znamo !

3) ako sam ja po pitanju 2) u krivu - ako mi ove stvari ne znamo, onda je ovakav odgovor Fetva-emina vrlo vrlo loš. On se &quot;šica&quot; suviše generalnim stvarima. Ummet, ako je ograničen, ovo uošte neće skontati.

Sve više sam ubijeđen da mi generalno mješamo &quot;babe i žabe&quot;, te da naša ulema po mnogim pitanjima nema dobar pristup. Umjesto da rješavaju i &quot;raspetljavaju&quot; stvari, oni ih na ovaj način komplikuju.]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
		<wp:comment>
			<!-- <wp:comment_id>5</wp:comment_id> -->
			<wp:comment_author><![CDATA[]]></wp:comment_author>
			<wp:comment_author_email></wp:comment_author_email>
			<wp:comment_author_url></wp:comment_author_url>
			<wp:comment_date>Tue Jan 04 00:39:05 -0800 2011</wp:comment_date>
			<wp:comment_date_gmt>Tue Jan 04 00:39:05 -0800 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[S obzirom da rijasetov članak omogućava komentare komentare(*), kao komentar sam stavio sam link na ovaj članak.

Naravno, stavio sam svoj puni potpis, kako to inače običavam.

---
(*) jedno 5 puta sam neuspješno pokušavao dok iz svog imena i naslova nisam izbacio naše diakritike :(.

IT podrška rijaseta - podržite &quot;šćčžđ&quot; ... to su naša slova. Ili možda nisu ?!]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
</item>
