<item>
	<title>Prekid posla sa pismenim ljudima</title>
	<link>http://hernad.bring.out.ba/prekid-posla-sa-pismenim-ljudima</link>
	<pubDate>Thu Jan 06 00:50:00 -0800 2011</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="bring.out"><![CDATA[bring.out]]></category>
	
		<category domain="tag" nicename="business"><![CDATA[business]]></category>
	
		<category domain="tag" nicename="b_knowhow"><![CDATA[b_knowhow]]></category>
	
		<category domain="tag" nicename="poslovna_korespondencija"><![CDATA[poslovna_korespondencija]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/prekid-posla-sa-pismenim-ljudima</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Često pominjem vje&scaron;tinu pisane komunikacije kao ne&scaron;to &scaron;to je u bosanskom biznisu rijetka zvijerka. Međutim, dobra je vijest da nismo svi nepismeni :)</p>
<p>Zato ću objaviti pismo jednog svog klijenta(*). Objavljujem to iz vi&scaron;e razloga:</p>
<ol>
<li>gratis svojim čitaocima dajem lekciju iz poslovne korespondencije, s obzirom da se to u na&scaron;im &scaron;kolama izgleda ne uči</li>
<li>povod za pismo je prekid poslovne saradnje</li>
<li>provajder prelazi na "moćni" Microsoft Navision sistem</li>
</ol>
<p><!--more--></p>
<blockquote>
<p>Po&scaron;tovani Ernade,<br /> Ovim putem želim se svima Vama zahvaliti u ime&nbsp; &lt;&lt;na&scaron;e firme&gt;&gt; na  dosada&scaron;njoj saradnji i podr&scaron;ci, i najaviti da vi&scaron;e nemamo potrebu za  zaključivanjem novog Ugovora za ovu godinu, jer smo od&nbsp; &lt;&lt; tada i tada &gt;&gt; godine  pre&scaron;li na novi sistem MS Navision, nažalost. <br /> Kažem nažalost, ne tek tako, nego iz razloga &scaron;to smo svi kao korisnici  totalno razočarani i frustrirani (ne)mogućnostima "moćnog" Navision-a.  Kada su nam na&scaron;e kolege &lt;&lt;privatno&gt;&gt; predstavljali Navision mislili smo da  je to rje&scaron;enje za na&scaron; biznis i da će nam olak&scaron;ati posao, ali ispostavilo  se suprotno. A podr&scaron;ka, tih istih kolega i vanjskog dobavljača,  nikakava.<br /> Sve u svemu, žalimo za onim ranijim načinom rada, i nadamo se da će dogodine biti lak&scaron;e.<p />  Sa druge strane zainteresovani za mogućnost saradnje sa bring.out-om u predstojećem procesu fiskalizacije.<br /> Interesuje me da li će bring.out biti ovla&scaron;teni servis samo za Tring fiskalne uređaje ili možda jo&scaron; neke druge uređaje?<p />  Jo&scaron; jednom hvala na dosada&scaron;njoj podr&scaron;ci sa nadom za budućom saradnjom na polju fiskalizacije.</p>
</blockquote>
<p>Evo i mog odgovora:</p>
<blockquote>
<p>Po&scaron;tovani &lt;&lt; ... &gt;&gt;,<br />hvala Vam &scaron;to ste nas informisali o promjenama koje  ste napravili i na lijepim riječima koje ste uputili po pitanju na&scaron;e  dosada&scaron;nje saradnje.<p />Va&scaron;e iskustvo nije usamljen slučaj pona&scaron;anja tih "moćnih" ERP provajdera na na&scaron;em trži&scaron;tu. Bahatost i lo&scaron;a podr&scaron;ka su  ono &scaron;to se najče&scaron;će čuje od korisnika tih rje&scaron;enja. Valjda im brend  njihovog proizvoda to daje za pravo ?! Ja to ipak komentari&scaron;em: bljah.<p />Siguran  sam da ćete se vi, kao ekipa koja zna raditi svoj posao, na kraju  izboriti i sa tim problemima. Želimo vam od srca sve najbolje.<p /><span style="font-weight: bold; text-decoration: underline;">Fiskalizacija</span><p />Na na&scaron;im stranicama postoje informacije o na&scaron;im aktivnostima po pitanju fiskalizacije http://www.bring.out.ba/tag/fiskalizacija<p />Posljednja  informacija na tu temu je ta da smo suspendovali svoje informacije kao  serviser i distributer Tring fiskalnih sistema <p /><a href="http://www.bring.out.ba/bringout-suspenduje-svoje-operacije-u-ulozi-s">http://www.bring.out.ba/bringout-suspenduje-svoje-operacije-u-ulozi-s</a><p />Na svom blogu sam detaljno napisao za&scaron;to smo tu odluku donijeli <a href="http://hernad.bring.out.ba/teska-poslovna-odluka">http://hernad.bring.out.ba/teska-poslovna-odluka</a><p />Rezime  bi bio: mi želimo svojim korisnicima pružiti kvalitetnu podr&scaron;ku u  postprodajnom periodu. To bez adekvatne podr&scaron;ke dobavljača ne možemo  učiniti.<br />&nbsp; <br />Drugi bitan razlog toj odluci je knowhow projekat <a href="http://www.bring.out.ba/knowhow">http://www.bring.out.ba/knowhow</a><p />On  će, aBd, biti projekat koji će objediniti i sveobuhvatnost velikih ERP  rje&scaron;enja kakav je Navision, i kvalitetnu podr&scaron;ku na BH trži&scaron;tu.<p />Da se vratim na fiskalizaciju ...<p />Ono  &scaron;to smo već učinili za korisnike iz prvog kruga fiskalizacije jeste  priprema na&scaron;ih programskih rje&scaron;enja za fiskalne sisteme drugih  provajdera.<p />Nažalost, sve pokazuje da je čitav koncept  fiskalizacije i sa stanovi&scaron;ta države i sa stanovi&scaron;ta proizvođača jedna  velika farsa:  <a href="http://hernad.bring.out.ba/porezna-uprava-vam-pomaze-da-budete-nepismeni">http://hernad.bring.out.ba/porezna-uprava-vam-pomaze-da-budete-nepismeni</a><br />&nbsp;<br />Mi  svakako planiramo napraviti jedan sveobuhvatan pregled ponude fiskalnih  sistema do kraja februara.&nbsp; Ako pri tome nađemo provajdera fiskalnih  sistema koji je&nbsp; kompatibilan sa na&scaron;im načinom djelovanja, ne  isključujemo mogućnost da se ponovo uključimo u servisiranje i  distribuciju fiskalnih sistema. <p />Ako to ne bude slučaj,  ograničićemo se na podr&scaron;ku na&scaron;ih softverskih rje&scaron;enja. Mi smo mala ekipa  i ne želimo praviti korake koji bi ugrozili na&scaron; strate&scaron;ki&nbsp; "knowhow"  projekat. Fiskalizacija može donijeti dobre kratkoročne prihode, ali  dugoročne velike glavobolje, ako želite biti ozbiljan i pouzdan IT  provajder.<p />S obzirom na dosada&scaron;nju saradnju, bio bih nasretniji  da smo vam mogli dati kratak i potvrdan odgovor na pitanje o  fiskalizaciji. <p />Međutim, takav odgovor vam sada ne možemo dati.&nbsp;  Jedan od baznih principa djelovanja na&scaron;e firme: mi svojim korisnicima ne  prodajemo ublehe :) &nbsp; <p />Pozdrav,<br />Ernad</p>
</blockquote>
<p>---</p>
<p>(*) uz po&scaron;tivanje privatnosti, naravno</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Često pominjem vještinu pisane komunikacije kao nešto što je u bosanskom biznisu rijetka zvijerka. Međutim, dobra je vijest da nismo svi nepismeni :) Zato ću objaviti pismo jednog svog klijenta(*). Objavljujem to iz više razloga: gratis svojim čit...]]></excerpt:encoded>	

	<wp:post_date>Thu Jan 06 00:50:00 -0800 2011</wp:post_date>
	<wp:post_date_gmt>Thu Jan 06 00:50:00 -0800 2011</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>38732836</wp:post_id>
	<wp:post_name>prekid-posla-sa-pismenim-ljudima</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
		<wp:comment>
			<wp:comment_id>7325788</wp:comment_id>
			
				<wp:comment_author><![CDATA[Ernad Husremović]]></wp:comment_author>
			
			<wp:comment_date>Wed Feb 23 08:10:29 -0800 2011</wp:comment_date>
			<wp:comment_date_gmt>Wed Feb 23 08:10:29 -0800 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Ovo me je potaklo da na knowhow forumuma postavim pitanje:

http://redmine.bring.out.ba/boards/8/topics/4562

Ima li u Bosni i Hercegovini dobar ERP provajder ?]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
		<wp:comment>
			<wp:comment_id>7325798</wp:comment_id>
			
				<wp:comment_author><![CDATA[Ernad Husremović]]></wp:comment_author>
			
			<wp:comment_date>Wed Feb 23 08:10:42 -0800 2011</wp:comment_date>
			<wp:comment_date_gmt>Wed Feb 23 08:10:42 -0800 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Ovo me je potaklo da na knowhow forumuma postavim pitanje:

http://redmine.bring.out.ba/boards/8/topics/4562

Ima li u Bosni i Hercegovini dobar ERP provajder ?]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
</item>
