<item>
	<title>Zluradost i kritika</title>
	<link>http://hernad.bring.out.ba/zluradost-i-kritika</link>
	<pubDate>Thu Oct 20 00:33:00 -0700 2011</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="dunjaluk"><![CDATA[dunjaluk]]></category>
	
		<category domain="tag" nicename="islam"><![CDATA[islam]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/zluradost-i-kritika</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Neki dan sam u jednom članku pomenuo primjer koji je za mene bio zlurad(*)</p>
<p>Kada primjetim zluradost u postupcima drugih, to me stvarno pogodi.</p>
<p>Juče sam sa svojim ratnim drugom Miletom pričao o starim danima iz pres centra 3. korpusa ARBiH. Počnemo se prisjećati raznih događaja. Pro&scaron;lo je puno vremena ...</p>
<p>U tom razgovoru dođemo do te&scaron;kih primjera zluradosti. Miletu je bilo interesantno kako to čine ljudi koji sebe deklari&scaron;u ka ovjernici:</p>
<blockquote class="posterous_short_quote">
<p>Pa gdje će vam du&scaron;a ?!</p>
</blockquote>
<p>bio je u isti glas i moj i Miletov komentar.&nbsp;</p>
<p><!--more--></p>
<p>Primjeri su bili na temu: Osoba XY se ogrije&scaron;ila o drugima. U njegovoj užoj porodici desila se te&scaron;ka bolest, smrt.</p>
<p>Oni koji su bili predmet lo&scaron;ih djela osobe XY, čuv&scaron;i za tu vijest, dali su komentar:</p>
<blockquote class="posterous_short_quote">
<p>Eto vidi&scaron;, ima Allaha !</p>
</blockquote>
<p>Jaa Rabbi, Jaa Rabbi, Ja Rabbi !</p>
<p>Pominjanje Allaha dž.&scaron;. u ovakvim situacija za mene kao muslimana nije samo lo&scaron;e djelo. To je mnogo vi&scaron;e od toga.</p>
<p>Pravom muslimanu pomenuti događaji trebaju biti znak, poruka, upozorenje !&nbsp;</p>
<p>Ali znak da dodatno pazi na to da se ON klone tuđeg haak-a i drugima ne čini &scaron;tetu bez razloga i opravdanja. Ovakvo povezivanje je najblaže rečeno zluradost.</p>
<p>Natjecanje u poslu, razlika u stavovima, borba za zaradu, su stvari u koje će se de&scaron;avati do Sudnjeg dana.</p>
<p>Međutim, u svim tim konfliktnim situacijama čovjek mora paziti gdje je granica njegovog prava haak-a, a gdje napad na tuđi haak.</p>
<p>Onaj ko na to pazi, ko sebe po ovim pitanjima uvijek preispituje je po mom sudu pravi musliman. &Scaron;to bi na&scaron; narod rekao <a href="http://hernad.bring.out.ba/veliki-musliman-veci-od-reisa">veliki musliman</a>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kritika</strong></span></p>
<p>U razgovoru sa ljudima, promatranju pojava ne prezam od kritike. Moji istupi su često grubi i provokativni. Cilj takvih nastupa je ekspresija, nastojanje da se negativnim stvarima da potrebna dimenizija. Da se ne stavljaju pod tepih.</p>
<div>Dru&scaron;tvo koje svoje kritičke stavove iznosi samo na privatnim sjelima, a u javnosti &scaron;uti je po meni kvarno dru&scaron;tvo. Zato pi&scaron;em kako pi&scaron;em.</div>
<div>Ako u određenim situacijama i pretjeram, u &scaron;ta ne sumnjam, vodi me želja da ljudima oko sebe ukažem na bitnost kritičkog osvrta i iskrene komunikacije općenito.</div>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Dova</strong></span></p>
<blockquote class="posterous_medium_quote">
<p>Molim dragog Allah-a da mi providi u situacijama u kojima pogre&scaron;no postupam i napadnem na tuđe pravo, tuđi haak.</p>
<p>Molim dragog Allaha da do saznanja o svojim ružnim postupcima dođem prije nego bude kasno da te svoje gre&scaron;ke ispravim.</p>
<p>Gospodaru moj, oprosti mi za gre&scaron;ke, svjesno ili nesvjesno učinjene.</p>
<p>Ti si milostvi. Ti si onaj koji voli pra&scaron;tati i najvi&scaron;e pra&scaron;ta !</p>
</blockquote>
<p>Amin.</p>
<p>---</p>
<p>(*) vidi "Domaći proizvod", <a href="http://hernad.bring.out.ba/knowhow-erp-poziv-ekonomistima">http://hernad.bring.out.ba/knowhow-erp-poziv-ekonomistima</a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Neki dan sam u jednom članku pomenuo primjer koji je za mene bio zlurad(*) Kada primjetim zluradost u postupcima drugih, to me stvarno pogodi. Juče sam sa svojim ratnim drugom Miletom pričao o starim danima iz pres centra 3. korpusa ARBiH. Poč...]]></excerpt:encoded>	

	<wp:post_date>Thu Oct 20 00:33:00 -0700 2011</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>zluradost-i-kritika</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
