<item>
	<title>Jel' to Šahbaz ... pardon Šahman !?</title>
	<link>http://hernad.bring.out.ba/jel-to-sahbaz-pardon-sahman</link>
	<pubDate>Mon Oct 24 06:50:00 -0700 2011</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bosna"><![CDATA[bosna]]></category>
	
		<category domain="tag" nicename="mu%C5%BE"><![CDATA[muž]]></category>
	
		<category domain="tag" nicename="obrazovanje"><![CDATA[obrazovanje]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/jel-to-sahbaz-pardon-sahman</guid>
	<description></description>
	<content:encoded><![CDATA[<p style="margin-bottom: 0in;">Prije ne&scaron;to vi&scaron;e od tri godine, u Samrinom 7. razredu osnovne &scaron;kole, imali smo pravu dramu.</p>
<p style="margin-bottom: 0in;">Upravo je mi je to grozno iskustvo i bilo "inspiracija" u članku <a href="http://hernad.bring.out.ba/hello-programiranje-al-cestito">"Hello programiranje, al' čestito, hernad 'The agresivni'"</a>, za poglavlje "hernad The agresivni".</p>
<p style="margin-bottom: 0in;">Doista mi nije puno trebalo da se sa Samrinim nastavnikom fizike "hvatam za vratove".</p>
<p style="margin-bottom: 0in;"><!--more-->Da ne bude zabune, Samrin profesor CT-a je, koliko sam razumio iz Samrinih priča o njemu, su&scaron;ta suprotnost nastavniku &Scaron;ahmanu.&nbsp;</p>
<p style="margin-bottom: 0in;">Kao danas se sjećam tog sastanka sa Samrinim profesorom fizike. Na sastanku smo prisustvovali pedagoginja, Samrina nastavnica, nastavnik fizike, moja supruga Dženana i ja.</p>
<p style="margin-bottom: 0in;">Sastanak je zavr&scaron;io ... katastrofalno. &Scaron;ahman se pokazao kao prava "faca", kojoj tamo neki nadobudni roditelji ne mogu "soliti pamet". Pedagogica i Samrina razrednica ... one su bile pravi statisti u kukuruzu. &Scaron;ahman je očigledno bio za njih nekakav "guru" čija su stručnost i nastavničke sposobnosti neupitne ... A mi ... mi smo potonuli.</p>
<p style="margin-bottom: 0in;">Shvatili smo, da ako Samru prepustimo "&Scaron;ahmanima" i ostatku nastavnog osoblja O&Scaron; "Alija Nametak", na&scaron;e djete će ostati totalni blećak.</p>
<p style="margin-bottom: 0in;">Poražavajuće.</p>
<p style="margin-bottom: 0in;">Dženana je po izlasku sa sastanka počela plakati:&nbsp;</p>
<blockquote>
<p style="margin-bottom: 0in;">Sada sam razumjela ! Ja sam se skroz pogre&scaron;no izdirala na svoje dijete ... A ona ni kriva ni dužna. &Scaron;ta je &nbsp;u ovakvom okruženju i mogla ? Mi govorimo jedno (mora&scaron; razumjeti !) a ovi ne&scaron;to sasvim drugo (mora&scaron; reproducirati !). &nbsp;Joj majko moja, &scaron;ta mi od djeteta rade ... Joj &scaron;ta će biti sa mojim djetetom ...</p>
</blockquote>
<p style="margin-bottom: 0in;">Onda se malo smirila pa se sa svojim karakterističnim naredbodavnim tonom okrenula prema meni:</p>
<blockquote>
<p style="margin-bottom: 0in;">Ernade, nemamo mi &scaron;ta tamo (u &scaron;koli tražiti). Moramo svoje dijete uzeti u svoje ruke.</p>
<p style="margin-bottom: 0in;">Mora&scaron; sa njom raditi fiziku i matematiku.</p>
</blockquote>
<p style="margin-bottom: 0in;">Tako je i bilo. Samra je imala paralelno obrazovanje. Jedno za ocjene u &scaron;koli, drugo za znanje.</p>
<p style="margin-bottom: 0in;">Ta strategija je, elhamdulilah, urodila plodom.</p>
<p style="margin-bottom: 0in;">Samra je nakon dvije godine "drila", "procvala". Sada je jedan od najboljih učenika u razredu iz prirodoslovnih predmeta.&nbsp;</p>
<p />
<div>Iako se ovo može protumačiti kao opanjkavanje nakon &scaron;to je sve odavno gotovo, odlučio sam ovo staviti na papir. "&Scaron;ahmana" je puna Bosna:</div>
<p />
<blockquote>
<div>Roditelji, shvatite da se ne možete prepustiti ovom obrazovnom sistemu ako želite svojoj djeci obezbjediti znanje.</div>
</blockquote>
<p />
<div>Povod za ovaj članak je pismo koje smo Dženanina i ja htjeli pročitati na roditeljskom sastanku:</div>
<blockquote>
<p style="margin-bottom: 0in;"><span>Pismo koje sam napisala u tuzi i jadu nakon poku&scaron;aja da se uključim u proces podučavanja mog djeteta </span></p>
<p style="margin-bottom: 0in;">Po&scaron;tovani,</p>
<p style="margin-bottom: 0in;">Ovim pismom želimo da damo rezime na&scaron;ih nastojanja u posljednjih mjesec dana sa ciljem da nastava iz prirodoslovne grupe predmeta poprimi onu formu koja omogućava djeci logički i kritički pristup proučavanju i razumijevanju materije. Na&scaron;a nastojanja kulminirala su sastankom koji je na na&scaron; zahtjev održan sa nastavnikom Edinom &Scaron;ahmanom. Sastanku je prisustvovala pedagoginja Mediha kao glavna za sam proces podučavanja, kao i razrednica na&scaron;e kćerke koja je u biti najodgovornija za dobrobit na&scaron;eg djeteta za vrijeme njenog boravka u &scaron;koli.</p>
<p style="margin-bottom: 0in;"><span>Ukratko, inicijativa je do&scaron;la kao rezultat spoznaje da na&scaron;e dijete prirodosolovnu grupu predmeta zajedno sa informatikom izučava koristeći isključivo tehnike zapamćivanja i reprodukcije, bez ili sa vrlo malo razumijevanja. Tako smo na početku sedmog razreda uvidjeli da ona ima problem sa osnovnim konceptima (npr. skratiti 10</span><sup><span>23</span></sup><span> sa 10</span><sup><span>24</span></sup><span>). Osim toga svaki povratak iz &scaron;kole donosio je nove probleme jer su oni prolazili kroz nove lekcije bez razumijevanja 1) osnovnih stvari koje su ranije &bdquo;podučavane&ldquo;  i 2) novih pojmova. Stoga smo naivno smatrali da ukazivanjem na problem i nuđenjem suradnje nastavnicima možemo uticati na kvalitet znanja svoje kćerke. </span></p>
<p style="margin-bottom: 0in;"><span>Na prvom roditeljskom sastanku ove godine mi smo sve iznijeli razrednici i pedagoginji. </span></p>
<p style="margin-bottom: 0in;"><span>Kako nismo primijetili pomak u načinu učenja niti pomake u načinu podučavanja na sljedećim informacijama (ponedjeljak) zamolili smo razrednicu da nam zakaže sastanak sa nastavnikom fizike &Scaron;ahmanom. Do četvrtka sastanak nije bio zakazan, a u četvrtak nastavnik nastavnik &Scaron;ahman je oduzeo Samri kontrolni rad sa uvjerenjem da je ona prepisivala. Na Samrin komentar: &bdquo;Ja nisam prepisivala, a vi ako hoćete vjerujte, a ako nećete ne morate.&ldquo; nastavnik joj je uzvratio: &bdquo;Ja tebi ne vjerujem. Kada ti bude&scaron; nastavnik ti će&scaron; odlučivati kome će&scaron; oduzeti kontrolni, a kome neće&scaron;, a dotada sam ja nastavnik.&ldquo; Nakon toga Samra je bila prisiljena presjediti u klupi cijeli čas dok su druga djeca radila kontrolni rad, a nastavnik nije htio da joj ponudi (ne da je izbaci kako on to kaže, nego da joj ponudi mogućnost) da izađe i poku&scaron;a da se smiri s obzirom da je to za svako dijete situacija akutnog stresa. Za mene je ovaj događaj bio poziv na traženje hitnog sastanka koji se i desio u ponedjeljak.</span></p>
<p style="margin-bottom: 0in;">Epilog sastanka: na žalost na ovom sastanku nama je konačno postalo jasno da mi nemamo sugovornika niti imamo previ&scaron;e mogućnosti da kroz formalni obrazovni sistem utječemo na kvalitet znanja svog djeteta.</p>
<p style="margin-bottom: 0in;"><span>Nastavnik je do&scaron;ao sa testom čvrsto ubijeđen da je na&scaron; glavni cilj  intervenirati za Samrinu ocjenu. On je čak vrlo arogantno poku&scaron;avao da nama kaže: &bdquo;Znam ja da ste vi do&scaron;li zbog ovog&ldquo; očigledno na shvatajući razloge za&scaron;to smo mi tu. Čak je poku&scaron;avao da nam pokaže kako je to &bdquo;različita grafitna olovka&ldquo;. Nije se obazirao na moj komentar da za mene ta jedinica koju je on dao, opravdavajući je principijelnim pona&scaron;anjem tipa &bdquo;kod mene je tako&ldquo; , zaista ne znači ni&scaron;ta jer 1) pričamo o formulama koje je ona napisala kada je ugledala zadatke da ih ne bi zaboravila i kako bi ih mogla prepisati na odgovarajuće mjesto i 2) jo&scaron; gore, pričamo o formulama koje se trebaju naučiti napamet &scaron;to se u modernoj teoriji podučavanja tretira kao totalno beskorisno znanje. </span></p>
<p style="margin-bottom: 0in;"><span>Na na&scaron;e poku&scaron;aje da objasnimo &scaron;to smo uočili nastavnik nas je (opet s visine) pitao jesmo li mi možda proveli neku anketu među učencima pa tvrdimo da on ne podučava adekvatno. Kada smo mi rekli da su nas roditelji VII 2 ovlastili da govorimo i u njihovo ime, on nam je rekao da mi možemo govoriti samo u ime svog djeteta i da ne uop&scaron;tavamo. Kada  bismo mi rekli da se ne insistira na osnovnoj metodologiji on bi rekao kako on to njima stalno govori i da je eto na&scaron;e dijete  izuzetak koji ne konta. Ja samo ne znam kako je on to uspio procijeniti. Ako je već ustanovio da je ona izuzetak za&scaron;to je nikada nije upozorio? </span></p>
<p style="margin-bottom: 0in;"><span>Uglavnom, mi smo dobili poruku da on ima nastavni plan i program koji mora stići, da ima kontrolne i ostale aktivnosti i da nema vremena za individualni pristup. Na moj poziv da onda pomogne nama da mi pomognemo svom djetetu on je rekao da mi trebamo imati vi&scaron;e strpljenja i da će sve doći  na svoje! Na moje pitanje: &bdquo;Da li to znači da ako ona dođe do vas sa obja&scaron;njenjem da ne razumije vi je nećete kažnjavati jedinicama?&ldquo; rečeno mi je da to nije kažnjavanje i da oni trebaju raditi zadaće npr. od 7 pitanja uraditi 4. Na moj upit ako ona ne zna ni&scaron;ta rije&scaron;iti i traži pomoć &scaron;ta će se desiti dobila sam odgovor koji je ukazivao da  ona može dobiti samo minus, a nikako pomoć.</span></p>
<p style="margin-bottom: 0in;"><span>Uz to sam dobila i savjet da budem strpljiva sa svojim djetetom (kao ja bih da se ne&scaron;to desi preko noći). </span></p>
<p style="margin-bottom: 0in;"><span>Moram izdvojiti jo&scaron; jednu rečenicu koja mi je otvorila oči. Nastavnik  mi je lijepo poručio: &bdquo;Ako ona ne razumije ja vam ne mogu pomoći&ldquo;. </span></p>
<p style="margin-bottom: 0in;"><span>Ja sada iskreno žalim &scaron;to sam i u jednom trenutku posumnjala u pažnju i želju moje kćerke da nauči i bude aktivna na času. Vjerovala sam kako mi, Samrini roditelji, i oni, Samrini nastavnici, imamo isti cilj u obrazovanju na&scaron;eg djeteta. Sada mi je sasvim jasno da su na&scaron;i ciljevi različiti. U skladu sa ovom spoznajom moj muži i ja smo donijeli odluku da svom djetetu pomognemo &scaron;to je moguće vi&scaron;e da savlada ono &scaron;to se od nje traži u formalnom sistemu, a onda da je mi u procesu neformalnog obrazovanja podučavamo onom &scaron;to nauka zaista jeste sa svim njenim ljepotama, propitivanjima i sumnjama. </span></p>
<p style="margin-bottom: 0in;"><span>Ovo pismo će biti pročitano na roditeljskom sastanku VII 2 razreda kako bi roditelji koji su zainteresirani za ovu problematiku bili upoznati sa de&scaron;avanjima i mogli sami odlučiti kako će ubuduće tretirati pitanje obrazovanje svoje djece. </span></p>
<p style="margin-bottom: 0in;"><span>Jedino &scaron;to smo mi tražili i &scaron;to i dalje tražimo najlak&scaron;e je opisati sljedećim primjerom: na&scaron;a kćerka je prije nekoliko dana do&scaron;la sva odu&scaron;evljena sa časa matematike i rekla nam: &bdquo;Znate kako je danas bilo super. Nastavnica Adaleta je čitav čas sa nama radila samo jedan zadatak i svi smo shvatili. Ona kada je ja pitam da mi objasni ne&scaron;to stvarno to hoće da uradi. Ona se pravo unese.&ldquo; Dakle, nastavnica Adaleta je očigledno prepoznala važnost nastave usmjerene na učenika. </span></p>
<p style="margin-bottom: 0in;">Nastavnik &Scaron;ahman nas je pitao:&ldquo; Znate li vi &scaron;ta su ciljevi nastave?!&ldquo; Koristimo priliku da odgovorimo na ovo pitanje: ako je cilj nastave da se pređe kroz nastavni plan i program po cijenu da djeca ostanu uskraćena za temeljne spoznaje iz određenog predmeta, onda je cilj nastave apsolutno gubljenje vremena. Ovaj isti nastavnik je djeci objasnio pojam pomaka kao &bdquo;Uzmite jednog učenika koji lo&scaron;e uči, i on provede čitavu godinu da bi na kraju ponovio razred. Vrijeme je utro&scaron;eno ali pomaka nema.&ldquo; Analogno ovom primjeru, mi ćemo konstatovati: pređite nastavni plan i program ne osvrčući se na stepen spoznaje fundamentalnih pojmova i metodologije učenja, godina je pro&scaron;la, ali pomaka nema.</p>
<p style="margin-bottom: 0in;">Djeci će u amanet umjesto osjećaja kompetencije kao spoja znanja, vje&scaron;tina i pozitivnog stava prema predmetu ostati samo nesigurnost u sposobnosti da ne&scaron;to spoznaju i ubjeđenje da je to područje koje mogu razumjeti samo &bdquo;odabrani&ldquo;.</p>
<p style="margin-bottom: 0in;">Zahvaljujemo vam se na odvojenom vremenu za čitanje ovog pisma.</p>
<p style="margin-bottom: 0in;">S po&scaron;tovanjem,</p>
<p style="margin-bottom: 0in;"><span>Dženana i Ernad Husremović </span></p>
<p style="margin-bottom: 0in;">P.S. Želim da vas izvijestim da je evaluacija rada jedna od mojih užih specijalnosti i zaista mi ne bi bio problem provesti profesionalnu procjenu rada nastavnika ukoliko je to potrebno kao nekakav argument u ovoj cijeloj priči.</p>
</blockquote>
<p style="margin-bottom: 0in;">Za&scaron;to nikada nismo poslali ovo pismo ?</p>
<p style="margin-bottom: 0in;">Zato &scaron;to smo procjenili da svaka diskusija sa nastavnim osobljem ne može uroditi željenim plodom. Ono bi samo otežalo ionako te&scaron;ku situaciju kojoj smo izložili na&scaron;e dijete.</p>
<p style="margin-bottom: 0in;">Na&scaron;a Samra je, elhamdulliah, jaka k'o beton. Da ona nije takva, ne smijem ni misliti kako bi se čitava priča zavr&scaron;ila.</p>
<p style="margin-bottom: 0in;">Bez na&scaron;e interevncije, Samra bi bila jedna od armije djece koja za fiziku i matematiku govore:&nbsp;</p>
<blockquote>
<p style="margin-bottom: 0in;">Ja to ni&scaron;ta ne kontam ... a u ostalom kome to sve treba ?!</p>
</blockquote>]]></content:encoded>
	<excerpt:encoded><![CDATA[Prije nešto više od tri godine, u Samrinom 7. razredu osnovne škole, imali smo pravu dramu. Upravo je mi je to grozno iskustvo i bilo "inspiracija" u članku "Hello programiranje, al' čestito, hernad 'The agresivni'", za poglavlje "hernad The ...]]></excerpt:encoded>	

	<wp:post_date>Mon Oct 24 06:50:00 -0700 2011</wp:post_date>
	<wp:post_date_gmt>%= display_date %></wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_name>jel-to-sahbaz-pardon-sahman</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
		<wp:comment>
			<!-- <wp:comment_id>5</wp:comment_id> -->
			<wp:comment_author><![CDATA[]]></wp:comment_author>
			<wp:comment_author_email></wp:comment_author_email>
			<wp:comment_author_url></wp:comment_author_url>
			<wp:comment_date>Mon Oct 24 07:33:13 -0700 2011</wp:comment_date>
			<wp:comment_date_gmt>Mon Oct 24 07:33:13 -0700 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Neki dan je Samra pomenula da je nastavnik Šahman (ko)autor neke školske knjige - udžbenika.

Mislim da ljudi ovakvog profila ne mogu pisati dobre knjige. 

Prosto mi je nevjerovatno da oni koji ne razumiju glavne CILJEVE svog posla, daju putem udžbenika kvalitetne instrukcije drugima.

]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
		<wp:comment>
			<!-- <wp:comment_id>5</wp:comment_id> -->
			<wp:comment_author><![CDATA[murga]]></wp:comment_author>
			<wp:comment_author_email></wp:comment_author_email>
			<wp:comment_author_url></wp:comment_author_url>
			<wp:comment_date>Tue Oct 25 05:17:56 -0700 2011</wp:comment_date>
			<wp:comment_date_gmt>Tue Oct 25 05:17:56 -0700 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Prosto nisam mogao a da se nejavim obzirom da ce i moje dijete (iako staro samo 1 godinu) krenuti nekad Insallah u skolu... vrijeme ipak leti...

„Ako ona ne razumije ja vam ne mogu pomoći“ - pa prosto nevjerovatno u kakvu kontradikciju nastavnici ulaze... pa šta sad on je tu radi ukrasa... ili? Ili radi para?

Ma neznam... obrazovanje u ovoj drzavi je zaista tragikomicno... 

Za udžbenik i da ne govorim... to ti je ono što bi se trebalo zvati šund literatura... 

]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
		<wp:comment>
			<!-- <wp:comment_id>5</wp:comment_id> -->
			<wp:comment_author><![CDATA[]]></wp:comment_author>
			<wp:comment_author_email></wp:comment_author_email>
			<wp:comment_author_url></wp:comment_author_url>
			<wp:comment_date>Tue Oct 25 05:54:58 -0700 2011</wp:comment_date>
			<wp:comment_date_gmt>Tue Oct 25 05:54:58 -0700 2011</wp:comment_date_gmt>
			<wp:comment_content><![CDATA[Šta da ti kažem dragi Murga, nego da ponovim: &quot;Pazi na svoje dijete&quot;.

Ovo i jeste članak posvećen roditeljima. Mnogi roditelji na ovakve stvari daju komentare:

&quot;Ma zašto se sekirate. Hajde naučiće NEŠTO ko što smo i mi naučili&quot;

Ja pozivam roditelje da se sekiraju za svoju djecu. Jer je nazovi ga sistem bosanskog obrazovanja put u mizeriju.

A to za svoju djecu niko ne želi.

]]></wp:comment_content>
			<wp:comment_approved>1</wp:comment_approved>
			<wp:comment_type></wp:comment_type>
			<wp:comment_parent>0</wp:comment_parent>
		</wp:comment>
	
</item>
