<item>
	<title>&quot;bring.out&quot; brend</title>
	<link>http://hernad.bring.out.ba/bringout-brand</link>
	<pubDate>Fri Nov 18 00:52:00 -0800 2011</pubDate>
	
	<dc:creator><![CDATA[Ernad Husremović]]></dc:creator>
	
	
		<category domain="tag" nicename="bring.out"><![CDATA[bring.out]]></category>
	
		<category domain="tag" nicename="business"><![CDATA[business]]></category>
	
		<category domain="tag" nicename="b_knowhow"><![CDATA[b_knowhow]]></category>
	
		<category domain="tag" nicename="opensource"><![CDATA[opensource]]></category>
	

	<category><![CDATA[Uncategorized]]></category>

	<category domain="category" nicename="uncategorized"><![CDATA[Uncategorized]]></category>

  <guid isPermaLink="false">http://hernad.bring.out.ba/bringout-brand</guid>
	<description></description>
	<content:encoded><![CDATA[<p>Na forumima <a href="http://forum.linux.org.ba/viewtopic.php?pid=51975">Udruge Linux korisnika</a>&nbsp;objavio sam interes za angažovanjem novih kadrova.</p>
<p>Od svih komentara, posebno interesantni su bili komentari od @testni_hamo2:&nbsp;</p>
<blockquote class="posterous_medium_quote">
<p>Kvalitetan programer koji vam možda po kulturi i odgovara - veća je &scaron;ansa da će se zaposliti u nekoj drugoj firmi&nbsp;koja mu ne zahtjeva da radi x stvari prije nego &scaron;to i pomisli da dodje na intervju nego kod vas.</p>
<p>Drugo je da vi imate izgrađen brend pa da ljudi žele raditi kod vas radi brenda (npr. google i slično).&nbsp;</p>
</blockquote>
<p>U ovom članku ću poku&scaron;ati odgovoriti na pitanje:</p>
<blockquote class="posterous_short_quote">
<p>Da li postoji "bring.out" brend ? Ako ne postoji, &scaron;ta može biti "bring.out" brend ? Kako možemo zainteresovati druge za uključenje u na&scaron; "knowhow ERP" projekat ?</p>
</blockquote>
<p><!--more--></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Otvoreni IT / ERP provajder</strong></span></p>
<p>Na&scaron; pristup je sljedeći - ono &scaron;to tražimo od drugih &nbsp;(otvorena komunikacija, prezentovanje sopstvenog source koda i načina rada) primjenjujemo i na sebe:</p>
<p>&Scaron;ta smo zadnjih par dana radili ? Evo &scaron;ta:</p>
<ul>
<li><a href="http://redmine.bring.out.ba/projects/knowhow/activity">http://redmine.bring.out.ba/projects/knowhow/activity</a></li>
<li><a href="http://redmine.bring.out.ba/projects/dev-tbox-b-out-ba/activity">http://redmine.bring.out.ba/projects/dev-tbox-b-out-ba/activity</a></li>
</ul>
<p>Kako izgleda na&scaron; source kod ?</p>
<ul>
<li><a href="http://knowhow.github.com/A4_knowhow">http://knowhow.github.com/A4_knowhow</a></li>
<li><a href="http://knowhow.github.com/M3_knowhow">http://knowhow.github.com/M3_knowhow</a></li>
<li><a href="http://knowhow.github.com">http://knowhow.github.com</a></li>
</ul>
<p>U zadnjih četiri mjeseca smo kompletan razvoj sa internih projekata prebacili na javno područje.</p>
<p>Sada se gotovo sve tehničke operacije obavljaju na javnom području.</p>
<p>Samo se direktni kontakti i podr&scaron;ka klijentima, kancelarijski i komercijalini poslovi zatvoreni za javnost.</p>
<p>Znači, kompletan <strong>razvoj firme</strong> prebačen je na javno područje.</p>
<p>Ovo nas defacto brendira kao jedinog bosanskog <span style="color: #339966;"><strong>otvorenog IT / ERP provajdera</strong></span>.&nbsp;</p>
<p>Da li je to bitno ?&nbsp;Za krajnjeg korisnika nije.</p>
<p>Da li je bitno po pitanju angažovanja novih IT kadrova ? Mislim da jeste.</p>
<p>U daljnjoj diskusiji sam rekao kolegi:</p>
<blockquote>
<p>Kako si dobro uočio kultura rada u "bring.out" je bitno različita od onoga &scaron;to je "mainstream"-a &nbsp;u bosanskom IT sektoru.</p>
<p>Sva dosada&scaron;nja iskustva mi govore da je ključni problem, pored znanja, &nbsp;upravo uklapanje u tu kulturu koju mi gajimo.</p>
<p>Slažem se sa tobom da je mala vjerovatnoća da na&scaron;em trži&scaron;tu angažujemo neke iskusne develoepere koji su "kompatibilni" sa nama.</p>
<p>Međutim, puno polažem na mlade ljude koji su otvoreni za novo i drugačije. Oni mogu čuda učiniti.</p>
<p>Angažman takvih mladih ljudi kratkoročno ne može dati značajne rezultate po pitanju napretka na&scaron;eg projekta, ali čuj ... bolje je i to nego na silu angažovati ljude i dobiti tim koji se najbolje opisuje riječima "ko rogovi u vreći"</p>
<p>U par navrata sam u člancima napomenuo da pare nisu problem. Naravno, na&scaron; budžet je daleko od neograničenog, ali smo načisto da je najbitnije da dođemo &scaron;to prije do gotovih proizvoda.</p>
<p>Kao glavni limit vidimo postojeće resurse za razvoj.</p>
</blockquote>
<div>
<p>Kolega je pored ostalog rekao:</p>
<blockquote class="posterous_medium_quote">
<p>Veća je vjerovatnoća da će mladi ljudi biti ko rogovi u vreći nego stariji, sa porodicama osnovanim i/ili sa kreditima. Oni puno ozbiljnije shvataju posao &nbsp;S druge strane va&scaron; "alternativni" pristup rizikuje da privuče ljude koji nisu konformisiti i samim tim teže rade u timu, eventualno imaju problem sa autoritetom ...&nbsp;</p>
</blockquote>
</div>
<p>Da, to je kolega potpuno u pravu.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>"Horizontalno" povezivanje developera</strong></span></p>
<p>Međutim, u na&scaron;oj diskusiji je ispu&scaron;ten jedan veoma bitan element: &nbsp;"knowhow ERP" je otvoreni projekat, tako da postoji niz opcija <strong>"horizontalnog"</strong> povezivanja &nbsp;- povezivanja po principu saradnje i podjele poslova.</p>
<p>Lično mislim da je u tom području puno veći potencijal nego li u klasičnom zapo&scaron;ljavanju za projekat kakav je "knowhow ERP"</p>
<div><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Iskustvo</strong></span></span></div>
<p>Kao podprojekat "knowhow ERP" prije nepunih mjesec dana pokrenut je F18. Radi se o portiranju na&scaron;e stare kliperske aplikacije FMK koja je i dalje aktuelna kod 40-tak klijenata.&nbsp;</p>
<p>Naime, prilikom priprema operacija migracije podataka FMK -&gt; knowhow uočili samo da možemo brzo portirati DOS/Clipper rje&scaron;enja u native linux/windows aplikaciju a podatke prebaciti na isto mjesto kao i knowhow ERP podatke - na PostgreSQL platformu.</p>
<p>Takvo rje&scaron;enje bi nam obezbjedilo da dođemo do konačnog rje&scaron;enja za klijente koji jednostavno ne žele mijenjati postojeće rje&scaron;enje. A takvih ima dosta.</p>
<p>Mi bi se napokon rije&scaron;ili ključnih nedostataka i ograničenja zastarjele razvojne platforme i, &scaron;to je nama posebno bitno, vezanosti za samo jednu - windows platformu.&nbsp;</p>
<p>F18 je projekat razvijan od 1994-danas. Proceduralni kod, često lo&scaron;e ili nikako dokumentovan, nema veliku vrijednost.&nbsp;</p>
<p>Ali u na&scaron;im rukama FMK/F18 svaki mjesec generi&scaron;e cca 4-5000 KM neto prihoda. On nam omogućava plasman i razvoj novih rje&scaron;enja.</p>
<p><strong>know-how</strong>&nbsp;iz oblasti računovodstva i ERP-a koji smo stekli u tih 17 godina, te <strong>baza postojećih klijenata</strong> čine glavni kapital firme.</p>
<p>To nas znači brendira kao <span style="text-decoration: underline;"><span style="color: #339966;"><strong>iskusnu firmu</strong></span></span> u ovoj oblasti.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ultra-small-size firma</strong></span></p>
<p>Firma koja broje 5 ljudi uključujući i administraciju :),&nbsp;kao &scaron;to je na&scaron;a,&nbsp;je definitivno ultra-small-size firma.&nbsp;</p>
<p>Po većini pitanja to je negativna stvar kako za "horizontalnu" saradnju tako i za klasično "zapo&scaron;ljavanje", nema dvojbe.</p>
<p>Da li u toj ultra-small-size veličini postoje i pozitivne strane ?</p>
<p>Ako su na&scaron; "knowhow ERP" ima potencijal, &scaron;to svako za razliku od sličnih projekata drugih firmi svako može <span style="color: #008000;"><strong>samostalno</strong></span> uvjeriti, svaki novi developer postaje "bitan faktor" kako za firmu tako i za projekat u cjelini.&nbsp;</p>
<p>Projekat koji je u startu zami&scaron;ljen da pređe granice na&scaron;e firme.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Fork !</strong></span></p>
<p>Svako open source developer zna značenje riječi <a href="http://en.wikipedia.org/wiki/Fork_(software_development)">"fork"</a>. Mogućnost forkiranja projekta ukoliko vam se postojeći razvoja ne sviđa, &nbsp;smatra se elementarnim pravom svakog OSS developera.</p>
<p>Za razliku od rada u zatvorenoj firmi(*), na&scaron;a firma je otvorena za forkiranje.</p>
<p>Developer "bring.out" ima dodatnu slobodu. On može reći:</p>
<blockquote class="posterous_short_quote">
<p>Ja mogu organizovati biznis oko "knowhow ERP" bolje nego "bring.out".&nbsp;</p>
</blockquote>
<p>Pri tome "bolje" može biti bolja plata, drugačiji nastup prema korisnicima ili ne&scaron;to treće.</p>
<p><span style="color: #339966;"><strong>Mogućnost "forkiranja"</strong></span> golema stvar. Zato ću i to nazvati na&scaron;im brendom.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Domaći razvoj software-a u Bosni za Bosance</strong></span></p>
<p>Na vi&scaron;e mjesta sam napisao da je bring.out "furka" razvoj software-a <span style="text-decoration: underline;"><strong>u Bosni za Bosance</strong></span>.</p>
<p>Mi&scaron;ljenja sam da zatvoreni provajderi ne nude DOBRA ERP rje&scaron;enja. Bosansko trži&scaron;te je malo.&nbsp;</p>
<p>Zatvoreni globalni/regionalni provajderi, sasvim logično, najmanje razvojnih resursa usmjeravaju na najmanja trži&scaron;ta kakvo je bosansko.</p>
<p>Otvoreni projekat kao &scaron;to je "knowhow ERP" može promjeniti pravila igre u ovom području.</p>
<p>Ako domaćim vendorima ponudimo DOBAR software kao alat, ako im damo slobodu da sa puno vi&scaron;e slobode kreiraju "third party" rje&scaron;enja, ako sve to bude povoljnije od onoga &scaron;to im nude zatvoreni vendori, stvari se mogu radikalno promjeniti.</p>
<p>ERP vendori su sada u najvećoj mjeri integratori i prodavci licenci globalnih/regionalnih vendora.</p>
<p>U toj poziciji oni su primarno <span style="color: #008000;"><strong>prodavci tuđe pameti</strong></span>.</p>
<p>"knowhow ERP" otvara prostor da se u Bosni - na lokalnom trži&scaron;tu počne de&scaron;avati značajan razvoj.</p>
<p>Time se iz pozicije prodavaca ERP vendori značajno pomjeraju ka poziciji <span style="color: #008000;"><strong>kreatora - proizvođača software-a</strong></span>.</p>
<p><span style="text-decoration: underline;"><span style="color: #000000; font-size: medium;"><strong>Rekap</strong></span></span></p>
<p>bring.out je vizionar sa svojim konceptom otvorenog razvoja software-a na BH trži&scaron;tu.</p>
<p>Mi kreiramo novi prostor za domaći razvoj sofware-a u Bosni za Bosance.</p>
<p>bring.out je iskusan ERP vendor sa 14-godi&scaron;njim iskustvom u ovoj oblasti.</p>
<p>bring.out je sada "ultra-small-size" firma. Ta činjenica ima i svoje pozitivne strane.</p>
<p>bring.out developeri su slobodni. Imaju pravo na fork.</p>
<p>Ako je na&scaron; koncept dobar, ako imate ambiciju postati (ili biti jo&scaron; veća) "faca" u razvoju ERP software-a uključite se u na&scaron; <a href="http://redmine.bring.out.ba/projects/knowhow">"knowhow ERP"</a> tim.</p>
<p>---</p>
<p>(*) Namjerno koristim termine zatvorena/otvorena firma umjesto "open source" firma i "open source" projekat.</p>
<p>"knowhow ERP" je puno vi&scaron;e od projekta koji objavljuje "source code". Otvoreni razvoj je po nama je podjednako bitan kao i otvoreni "source code".</p>]]></content:encoded>
	<excerpt:encoded><![CDATA[Na forumima Udruge Linux korisnika objavio sam interes za angažovanjem novih kadrova. Od svih komentara, posebno interesantni su bili komentari od @testni_hamo2: Kvalitetan programer koji vam možda po kulturi i odgovara - veća je šansa da će ...]]></excerpt:encoded>	

	<wp:post_date>Fri Nov 18 00:52:00 -0800 2011</wp:post_date>
	<wp:post_date_gmt>Fri Nov 18 00:52:00 -0800 2011</wp:post_date_gmt>
	<wp:comment_status>open</wp:comment_status>
	<wp:ping_status>open</wp:ping_status>
	<wp:post_id>80691328</wp:post_id>
	<wp:post_name>bringout-brand</wp:post_name>
	<wp:status>publish</wp:status>
	<wp:post_parent>0</wp:post_parent>
	<wp:menu_order>0</wp:menu_order>
	<wp:post_type>post</wp:post_type>
	<wp:post_password></wp:post_password>
	<wp:is_sticky>0</wp:is_sticky>

	
</item>
