<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/11/knowhow-erp-k9z-software-bounty-3000-km.html">Previous</a>
&nbsp; 
<a href="../../../index-5.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/11/hernad-the-agresivni-i-porezna-uprava-fbih.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>"knowhow ERP" i "bring.out" - drugačiji projekat, drugačija firma</h3>
<div class='post_info'>
<span class='post_time'>November  3 2011,  5:57 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>U članku<a href="http://hernad.bring.out.ba/trazi-se-knowhow-erp-project-manager"> 'Traži se "knowhow ERP' project manager'</a>, Dženana mi je ukazala na dvije bitne stvari:</p>
<ol>
<li>rad "knowhow ERP"-u se ne percipira kao "parali" posao</li>
<li>uče&scaron;će u ovakvom projektu projektu je "too risky" za nekoga ko zna raditii ovaj posao.</li>
</ol>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Istorija</strong></span></p>
<p>Projekat je započeo svoj život <a href="http://www.bring.out.ba/knowhow">25.11.2010</a>, znači prije skoro godinu dana.</p>
<p>Međutim, tek u posljednja četiri mjeseca desile su se intenzivne aktivnosti na polju razvoja.</p>
<p>Prije četiri mjeseca mi smo imali potpunu "ledinu":</p>
<ol>
<li>KAKO mobilni klijent ?</li>
<li>KAKO ERP P1 ?</li>
<li>Kako web server ?</li>
<li>Kako organizovati projekat ?</li>
<li>Koji database server ?</li>
<li>Kako migrirati FMK ? U &scaron;ta migrirati FMK ?</li>
</ol>
<p>U ovom periodu smo ipak uspjeli mnoge&nbsp;varijable "setovati", te doći do sljedećih rezultata:</p>
<ol>
<li>M3 prototip</li>
<li>A4 protiip</li>
<li>P1 prototip</li>
<li>F18 prototip</li>
<li>database sloj PostgreSQL          
<ul>
<li>openstack testna infrastruktura</li>
</ul>
</li>
<li>BI reporting prototip</li>
<li>migracija FMK =&gt; knowhow ERP (prodaja)</li>
</ol>
<p>Nije lahko ni za nabrojati, a ne kamo li za uraditi.&nbsp;Ako se uzme da su tri mjeseca radila dva (vsasa, hernad), a tek zadnji mjesec u razvoj se uključio i treći član(*) (bjasko), na&scaron; rezultat je stvarno sjajan.&nbsp;</p>
<div><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>"Parali" posao ?</strong></span></span></div>
<p />
<div>Međutim, pored funkcije samohvalisanja u ime "knowhow ERP"&nbsp;<a href="http://hernad.bring.out.ba/fokus">dream-tima</a>&nbsp;želim reći da je ovo bio dobar posao za radnike bring.out(**).</div>
<p />
<div><span style="text-decoration: underline; font-size: medium;"><strong>Risky business ?!</strong></span></div>
<p />
<div>Gruba računica kaže da je do sada u projekat investirano skoro 50 000 KM.</div>
<p />
<div>S obzirom da nemamo konačnih proizvoda, povrata novca nema. Ni u narednih četiri mjeseca ne mogu se očekivati nikakvi značajniji prihodi od projekta. Samo potro&scaron;nja :).</div>
<div>Ukratko, projekat je u fazi investicije.</div>
<p />
<div>Međutim, to je sasvim očekivano. Ovo nije veleprodaja bananama (ne umanjujući ozbiljnost tog posla) nego informatički projekat.&nbsp;</div>
<p />
<div>Svima nama, bilo da &nbsp;učestvujemo u razvoju ili u vođenju projekta, glava "izgori" od napora.</div>
<p />
<div>Ovo je pravo zeznut' posao.</div>
<p />
<div>Ali da ovo ne postane kuknjava - niko nas nije tjerao da se upustimo u ovaj posao :). Mi volimo svoj posao.</div>
<div><!--more--></div>
<div><strong><span style="text-decoration: underline;"><span style="font-size: medium;">Entuzijazam, "passion"</span></span></strong></div>
<p />
<div>
<div>Iako svi za cilj imamo obezbjediti svoju egzistenciju, mi smo puni entuzijazma.&nbsp;</div>
<p />
<div>Svakom novom feature-u, svakom otklonjenom bug-u, svakom novom <a href="http://hernad.bring.out.ba/postignuce-ahaa-efekat">"ahaa"</a>&nbsp;mi se u radujemo ko mala djeca. Ubijeđen sam da je takva klima jedini način da dođemo do željenog cilja.</div>
<p />
<div>Ubijeđen sam da informatičar koji radi samo zato da zaradi platu ne može biti dobar informatičar. On mora imat strast za rje&scaron;avanje probema - entuzijazam, "passion".</div>
</div>
<p />
<div><span style="text-decoration: underline; font-size: medium;"><strong>knowhow ERP je "peace brothers" / "open source" sapunica ?</strong></span></div>
<p />
<div>Namjerno sam sve ovo naveo iz razloga &scaron;to očigledno postoje pogre&scaron;ne asocijacije na "otvoreno" i "open source".</div>
<p />
<div>knowhow ERP nije nikakva "peace broders" / "open source" / volonterska sapunica. Ovo je ozbiljan posao.</div>
<p />
<div>Ovo je projekat u razvoju. Kao takav, on je rizičan posao.</div>
<p />
<div>Ovo je međutim komercijalni projekat firme "bring.out". Mi vjerujemo u njega. Kao takav, on je parali posao za sve one koji mogu dati konkretan doprinos projektu.</div>
<p />
<div>Zato, nemojte misliti da je ovo zezancija.</div>
<p />
<div>Mi se često zezamo na svoj i tuđi račun, ali kada radimo radimo svojski.&nbsp;</div>
<p />
<div>Po&scaron;to je knowhow ERP otvoren projekat, u to se svako može jednostavno uvjeriti - pogledajte na&scaron; <a href="http://redmine.bring.out.ba/projects/knowhow/activity">redmine</a> i na&scaron;e <a href="https://github.com/knowhow">github repozitorije</a>.&nbsp;</div>
<p />
<div><span style="text-decoration: underline; font-size: medium;"><strong>Drugačiji projekat, drugačija firma</strong></span></div>
<p />
<div>"knowhow ERP" je potpuno <strong>drugačiji</strong> projekat u odnosu na sve druge ERP projekte na bosanskom trži&scaron;tu. &nbsp;</div>
<p />
<div>"bring.out" je <strong>drugačija</strong> software development firma od svih drugih na bosanskom IT trži&scaron;tu.</div>
<p />
<div>Stoga nemojte apriori na&scaron; drugačiji pristup poslu uzeti kao ne&scaron;to &scaron;to je neozbiljno ili bez perspektive. Prije konačne ocjene "bring.out" i "knowhow ERP" pročitajte &scaron;ta i kako radimo. &Scaron;ta smo postigli, &scaron;ta su na&scaron;i ciljevi.</div>
<div>Svjesni smo da je u prvom čitanju te&scaron;ko "pohvatati konce" o na&scaron;im poslovima. Međutim, isto tako smo ubijeđeni da će pažljivi čitalac brzo razumjeti osnovne postavke na&scaron;eg djelovanja.&nbsp;</div>
<p />
<div>Mogućnost uvida u sve na&scaron;e <a href="http://redmine.bring.out.ba/projects">aktivnosti</a>, rezultate na&scaron;eg rada u formi <a href="https://github.com/knowhow">source kode repozitorija</a>, <a href="http://do-we-know-how.bring.out.ba/tag/video_clip">video prezentacija</a>&nbsp;i drugih <a href="http://do-we-know-how.bring.out.ba/">materijala</a> čine nas različitim.</div>
<p />
<div>Dostupnost svih na&scaron;ih aktivnosti &nbsp;redmine ticketima</div>
<div>, ali isto tako mislimo da je javna dostupnost svih na&scaron;ih aktivnosti, kao &nbsp;rezultata tih aktivnosti stvar koja će na&nbsp;&nbsp;</div>
<p />
<div>Da li će nas na&scaron;e "drugačije" dovesti do željenog <a href="http://hernad.bring.out.ba/javna-i-komercijalna-dimenzija-knowhow-erp">cilja</a>&nbsp;- do DOBROG ERP software-a, to ne možemo znati.&nbsp;</div>
<p />
<div>Međutim znam da svim srcem i znanjem, svojski, radimo na tome. &Scaron;</div>
<p />
<div>Mi smo drugačiji, i trebamo drugačije ljude: ljude koji su otvoreni, hrabri i pametni.</div>
<p />
<div>Možete biti samo-taki developer ili projekt menadžer "knowhow ERP" i "bring.out" nisu prava sredina za vas.</div>
<p />
<div>Ako ne vidite nikakvu svrhu u tome da je sav va&scaron; rad u tome izložen očima javnosti, ako smatrate da su va&scaron;i uvriježeni alati i tehnologije jedini i najbolji, "knowhow ERP" vjerovatno nije pravo mjesto za vas..</div>
<p />
<div>Ako međutim smatrate da se u Bosni može napraviti bolji ERP software od postojećeg, da je mogućnosti izbora bitna, da je otvorenost način da se dođe do DOBROG software-a, "knowhow ERP" bi moglo biti pravo mjesto za vas.</div>
<p />
<div><span style="text-decoration: underline; font-size: medium;"><strong>"knowhow ERP" je "&scaron;kola za pačiće male" ?</strong></span></div>
<p />
<div>Da moja predhodna rečenica ne bi bila pogre&scaron;no shvaćena, "knowhow ERP" NIJE &scaron;kola za pačiće male.</div>
<p />
<div>Da bi se upoznali sa projektom ne treba vam nikakva dozvola. Možete danima "surfati" po na&scaron;em redmine sistemu i na&scaron;im blogovima.</div>
<p />
<div>Tokom tog surfanja, slobodno pitajte. Ali na&scaron;i blogovi ipak nisu mjesto za učenje osnova programiranja. Imate "google" pa "opletite".</div>
<p />
<div>Pored toga, nije lijepo postavljati pitanje nakon &scaron;to &scaron;to ste utro&scaron;ili minut-dva na čitanje.&nbsp;Stvari na kojima mi radimo su ozbiljne i zahtjevne stvari.&nbsp;Pola tih stvari i mi u hodu učimo. Sve &scaron;to radimo bilježimo na na&scaron;em redmine sistemu upravo iz tog razloga da se drugi mogli &scaron;to samostalnije uključivati u projekt.</div>
<p />
<div>Naravno, potpuno samostalno uključivanje je nemoguće. Mi smo toga svjesni, i sve poduzimamo da novim <a href="http://redmine.bring.out.ba/issues/24931">članovima pomognemo</a>. Ali imamo i jasna očekivanja. "knowhow ERP" nije nikakav volonterski projekat.</div>
<p />
<div>Volonteri su dobrodo&scaron;li, ali posao koji radimo je ozbiljan posao, sa konkretnim zadacima i ograničenim rokovima.</div>
<p>------</p>
<p>(*) i tome dodamo da je bjasko bez ikakvih prednodnih developerskih iskustava. On je bukvalno "prekomandovan" iz sysadmin poslova u razvoj.</p>
<p>(**) Osim mene :(, ali ja sam u komercijalnom dijelu u ulozi investitora</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, b_knowhow, opensource</div>
</div>
<div class='post_responses'>
<h4>698 views and 1 response</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Nov  4 2011,  7:02 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'><a href="http://redmine.bring.out.ba/issues/25147" rel="nofollow">http://redmine.bring.out.ba/issues/25147</a></div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>