<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/u-rijetkim-trenucima-kad-je-babo-hernad-bio-f.html">Previous</a>
&nbsp; 
<a href="../../../index-6.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/10/a-tribute-to-dennis-ritchie.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Fokus</h3>
<div class='post_info'>
<span class='post_time'>October 13 2011,  2:07 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Zadnjih godinu dana redovno dovim:</p>
<blockquote class="posterous_medium_quote">
<p>Dragi Allahu, providi. Olak&scaron;aj moje poslove! <br />Podaj da započete poslove, preuzete obaveze, postavljene ciljeve ostvarim do kraja.&nbsp;Podaj da se kanem beskorisna posla, ili posla koji nisam kadra zavr&scaron;iti ! <br />Podaj da ishod bude hairli posao: koristan za mene i moju porodicu, za moju firmu i ljude koji u njoj rade, za one koji koriste na&scaron;e proizvode. <br />Daj mi fokus. Providi !&nbsp;</p>
</blockquote>
<p>Fokus. Fokus je ne&scaron;to sa čim oduvijek imam problem. Puno mi je toga u glavi. Puno započnem, a malo toga zavr&scaron;im.</p>
<p><!--more-->Kada mi ponestane samopouzdanja pomislim:</p>
<blockquote class="posterous_medium_quote">
<p>&Scaron;ta si zin'o na dunjaluk !? Pomiri se sa tim da te svoje želje i ma&scaron;tanja jednostavno ne može&scaron; ostvariti. Nisi ti tako pametan kako sam sebe ufurava&scaron; ! Eto te razmi&scaron;lja&scaron; ko dijete od 7 godina - k'o Bakir ... Jo&scaron; samo da se počne&scaron; pitati: 'Hoću li biti astronaut ili informatičar kad porastem ?' ...</p>
</blockquote>
<p>Nakon tih ekstremnih gore/dole razmi&scaron;ljanja, elhamdulillah, vazda dođe period zati&scaron;ja - dođem do nekakve sredine.</p>
<p>Tokom tog perioda sredine radim. Nekada bolje, nekada lo&scaron;ije. Nekada vi&scaron;e, nekad manje manje fokusiran.</p>
<p>U zadnjih par mjeseci, elhamdulillah, napokon imam osjećaj da maglene "knowhow" vizije dobijaju konkretnu formu. Moji poslovi napokono konvergiraju ka konkretnim rje&scaron;enjima ! &nbsp;</p>
<p>Osjećaj lutanja kroz maglu, presipanja iz "&scaron;upljeg iz prazno" polahko nestaje.</p>
<p>U svemu tome mi je posebno interesantna konstatacija da taj progres nije rezultat nekakvih radikalnih promjena mene !?</p>
<p>Ja, ako &scaron;to to upravo sada radim :), znam čitav dan "protračiti" na pisanje ovakvog članka, umjesto da radim ne&scaron;to konkretno.</p>
<p>&Scaron;ta je onda pokrenulo te pozitivne procese ? Gdje su se desile promjene ?</p>
<p>U organizaciji. U organizaciji je "kvaka" !&nbsp;</p>
<p>Prije&nbsp;<a href="http://hernad.bring.out.ba/kasnjenje">tri mjeseca</a>&nbsp;sam u tim svojim gore/dole mislilačkim fazama bio na dnu:</p>
<blockquote>
<p>Nemam fokusa, nemam fokus. Lutam, lutam ?! Samo &scaron;to si čestito "zagazio" u <a href="http://hernad.bring.out.ba/pije-li-vode-oss-erp-software-u-bosni-openerp">openerp</a>, ti opet&nbsp;stane&scaron;. Ni&scaron;ta ti ne valja !? Pa &scaron;ta ti je čovječe ? Preuzeo si obaveze da to uradi&scaron; ! Daj bar ne&scaron;to zavr&scaron;i. Ma nema&scaron; ti pojma ... ti si izgubljen ko "burek u svemiru" !</p>
</blockquote>
<p>Bez obzira na svoju iskrenost, te sam misli ipak ostavio za sebe. I iskrenost ima granice :)</p>
<p>Pored toga &scaron;to bi to (opravdano) druge dovelo do zaključka da je Ernad ovaj put i nepovratno puk'o, razlog su bile ove suprotstavljene misli:</p>
<blockquote class="posterous_short_quote">
<p>Ima razlog zbog koga luta&scaron; !? &nbsp;Ne&scaron;to ne radi&scaron; dobro. Prestroji se. Promijeni organizaciju. Rethink Ernade ! Rethink Ernade !</p>
</blockquote>
<p>U narednom periodu to se, elhamdulillah, i desilo.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Sa&scaron;a (vsasa)</strong></span></p>
<p>U projekat sam uključio Sa&scaron;u. Sa&scaron;a i ja radimo zajedno vi&scaron;e od 10 godina. Sa&scaron;a zna na pravi način protumačiti i moje najkonfuznije zahtjeve.&nbsp;</p>
<p>On je iskusan developer, zna programirati, zna identificirati konkretan cilj zadatka i ići ka tom cilju.</p>
<p>Sa&scaron;a je fokusiran, ja to nisam. To nas čini dobrom kombinacijom. Moj cilj je knowhow u cjelini, njegov ticket <a href="http://redmine.bring.out.ba/issues/24800">#24800</a>, <a href="http://redmine.bring.out.ba/issues/24792">#24792</a> ili neki treći.</p>
<p>Ja sa ticketima kao &scaron;to je <a href="http://redmine.bring.out.ba/issues/24494">#24494</a>&nbsp;"zanovijetam", a on ide ka cilju. Ono &scaron;to je vrlo bitno, u toj priči "hernad konvergira" / "vsasa divergira" nema konflikata.</p>
<p>Diskusija ima, razilaženja ima, ali sve te diskusije udaraju u "isti bubanj", ka istom cilju.</p>
<p>Postoji povjerenje, postoji razumijevanje da <a href="http://knowhow.github.com/M3_knowhow">dobar software</a> nije samo software koji proradi.</p>
<p>Zato sam ubijeđen da Sa&scaron;a i ja jedan bez drugoga ne možemo :).</p>
<p>Ali da ovo ne bude neka patetična priča, pojasniću: Sa&scaron;a je radom u bring.out "ispekao zanat" developra kakvog bilo koja firma samo poželjeti može.</p>
<p>Međutim, bring.out je prostor koji Sa&scaron;i nudi puno toga i od Sa&scaron;e izvlači maksimum.&nbsp;</p>
<p>Tome su moje konvergencije puno pomogle. Bez tih konvergencija Sa&scaron;a bi bio "na persi" sa git-om i github-om, sa javascript-om i appcelerator-om i ko zna sa čim već &scaron;to je Sa&scaron;a u zadnja tri mjeseca prevalio preko glave.</p>
<p>Istina. Sve to je mogao negdje drugo savladati. U nekoj drugij firmi. Međutim, u svakoj novoj firmi otvara se bespo&scaron;tedna borba za status:&nbsp;"Koje si &scaron;kole zavr&scaron;io ?". "Ko si ti da meni, inžinjeru informatike, drži&scaron; predavanja ?". To Sa&scaron;a dobro zna.&nbsp;</p>
<p><a href="http://hernad.bring.out.ba/mursel-i-totalno-otvaranje-bringout">Koncept totalne otvorenosti</a>&nbsp;nosi sa sobom opasnost. Sa&scaron;a gradi svaki dan na github-u gradi svoj kredibilitet. Svaki taj projekat, svaki njegov "commit" je bolji od <a href="http://hernad.bring.out.ba/radno-mjesto-u-bringout">deset stranica napucanog CV-a</a>.</p>
<p>Svaki taj projekat govori koje vje&scaron;tine Sa&scaron;a ima, kakav doprinos Sa&scaron;a može dati.</p>
<p>Koje je &scaron;kole Sa&scaron;a zavr&scaron;io ?</p>
<p>Sa&scaron;a je srednjo&scaron;kolac. Pride, srednju &scaron;kolu je zavr&scaron;io u ratno vrijeme. Pola časova "progutale" sirene za uzbunu. Lo&scaron;e obrazovanje, da gore ne može biti.</p>
<p>Ali, koga je to briga kada je posao u pitanju ?! Sa&scaron;a zna raditi posao. Sa&scaron;a ima diplomu <span style="color: #ff0000;"><strong>"The dobar developer"</strong></span>.&nbsp;Potpis na tu diplomu mu stavljaju njegovi&nbsp;<a href="https://github.com/vsasa">github commit-i</a>&nbsp;i <a href="http://redmine.bring.out.ba">redmine ticketi</a> .</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Jasko (bjasko)</strong></span></span></p>
<p>Na pisanje ovog teksta me nije ipak nje potakao Sa&scaron;a, nego Jasko. Jutros su me u mailbox-u dočekale notifikacije na knowhow tickete koji su dodijeljeni Jasku: <a href="http://redmine.bring.out.ba/issues/24732">#24732</a>,&nbsp;<a href="http://redmine.bring.out.ba/issues/24736">#24736</a>,&nbsp;<a href="http://redmine.bring.out.ba/issues/24737">#24737</a>.&nbsp;</p>
<p>Jučera&scaron;nji radni dan je bio pretrpan tekućim sysadmin poslovima, tako da Jasko ove ticket nije mogao uzeti u toku dana kako je ranije planirano.</p>
<p>Zato je on odlučio da to uzme uveče. Naravno, to su njegovi radni zadaci i to će mu biti plaćeno. Ali je i prije bilo takvih zadataka, koji su mjesecima čekali na realizaciju.&nbsp;</p>
<p>Koja je sada razlika ?</p>
<p>Razlika je zasigurno nastala u tome &scaron;to se ove aktivnosti vrlo eksplicitno <a href="http://hernad.bring.out.ba/sejtan-i-opensource">vrednuju</a>. Radnici kroz svoje plate "osjete" efekte rada na knowhow(*).</p>
<p>Ali to nije sve. Stvara se klima pravog tima. Nema priče: "Ovo nije to moj rejon". Svako nastoji dati svoj doprinos.&nbsp;</p>
<p>Ono &scaron;to je u pomenutim "Jaskovim" ticketima veoma bitno jeste da se tu de&scaron;ava mje&scaron;avina sysadmin i developerskih operacija. I on se sa svim tim izborio maksimalno <strong>samostalno</strong>, prateći rad drugih na sličnim stvarima. E to je ono &scaron;to je u toj priči golemo.</p>
<p>Zato mi je Jaskov <a href="https://github.com/hernad/harbour_playground/pull/2">pull request</a>&nbsp;zlata vrijedan.</p>
<p>I Jasko je srednjo&scaron;kolac. I Jasko je zavr&scaron;io istu onu ratnu srednju Elektro &scaron;kolu na Bilmi&scaron;ću(*).</p>
<p>I Jasko je kao i Sa&scaron;a "truba" po formalnom obrazovanju. Međutim, Jasko ima diplomu <strong><span style="color: #ff0000;">"The dobar sysadmin"</span></strong>.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Nije sve bilo uvijek tako ružičasto ... dapače</strong></span></p>
<p>Da me je neko prije godinu dana pitao za Jaska i Sa&scaron;u, ne bih imao ove riječi hvale. Oni to i sami znaju :). Ako ni&scaron;ta drugo, sa mnom su ljudi uvijek bili načisto.&nbsp;</p>
<p>Svako malo dobijali su komentare kritike:</p>
<blockquote class="posterous_short_quote">
<p>Pa čovječe, razmi&scaron;ljaj ! Pa zar ovo nisi uočio ? Gdje je priprema ? Gdje je vezni ticket ?!&nbsp;</p>
</blockquote>
<p>Samo prije pola godine, ta negativna energija je kulminirala do te tačke da je tren falio da se svak' na svoju stranu raziđe. Jasko i Sa&scaron;a su bili ubjeđeni da se njihovi napori ne uvažavaju, ja da se moji zahtjevi ne po&scaron;tuju ...</p>
<p>Pa &scaron;ta se u proteklom periodu promijenilo ?</p>
<p>Svi smo se dijelom promijenili. Kao čovjek sa posljednjom riječi u firmi, ja sam zasigurno bio uvijek i najjači remetilački faktor. &nbsp;Ako ja ne&scaron;to bitno ispu&scaron;tam iz vida, ako ja ne&scaron;to pogre&scaron;no "guram", to se naravno osjeti najvi&scaron;e.</p>
<p>Ali, označavanje krivaca i zaslužnih za ne&scaron;to &scaron;to je iza nas nema previ&scaron;e značaja.&nbsp;</p>
<p>Svima nam je uvijek bilo jasno, čak i u fazama najvećih konflikata, da su namjere onih drugih po&scaron;tene. Nikada se tu nisu de&scaron;avale nekakva "prljave igre" i spletkarenja. Nerazumjevanje da, ali ovo posljednje ubijeđen sam ne.</p>
<p>To nas je vjerovatno i zadržalo zajedno u najtežim trenucima.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Sinergija, mikro bring.out community</strong></span></p>
<p>Mislim da smo u posljednjem periodu ostvarili <strong><span style="color: #ff0000;">sinergiju&nbsp;</span></strong>zato &scaron;to smo unutar firme formirali svoj mikro bring.out "<a href="http://en.wikipedia.org/wiki/Community">community</a>".</p>
<p>Komuniciramo, sarađujemo, razmi&scaron;ljamo, tražimo rje&scaron;enja. Zajedno.</p>
<p>Nismo volonteri, radimo zato da bi za svoje poslove primili platu, ali ipak djelujemo u skladu sa principima djelovanja otvorene zajednice.</p>
<p>Tome je naravno doprinijelo moje "pushiranje" takvog načina djelovanja. Za to je trebalo puno vremena.</p>
<p>Puno truda. Dva nepismena i jedan srednjo&scaron;kolac sanjar. Hmmm, definitivno nismo "dream tim" :). Međutim, forsiranje otvorenosti napokon daje željene rezultate.</p>
<p>Ja ih vidim. Moje kolege ih vide. To je ono &scaron;to nas pokreće.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Budućnost</strong></span></p>
<p>Dugoročno, knowhow onako kako je zami&scaron;ljen ne možemo iznijeti nas trojica. Svaki materijal ima zamor. Mi se sada tro&scaron;imo 500% ... Tako ne može dovijeka.&nbsp;Kadrovska pojačanja su neophodna.</p>
<p>Međutim, ne treba se sada time baviti. Treba guliti "naprijed".</p>
<p>Doći će vakat, aBd, kada će se se oko "knowhow" formirati prava zajednica.</p>
<p>Zajednica čiji je zametak mikro bring.out community :).</p>
<p>Na tome kao i na svakom drugom projektu jednostavno treba raditi. Biti uporan i istrajan. Ni&scaron;ta se nije preko noći stvorilo.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Dova</strong></span></p>
<p>Priča o bring.out i "knowhow" nije bajka. To je priča koje je tek počela. Samo dragi Allah zna na &scaron;ta će to izaći. Nije moje da se lupam glavu kakav će biti ishod.</p>
<p>Moje je poduzeti ono &scaron;to je u mojoj moći. Moje je vjerovati u taj projekat i raditi na njemu najbolje &scaron;to znam zajedno sa ostalom rajom iz bring.out community-ja :)</p>
<p>Kad smo već kod konkretnih stvari:</p>
<blockquote class="posterous_short_quote">
<p>Dovim Uzvi&scaron;enom da "knowhow" bude halal posao od kojeg će mnogi vidjeti hajra.</p>
</blockquote>
<p>Amin.</p>
<p>---</p>
<p>(*) Mi smo kao mala firma uvijek "puni" sa tekućim obavezama. Tekuće obaveze "pojedo&scaron;e" većinu na&scaron;eg radnog vremena. Koliko god se trudili, unutar standardnog radnog vremena ne možemo obezbjediti potrebnu dinamiku za nove projekte kakav je "knowhow".</p>
<p>(**) Elektrotehnička &scaron;kola u Zenici nalazi se u naselju "Bilmi&scaron;će"</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, b_knowhow, dova</div>
</div>
<div class='post_responses'>
<h4>410 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
