<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/jel-to-sahbaz-pardon-sahman.html">Previous</a>
&nbsp; 
<a href="../../../index-5.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/10/i-have-a-dream.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Hello programiranje, al' čestito - drugi dio</h3>
<div class='post_info'>
<span class='post_time'>October 22 2011,  9:31 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Iako sam uložio <a href="http://hernad.bring.out.ba/hello-programiranje-al-cestito">veliki napor</a> da Samri objasnim koncept, sve ovo je za Samru ipak "too much".</p>
<p>Jutros je počela sa pisanjem eseja. Ali opet "nja-nja". Međutim, shvatio sam da je djetetu svega preko glave. Skroz je iscrpljena. Dala se u taj CT projekat maksimalno, poku&scaron;ava razumjeti, ali je ono &scaron;to se od nje traži "too much".</p>
<p>Poku&scaron;ao sam par puta sa strategijom: "Pročitaj ponovo, pročitaj pažljivije ...", "poku&scaron;aj sama":</p>
<blockquote class="posterous_short_quote">
<p>Kako ću ovo sa "python", nja-nja ... ni&scaron;ta ne razumijem ...</p>
</blockquote>
<p>Odgovorio sam</p>
<blockquote class="posterous_short_quote">
<p>Uđi u "python" interpreter, tu može&scaron; zadavati python komande direktno</p>
</blockquote>
<p>Samra tonom očajnika nastavlja:</p>
<blockquote class="posterous_short_quote">
<p>python interpreter, &scaron;ta je to ?!&nbsp;</p>
</blockquote>
<p>Sjetio sam se "Dženanine" zone <a href="http://hernad.bring.out.ba/ukljucujemo-i-psihologe-u-temu-hello-programi">proksimalnog razvoja</a>. Samra je očigledno do&scaron;la do te granice.</p>
<p><!--more-->Kako sam u prvom postu i konstatovao ovaj projekt je definitivno "beyond &nbsp;Samra's borders".</p>
<p>To je upravo ono &scaron;to sam i uočio, i u predhodnom članku izložio.</p>
<p>Pojmovi koje sam izložio u predhodnom članku joj se jo&scaron; nisu "primili".</p>
<p>Zato sam sjeo za njen sto, otvorio "github desktop", otvorio dva nova projekta i rekao:</p>
<blockquote class="posterous_medium_quote">
<p>Prati, ja ću za tebe uraditi ova dva primjera koja sam izložio u predhodnom članku u 'python'-u &nbsp;i 'C'-u. Tvoje je da pažljivo prati&scaron;. Ali pod "prati&scaron;" mislim na to da razumije&scaron; moje operacije, a ne da k'o sumanuta zapisuje&scaron; da bi to mogla prepisati u svoj CT rad.</p>
</blockquote>
<p>Napravio sam "python" verziju:</p>
<p><a href="https://github.com/hsamra/CT_python/commits/master">https://github.com/hsamra/CT_python/commits/master</a></p>
<p>kao i "C" verziju:</p>
<p><a href="https://github.com/hsamra/CT_c/commits/master">https://github.com/hsamra/CT_c/commits/master</a></p>
<p>U "C"-u sam joj pokazao jo&scaron; kako se pona&scaron;a gcc kompajler u slučaju gre&scaron;aka.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Samrina razumjevanja i nerazumjevanja</strong></span></p>
<p>1) hernad: &Scaron;ta je "gcc" kada ga uporedi&scaron; sa primjerom iz pascal-a ?</p>
<p>hsamra: kompajler. Sa njim kompajliramo .c program</p>
<p>2) hernad: &scaron;ta se dobija sa gcc (pokazao sam sa joj sa "ls" sadržaj direktorija prije i poslije "gcc hello.c"</p>
<p>hsamra: a.out je excute fajl. A za&scaron;to je a.out ?!</p>
<p>hernad: hajde djete nemoj me zezat' eto zato. gcc uvijek pravi kao output po default-u a.out. I to ti je to.</p>
<p>3) hsamra:&nbsp;&scaron;ta je ovo int ispred main u hello.c ? &Scaron;ta je main ? &scaron;ta je return 0 ?</p>
<p>hernad: main je ime za glavnu funkciju koju mora imati svaki C program. return 0 kaže da će program uvijek vratiti sistemu vrijednost 0.&nbsp;</p>
<p>hsamra: Ni&scaron;ta ja tebe ne razumijem ... to &scaron;to priča&scaron; je meni skroz zbunjujuće .. ne razumijem te !</p>
<p>hernad: razumijem te skroz. Ovo je već previ&scaron;e za tebe</p>
<p>4) hernad: Uočavam da ti je sintaksa C-a nejasna, nečitvljiva ...</p>
<p>hsamra: Uh ja&scaron;ta je. Ovo je grozno. Kome je ovaj C kod uop&scaron;te razumljiv ?</p>
<p>hernad: Mnogim informatičarima je razumljiv, i sviđa im se. Ali nebitno. Tvoj utisak me u svakom slučaju nije iznenadio.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Rezime</span></strong></span></p>
<p>Samra je počela razumjevati fundamentalne pojmove i koncepte koje sam naveo u predhodnom "Hello programiranje, al' čestito" članku. Ali, jo&scaron; je to daleko od potupnog razumjevanja. Tema je preobimna, ikako se to gledajući <a href="https://github.com/hernad/CT_pascal/blob/master/hello.pas">hello.pas</a> ne izgleda tako.</p>
<p>Da bi se to postiglo potrebno je puno vježbe "vrteći" se oko ovih i sličnih "hello world" zadataka.</p>
<p>Kako sam u predhodnom članku istakao, komparativna analiza je za Samrin uzrast "advanced" zadatak.</p>
<p>Ukratko, CT projekat, s obzirom na nedovoljna predhodna znanja učenika, je u potpunosti predimenzionisan.</p>
<p>Kada mi je Samra nakon ovih primjera počela tražiti informacije u letu:</p>
<blockquote class="posterous_short_quote">
<p>&Scaron;ta je "scanf", &scaron;ta je cin, cout ? &Scaron;ta je ...&nbsp;</p>
</blockquote>
<p>Počeo sam joj obja&scaron;njavati ali sam je zaustavio:</p>
<blockquote class="posterous_medium_quote">
<p>Samra, ove stvari ne može&scaron; razumijeti u letu. Nemoj mi tražiti da ti diktiram rečenice u radu. Ja, da sam na mjestu tvog profesora, bih ti na takve dijelove koje praktično ne razumije&scaron;, dao NEGATIVNE poene.</p>
<p>U svom radu može&scaron; bez ikakvog ustezanja staviti i ono &scaron;to si pročitala ali nisi razumjela, sa obja&scaron;njenjem za&scaron;to to nisi razumjela.&nbsp;</p>
<p>Ako počne&scaron; pisati tako &scaron;to će&scaron; sa copy-paste skidati stvari sa "Wikipedia"-e degradiraće&scaron; veliki trud koji si uložila.</p>
</blockquote>
<p>Samra je poku&scaron;ala objasniti:</p>
<blockquote class="posterous_short_quote">
<p>Ali ocjena, ali ...</p>
</blockquote>
<p>Zaustavio sam je:</p>
<blockquote class="posterous_short_quote">
<p>Nema &scaron;ta "ali". &Scaron;to si savladala - savladala si. &Scaron;to nisi, nemoj se toga stidjeti ! Nemoj nikada "lupetati" da bi popunila broj znakova u radu !</p>
</blockquote>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Samra je babin ponos</span></strong></span></p>
<p>Koliko god "njanjala", ja sam ponosan na svoju kćerku. Ona je veliki fajter.</p>
<p>Iako sam joj stalno napominjao: "Nemoj misliti samo na ocjenu", ta njena <strong>predanost cilju</strong>&nbsp;je fascinantna.</p>
<p>&Scaron;to se tiče konkretnih rezultata meni je sasvim dovoljan <a href="https://github.com/hernad/CT_pascal/commit/147191c7efc445780ea6a5313228c475d009e30b">"eureka"</a>&nbsp;commit.</p>
<p>Samra definitivno ne čeka karijera informatičara. Međutim, &scaron;ta god ona radila "eureka" će joj pomoći. Ona je tokom dostizanja "eureke" naučila da SAMOSTALNO može rje&scaron;avati nepoznate zadatke. Iz koje oblasti, nebitno. Princip je važan. Sa ispravnim pristupom problemu, čovjek može dostići neslućene granice.</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>h_samra, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>547 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
