<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/pije-li-vode-open-source-erp-software-u-bosni-52055.html">Previous</a>
&nbsp; 
<a href="../../../index-7.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/09/sejtan-i-opensource.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>"Pije li vode" open source ERP software u Bosni ? (prvi dio)</h3>
<div class='post_info'>
<span class='post_time'>October  4 2011, 11:15 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Potpuno mi je jasno da mi u bring.out nismo jedini "genijalci" kojima je palo na pamet da iskoriste postojeća svjetska open source ERP rje&scaron;enja za ponudu na BH trži&scaron;tu.</p>
<p>Međutim, da je to nikako nije i jednostavan posao, kazuje činjenica da na trži&scaron;tu nema takvog rje&scaron;enja.</p>
<p>Klonimo se zabluda: IT biznis baziran na open source software-u nije na kraju ni&scaron;ta drugo do i svaki IT biznis.</p>
<p>IT biznis ovisi o korisnicima. Korisnici trebaju trebaju software koji će zadovoljiti njihove potrebe i zahtjeve.</p>
<p><!--more-->ERP software, poslovni software općeniti, se od drugih softverskih aplikacija razlikuje po tome &scaron;to je <strong>poznavanje poslovnih procesa</strong> od strane IT provajdera must-be. I tu se većina infomatičara "nasanka". Prodaja ERP rje&scaron;enja je zanimljva. Svima naziru da tu ima prostora za zaradu. Ali mnogi ne shvataju da je biti ERP provajder <strong>rudarski posao</strong>.&nbsp;</p>
<p>ERP je po definiciji dinamična materija - zakonska regulativa se stalno mijenja, sam ekonomski prostor je podložan stalnim promjenama. Sve to dovodi do toga da je ERP software uvijek <strong>nedovr&scaron;en</strong>. Da sada ne pretjerujem, njegova bazne funkcije se ne mjenjaju tako često. Ali proizvod u cjelini stalno trpi manje ili veće promjene. Ko to ispusti iz vida može vrlo brzo popiti "gorku pilulu" bio on kupac ERP software-a ili neko ko želi ući u biznis kao ERP provajder.</p>
<p>Rad na implementaciji mnogih od tih promjena su za mnoge informatičare ... dosadne.</p>
<p>Međutim, upravo je način rje&scaron;avanja ovih zahtjeva glavni diferencijator između dobrih i lo&scaron;ih ERP provajdera.</p>
<p>Nakon 15 godina rada u ovom području mi u bring.out smo pro&scaron;li puno toga.&nbsp;</p>
<p>Od toga da su nam govorili kako smo genijalci, da na&scaron;i programi "jedu malu djecu", do toga da nikada gori software nisu vidjeli.</p>
<p>Ali, sada neću razglabati o tomeli na&scaron;a postojeća rje&scaron;enja vrijede ili ne vrijede.&nbsp;</p>
<p>Ovdje ću tragati za odgovorima na sljedeća pitanja:</p>
<ol>
<li>Da li postoji open source software koji se može iskoristiti na bosanskom trži&scaron;tu ?</li>
<li>Ako postoji, i ako postoji mogućnost izbora, koji je su to kriteriji za odabir ?</li>
</ol>
<p>Da se podsjetimo, krajnjeg korisnika interesuju prije svega slijedeće stvari:</p>
<ol>
<li>da li taj software može zadovoljiti njegove sada&scaron;nje i &nbsp;buduće potrebe&nbsp;</li>
<li>koja je cijena kori&scaron;tenja tog software-a&nbsp;</li>
</ol>
<p>Korisnik software-a u konačnici software dijeli na dobar i lo&scaron;, te na onaj koji sebi može priu&scaron;titi ili &nbsp;je preskup za njegov džep. Ukratko nije bitno da li je SAP ili Navision dobar software ako ga sebi ne možete priu&scaron;titi.</p>
<p>Znači, korisnici software ne dijele na open source i closed source. <span style="color: #ff0000;"><strong>Njih te stvari ne interesuju</strong></span>.</p>
<p>Neupućeni u ovu temu povezuju open source software sa softwarem čija je cijena = 0. Međutim, ta konstatacija je potpuno pogre&scaron;na.</p>
<p>Svaki software ima cijenu kori&scaron;tenja. Open source takođe. Open source rje&scaron;enje može biti duplo skuplje od konkurentskog zatvorenog proizvoda.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Matematika cijena</strong></span></p>
<p>Evo jednostavne matematike</p>
<p>Provajder 1 nudi ERP 1 koji je open source na sljedeći način:</p>
<ul>
<li>Licence za kori&scaron;tenje 0 KM</li>
<li>Usluga pripreme podataka za novu poslovnu godinu 500 KM</li>
<li>Tro&scaron;kovi mjesečna podr&scaron;ke za 10 radnih mjesta 10 x 45 = 450 KM/mjes</li>
<li>Tro&scaron;kovi nadogradnji u slučaju zakonskih promjena nisu uračunati u tekuće tro&scaron;kove</li>
</ul>
<p>U toku godine su bile dvije zakonske nadogradnje, ukupni tro&scaron;kovi 1000 KM.</p>
<p>Godi&scaron;nji tro&scaron;kovi su OSS ERP 1: &nbsp;500 + 450 * 12 + 1000 = <em><strong>6900 KM</strong></em></p>
<p>Provajder 2 nudi ERP 2 koji je vlasnički - zatvoreni software:</p>
<ul>
<li>Licence za kori&scaron;tenje 200 KM/radnom mjestu godi&scaron;nje</li>
<li>Usluga pripreme podataka za novu poslovnu godinu 250 KM</li>
<li>Tro&scaron;kovi mjesečna podr&scaron;ke za 10 radnih mjesta 30 x 100 = 300 KM/mjes</li>
<li>Tro&scaron;kovi nadogradnji u slučaju zakonskih promjena uračunati u tekuće tro&scaron;kove</li>
</ul>
<p>Godi&scaron;nji tro&scaron;kovi ERP 2:&nbsp;200 * 10 + 250 + 300 * 12 = <em><strong>5850 KM</strong></em></p>
<p>Očekivano, znatno veći tro&scaron;kovi tekuće podr&scaron;ke su eliminisali prednost OSS ERP-a ERP-1 u odnosu na ERP-2.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Integralna matematika</strong></span></p>
<p>Međutim, da bi se analizirala prednost pojedinačnih ponuda moraju se uzeti u obzir i sljedeći parametri:</p>
<ol>
<li>Da li su tro&scaron;kovi infrastrukture značajno različiti kod ERP-1 i ERP-2 ?</li>
<li>Kakav je kvalitet i brzina servisne podr&scaron;ke pojedinih provajera ?</li>
<li>Kakva je sposobnost i spremnost provajdera da odgovore na specifične zahtjeve klijenata ?</li>
<li>Da li, ako sa njom nismo zadovoljni, možemo promijeniti firmu koja nam daje IT podr&scaron;ku, a da pri tome sačuvamo postojeće programsko rje&scaron;enje ?</li>
<li>Da li za potrebe realizacije određenih zahtjeva možemo "miksati" IT provajdere (tekuća podr&scaron;ka ERP-1 provajder-1, nadogradnja - izrada novih funkcija ERP-1 neki drugi provajder koji takođe radi razvoj baziran na ERP-1 rje&scaron;enjima)</li>
</ol>
<p>Tek kada se sva ova pitanja uzmu u obzir dolazimo do <strong>integralne slike o karakteristikama i tro&scaron;kovima određenog ERP rje&scaron;enja</strong>.</p>
<p>Vođen ovim pitanjima, te činjenicom da je BH trži&scaron;te malo, ovo je potencijal koji mi vidimo u OSS ERP rje&scaron;enjima:&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>1) Infrastruktura</strong></span></p>
<p>Open source software se u pravilu može koristiti na vi&scaron;e operativnih sistema, na različitim database serverima. Mogućnost izbora po ovim pitanjima, posebno kod većih instalacija daje ogroman manevarski prostor ERP provajderu.</p>
<p>Na 50-tak radnih mjesta + aplikacijski server tro&scaron;kovi za licence čine 20-tak hiljada KM. Na to sve dodatno idu tro&scaron;kovi instalacije i konfiguracije. Open source vendor svoju kalkulaciju ne opterećuje licencama.</p>
<p><span style="text-decoration: underline;"><strong>2) Kvalitet podr&scaron;ke</strong></span></p>
<p>Sama podr&scaron;ka je limitirana tehničkim karakteristikama software-a. Ona nikada ne može u cjelosti kompenzirati tehničke nedostatke. Međutim, open source software omogućava da se u proces analize i ispravke pogre&scaron;aka svi zainteresovani puno lak&scaron;e i AKTIVNIJE uključe.</p>
<p>Jaka zajednica korisnika i developera daje OSS software-u potencijal koje zatvoreni software te&scaron;ko može postići.</p>
<p><span style="text-decoration: underline;"><strong>4) Specifični zahtjevi klijenata</strong></span></p>
<p>Za razliku od aplikacija kao &scaron;to je npr. tekst procesor, broj opcija i varijanit kori&scaron;tenja tih opcija kod ERP software-a je puno veći.</p>
<p>To održavanju takvog sistema daje kompleksnost koja u toku eksploatacije software-a može postati ključni problem za korisnike ERP software-a.</p>
<p>Investicije u realizaciju takvih zahtjeva na malom trži&scaron;tu bivaju znatno veće. Razlog je jednostavan: Ako IT vendor to &scaron;to je napravio za jednog klijenta ne može plasirati kod velikog broja drugih klijenata, on će sve tro&scaron;kove "privaliti" primarnom naručiocu.</p>
<p>Zato je kod korisnika ERP software-a veoma česta konstatacija da njihov ERP software ne radi puno toga &scaron;to im treba, ali im njihov ERP vendor to ne može po razumnoj cijeni (ili ikako) ponuditi.</p>
<p>Mi smo sa na&scaron;im kupcima kao lokalni vendor zatvorenih rje&scaron;enja veoma često dolazili u takve situacije.</p>
<p>Po nama, jedini izlaz iz takve situacije na malom trži&scaron;tu kao &scaron;to je bosansko jeste upravo koncept open source zajednica: Eko sistema - zajednice korisnika i developera ERP rje&scaron;enja koje će sarađivati na istoj OSS ERP platformi.</p>
<p>Platfoma koju će svi slobodno koristiti. Unapređenje te platforme će takođe biti u zajedničkom interesu.&nbsp;</p>
<p><span style="text-decoration: underline; color: #ff0000;"><strong>Osnova diferencijacije pojedinih vendora biće ekspertiza u implementaciji i podr&scaron;ci ERP rje&scaron;enja a ne u vlasni&scaron;tvu nad platformom.</strong></span></p>
<p><span style="text-decoration: underline;"><strong>5) "Miksanje" različitih vendora</strong></span></p>
<p>Pored mogućnosti izbora koja se korisniku pruža ovim konceptom, pojavljuju se i opcije da korisnik za veće poslove anagažuje vi&scaron;e vendora koji koriste istu OSS ERP platformu.</p>
<p>Takođe, vendori se jednostavno mogu udruživati u većim poslovima. OSS platforma značajno olak&scaron;ava i pospje&scaron;uje poslovnu saradnju različitih vendora.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Gotov uvod :)</strong></span></p>
<p>Nakon ovog gigantskog uvoda koji obja&scaron;njava ZA&Scaron;TO smo usmjereni na OSS software, dolazimo do tačke u kojoj prelazimo na traganje za OSS software-om koji može biti osnova DOBROG ERP rje&scaron;enja u Bosni.</p>
<p>Tragajući za odgovorima na ova pitanja po internetu, na&scaron;ao sam samo "analize" (review) i "analitičarime" (reviewer) koje pripadaju jednoj od ovih grupa:</p>
<ol>
<li>analitičaru fali znanja i iskustava iz oblasti ERP-a. Bez dobrog poznavanja domena software-a ne mogu se davati valjane kvalifikacije</li>
<li>analitičar već pripada određenoj zajedici, tako glorificiraju sopstveno, krajnje subjektivno govore o drugim rje&scaron;enjima</li>
<li>analitičar je povr&scaron;no pro&scaron;ao osnovne operacije (instalacija, nekakve najosnovnije - hello world operacije) rje&scaron;enja o koji su predmet analize tako da su njihove ocjene uopćene, ili po sistemu "gatanja" (ova funkcija postoji - nije bitno &scaron;to to postoji bitno je kako to fukcioni&scaron;e). Ishod je da takve analize i kvalifikacije nemaju potrebnu težinu.</li>
</ol>
<p>Nažalost, moram reći da će i moj daljni tekst biti pun zaključaka i konstatacija koje se uklapaju u jednu od gornjih kategorija.</p>
<p>Svjestan da daljnjem tekstu definitivno fali sistematičnost, vi&scaron;e vremena utro&scaron;enog na testiranje konkretnih rje&scaron;enja. Međutim, vremena nemam, tako da će čitalac biti osuđen na ono se može nazvati "ocjene po sopstvenom feeling-u".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kriteriji</strong></span></p>
<p>Kod svakog odabira je bitno utvrditi kriterije i ponder kriterija za odabir. Ovo su bitni kriteriji koje sam ja tokom traganja za optimalnim OSS ERP rje&scaron;enjem identificirao:</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K1) Licenca</strong></span></p>
<p>Osnovna podjela licenci je na "strong copyleft" i "weak copyleft" licence. Predstavnik ovih prvih je GPL familija licenci: GPLv2, GPLv3, AGPLv3.&nbsp;</p>
<p>One su takve da zahtjevaju od korisnika GPL licenciranog koda da sve modifikacije i nova rje&scaron;enja u kojima se koristi GPL software takođe objavljuju kao GPL software. Zato ih mnogi zovu "viroznim" jer se GPL licenca prenosi i na novi software (u licencama se taj software najče&scaron;će naziva "larger works based on subject of license") koje se koristi GPL licenciranim software-om.</p>
<p>Druga grupa je ona koja omogućava da se postojeći software "mije&scaron;a" sa novim software-om pri čemu taj novi software autor može licencirati kako god želi - pod istom licencom ili čak kao zatvoreni software. Toj grupi pripadaju MPL i MPL bazirane licence. Takav je i CPAL koji mi koristimo.</p>
<p>Jedino ograničenje je da se modifikacije postojećeg software-a moraju objavljivati pod istom licencom, znači kao OSS software.</p>
<p>Weak copyleft se smatra puno popularnijim za kompanije, znači za komercijalnu upotrebu. Izdavanjem software-a pod nekom weak copyleft licencom omogućava firmi se za&scaron;titi od konkurencije. Ako konkurentska firma uzme va&scaron; OSS software licenciran na takav način, sve modifikacije koje napravi na va&scaron;em software-u ona mora objaviti. Ta firma se pojavljuje kao partner - saradnik (Contributor) na va&scaron;em projektu.</p>
<p>Sav dodatni software (larger works) međutim partneri mogu objaviti pod licencom koju žele, ili ga uop&scaron;te ne objaviti - proizvoditi kao zatvoreni software.</p>
<p>Treba tu jo&scaron; dodati i treću kategoriju licenci koje su kranje liberalne (kao npr. MIT). Njihovo kori&scaron;tenje se svodi na to autori dozvoljavaju kori&scaron;tenje i modifikaciju tog software-a bez ikakvog ograničenja kako po pitanju modifikacije tako i za novi software (larger works).</p>
<p>Mnoge developer oriented biblioteke (library) i developerske platforme (developer framework) su upravo ovako licencirani. Tako su npr. licencirani ruby, ruby on rails framework.&nbsp;&nbsp;</p>
<p>Za kraj treba dodati i dual license politiku (ili multiple license). Autor može kod licencirati kao MPL i GPL licenciran kod. Na taj način će primalac software-a u daljnjem kori&scaron;tenju aktivirati jednu od raspoloživih licenci ili zadržati vi&scaron;estruko licenciranje.</p>
<p>Koji će se model licenciranja odabrati zavisi od toga &scaron;ta su glavni ciljevi autora.</p>
<p>Ako je to želja da se njegov sourc kod &scaron;to vi&scaron;e koristi koriste se licence kao &scaron;to su MIT. Ako autor želi da se njegov software ne može iskoristiti za zatvorena rje&scaron;enja - vlasnički sofware (proprietary software) onda se koriste GPL-like licence. Komercijalni vendori najče&scaron;će idu na MPL-like licence. &nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K2) Community - zajednica korisnika i developera</strong></span>,</p>
<p>Software bez korisnika je mrtvo slovo na papiru. Zato je ra&scaron;irenost software-a kod korisnika jedan od ključnih pokazatelja kvaliteta tog software-a. Pored toga, software koje ima jaku zajednicu se ne može tako lahko "ugasiti".</p>
<p>U slučaju autor iz bilo kojih razloga odstupi od OSS projekta, ako postoji jaka i "zdrava" zajednica korisnika, izvjesno je da će se projekat nastaviti svoj život.</p>
<p>Takođe, ako se radi o firmi koja iz svojih korporativnih razloga napusti open source razvoj, jak community će nastaviti OSS razvoj.</p>
<p>Ukratko, ako postoji dovoljan broj onih koji su svoju energiju i vrijeme investirali u open source software, ako se taj software koristi, za njega "nema zime".</p>
<p>On u svom životnom vijeku može doživljeti razne metamorfoze (spajanje sa drugim projektima, razbijanje na vi&scaron;e manjih ...) ali u su&scaron;tini, ono &scaron;to je najbitnije - trud uložen u njega neće propasti kao &scaron;to se to u sličnim situacija sa zatvorenim software-om de&scaron;ava.</p>
<p><strong><span style="font-size: medium;">K2.1) Enterprise support - firma(e) koja stoji iza software-a</span></strong></p>
<p>U poslovnom software-u nema prostora za čisti volonterizam. Zato je razvoj OSS ERP software-a redovno finansiran od jedne ili vi&scaron;e firmi.</p>
<p>Takođe postoji opcija da firma svoj postojeći zatvoreni software otvori - "opensorsira".</p>
<p>Bez obzira koja od varijanti je inicirala OSS ERP projekat, bitno pona&scaron;anje autora, odnosno tih "glavnih igrača" unutar "community"-ja.</p>
<p>Ukoliko se sav razvoj de&scaron;ava unutar firme originalnog autora, onda su pozitivni efekti djelovanja veće zajednice značajno umanjeni, a sam projekat gubi kredibilitet istinskog otvoreno projekta.</p>
<p>U tom slučaju imamo projekat sa otvorenim source kodom je u samom procesu razvoja&nbsp;<strong>zatvoren</strong>.&nbsp;&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K3) Klijentske reference, period razvoja</strong></span></p>
<p>Reference u kori&scaron;tenju ERP software-a (pri čemu se isključivo misli na korisnike koji ERP koriste u <span style="text-decoration: underline;">realnom poslovnom okruženju</span>) i period razvoja su značajni parametri kvaliteta i kredibiliteta svakog proizvoda.&nbsp;</p>
<p>U slučaju ERP software-a treba imati na umu dvije stvari:</p>
<p><span style="text-decoration: underline;">a) Pozitivni efekti dugogodi&scaron;njeg razvoja</span></p>
<p>Pozitivno je značenje to &scaron;to je u software-u koji je dugo na trži&scaron;tu integrisano značajno iskustvu onih koji su taj software instalirali i obezbjeđivali podr&scaron;ku za njega - IT vendora.</p>
<p><span style="text-decoration: underline;">b) Mogući negativni efekti</span></p>
<p>Dug period razvoja može imati i jake negativne konotacije.</p>
<p>Tokom vi&scaron;egodi&scaron;njih nadogradnji ERP software sa stanovi&scaron;ta razvoja može postati nepregledna &scaron;uma. Ako se razvojni time ne drži određenih principa po pitanju developerskih tehnologija (obavezno dokumentovanje, TDD/BDD, code refactoring) source kode postane vrlo brzo labirint u kome se samo rijetki mogu snaći.</p>
<p>IT industrija, odnosno industrija razvoja software-a je jedna od najdinamičnijih. Programerski alati i tehnologije se mjenjaju u ciklusima od cca 5 godina.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K4) Bazne tehnologije i alati</strong></span></p>
<p>Tako recimo prije 5 godina razvoj aplikacija za mobilne platforme u poređenju sa dana&scaron;njim stanjem gotovo da i nije postojao. Slično je sa trendom web-izacije rje&scaron;enja.</p>
<p>Iz tih razloga kompetencije developera koje su potrebne za razvoj rje&scaron;enja koja su konkurentna na dana&scaron;njem IT trži&scaron;tu se značajno mijenjaju.</p>
<p>Kada sam se ja počeo baviti programiranjem - ratnih 90-tih, računarske mreže su bile rijetkost. U toku je bio proces okrupnjavanja vendora (ga&scaron;enja malih koje su kupovale "velike ribe"). Era otvorenog software-a jo&scaron; nije počela, pogotovo ne u ratom zatvorenoj Bosni.</p>
<p>U to vrijeme, "Clipper" programski alat je bio najproduktivnije i najpopularnije programsko okruženje za domen poslovnih aplikacija na PC-u.</p>
<p>Međutim, nakon par lo&scaron;ih akvizicija (naravno sa stavni&scaron;ta "Clipper" korisnika) taj, &nbsp;u to vrijeme sjajan developerski proizvod, je oti&scaron;ao u stagnaciju, da bi na kraju zavr&scaron;io u muzeju IT-a.&nbsp;</p>
<p>Koliko je odabir baznih tehnologija i alata bitan, mi smo nažalost osjetili na svojoj koži.</p>
<p>Zato je kod odabira baznih alata za razvoj u bring.out prvi i eliminirajući faktor: open source software, sa jakom korisničkom zajednicom.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K4.1) Prevod i lokalizacija</strong></span></p>
<p>Prevod je najče&scaron;će jednostavna stvar. &nbsp;Koriste se alati kao &scaron;to je gnutext ili qtLinguist. I tu se nema puno filozofile. OSS software generalno ima dobru podr&scaron;ku za vi&scaron;ejezičnu podr&scaron;ku.</p>
<p>Kod lokalizacije imamo vi&scaron;e "začkoljica". Lokalizacija se de&scaron;ava na tri nivoa:</p>
<ol>
<li>podr&scaron;ka formata brojeva, oznaka u kalendaru je primarna lokalizacija. I tu uz manje varijante imamo uglavnom dobru podr&scaron;ku</li>
<li>podr&scaron;ka na&scaron;im diakrticima - UTF-8 kodni standard za znakove često znabiti problem u reporting dijelu (fontovi u pdf dokumentima).&nbsp;</li>
<li>podr&scaron;ka na aplikativnom nivou. Idealno bi bilo sve funkcije - algoritme koji su ovisni o zakonskoj legislativi izdvojiti kao module koji se moguprilagoditi za određenu državu. &nbsp;</li>
</ol>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K4.2) Programski jezik(ci)</strong></span></p>
<p>Kori&scaron;tenje i poznavanje programerskog jezika samo po sebi ni&scaron;ta ne kazuje. "Java programer", "C# programer" u dana&scaron;njem svijetu software developmenta nije dovoljno da bi odredilo kompetencije developera.</p>
<p>Dobar developer je puno vi&scaron;e od nekoga ko zna sintaksu određenog programskog jezika. On je sposoban na osnovu određenog funkcionalnog zahtjeva sa alatima koji su mu na raspolaganju doći do traženog rje&scaron;enja. Do optimalnog rje&scaron;enja.&nbsp;</p>
<p>Optimalno rje&scaron;enje je ono do koga se dolazi za najkraće moguće vrijeme, sa minimalnim brojem bug-ova, sa mogućnosti da se i drugi bez problema uključe u održavanje i nadograndju tog source koda.</p>
<p>Koliko god ovi generalni principi bili neovisni o programskom jeziku, treba paziti na dimenziju problema "overload"-a programskim jezicima i tehnologijama&nbsp;</p>
<p>Rad u projektu sastavljenog od komponenti sa puno programskih jezika i različitim tehnologija značajno "tro&scaron;i" developera. Ovaj problem nije značajan ako postoji jasna podjela posla, koju je moguće napraviti u velikim programerskim timovima.&nbsp;</p>
<p>Međutim, u malim timovima kakav je slučaj sa bring.out dimenzija overload-a različitih programskih jezika može biti od presudnog značaja za produktivnost razvoja. &nbsp;</p>
<p>Kada se uzme u obzir da je na bosanskom trži&scaron;tu najrealnije očekivati da se oko OSS projekta stvori zajednica od sastavljena upravo od takvih malih timova i pojedinaca, izbjegavanje "overload"-a programskim jezikom je bitna stvar.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K4.3) Jednosavnost instalacije (software deployment)</strong></span></p>
<p>Nakon &scaron;to se proizvede, software se mora instalirati. Instalacija software-a u produkcijsko okruženje (software deploymnet) je operacija koja sa mora biti &scaron;to jednostavnija sa stanovi&scaron;ta vremena i osposobljenosti servisnog osoblja. Zato je veoma bitno kod odabira baznih tehnologija odabrati komponente koje su nam na ciljnim sistemima (target operating system) jednostavno dostupne.</p>
<p><span style="text-decoration: underline;"><strong>out-of-box experience</strong></span></p>
<p>Činjenica da se PostgreSQL na ubuntu/linux-u instalira sa <a href="https://help.ubuntu.com/community/PostgreSQL">sudo apt-get install postgresql</a>&nbsp;i da se taj paket nalazi u glavnom ubuntu repozitoriju (&scaron;to sa sobom povlači činjenicu da se vendor OS-a stara o security update-ima) nije nebitna. Dapače.&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>Organizacija software-a</strong></span></p>
<p><span style="text-decoration: underline;"><strong>&nbsp;</strong></span>Organizacija software-a je takođe bitna za "installation experience". Ako i kod najmanje promjene na software-u moramo na klijentske ma&scaron;ine download-ovati i instalirati 100 MB-a software-a, to na većem broju klijenata postaje ozbiljan problem.</p>
<p>Razbijanje monolitnog sistema na manje komponente omogućava da se u slučaju manjih nadogradnji (minor update) isporučuju samo komponente kod kojih su se desile promjene.</p>
<p>Činjenica da su kod web baziranih klijenata tro&scaron;kovi instalacije nove verzije minimalni jedan je od bitnih faktora njihove popularnosti.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K5) Developerske metodologija, preporučene prakse</strong></span></p>
<p>Čitljivost, odnosno dokumentovanje koda bez dvojbe spada u developersku praksu koja se u projektu primjenjuje manje ili vi&scaron;e dosljedno.&nbsp;</p>
<p>Pored toga, imamo niz stvari koje utiču na kvalitet i prihvaćenost projekta od strane &scaron;ireg auditorija.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K5.1) Source code management - github</strong></span></p>
<p>Kada je prije 5-6 godina, Linus napravio "git" source code management alat, te&scaron;ko da mu je palo na pamet da će neko ideju kolaboracije u software developmentu aplicirati na na čin kako je to učinjeno sa github-om <a href="http://github.com">http://github.com</a>.</p>
<p>Github je definitivno broj jednan servis po popularnosti na polju online source code repozitorija.</p>
<p>Ono &scaron;to je github učinilo posebnim jeste njegova posvećenost cilju kolaboracije i jednostavne komunikacije među developerima.</p>
<p>Iako je github plaćeni servis ukoliko želite imati na njemu privatne repozitorije, on je za par godina uzeo nevjerovatan mind-share developera.</p>
<p>Svakodnevnim dodavanjem novih servisa, slu&scaron;anjem zahtjeva korisnika, friendly pristupom prema OSS developerima, github je postao puno vi&scaron;e o online source code repozitorija - on je postao mjesto na kome developeri razgovaraju. I to na najprirodniji način - putem source koda.</p>
<p>Koliko je odabir ovakvog servisa bitan za jedan OSS projekat, govori činjenica da postoji masovni trend migracije projekata na github.&nbsp;</p>
<p>On je posto mjesto gdje je vidljivost projekta najveća, mjesto na kome se najlak&scaron;e uključiti u projekte drugih kao posmatrač ili kao aktivni učesnik.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K5.2) "Čitljivost" za nove developere, jednostavnost kolaboracije u polju razvoja</strong></span></p>
<p>Čitljivost za developera prije svega predstavlja dobro organizovan source-code, odgovarajuću dokumentaciju baze podataka, postojanje developerskih cookbok-ova za odgovarajuće česte nadogradnje.</p>
<p>OSS software koji je jednostavno izbacio source kod bez odgovarajuće dokumentacije nema veliku vrijednost.</p>
<p>Ako je u tom smislu kod nedostupan, džaba &scaron;to je otvoren. Niko se neće zahmetiti da čita tuđe "hijeroglife". &nbsp;</p>
<p>Iz tog razloga smo mi odmah u startu posvetili pažnju ovom aspektu projekta, koristeći&nbsp;<a href="http://redmine.bring.out.ba/issues/24494">docco</a>&nbsp;&nbsp;i<a href="http://redmine.bring.out.ba/issues/24669">github pages</a>:</p>
<ul>
<li><a href="http://knowhow.github.com/A4_knowhow/">http://knowhow.github.com/A4_knowhow/</a></li>
<li><a href="http://knowhow.github.com/M3_knowhow/">http://knowhow.github.com/M3_knowhow/</a></li>
</ul>
<p>Da bi se source kod ovako ustrojio, i &scaron;to je jo&scaron; bitnije da bi se on redovno održavao na ovakav načinu, potrebno je uložiti značajne napore.</p>
<p>Dokumentacija je generalno jedna od standardnih software projekata. Stvari se međutim mijenjaju, novi trendovi u software developmentu ovom aspektu posvećuju značajnu pažnju.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K5.3) TDD Test driven development, BDD Behaviour driven development</strong></span></p>
<p>Ovo je jedna stavka u metodologiji projekta koju lično smatram veoma bitnom. TDD i BDD su dvije srodne i komplementarne metodologije.&nbsp;</p>
<p>Svode se na to da se prilikom pisanja software-a pi&scaron;u unit testovi (TDD) koji ispituju pona&scaron;anje odgovarajućih klasa odnosno dijelova koda. BDD kao predmet testiranja uzima određene funkcionalne cijeline koje redovno pokrivanju *interakciju* vi&scaron;e klasa. BDD testovi se zato zovu integracijski testovi jer pokazuju rezultate integracije vi&scaron;e klasa.</p>
<p>Projekat koji je dobro pokriven TDD/BDD testovima omogućava preventivno lociranje gre&scaron;aka.&nbsp;</p>
<p>Svaki developer dobro zna da svaka njegova promjena sa sobom potencijalno nosi side-efekat generacije nekog novog bug-a. Testovima se takve gre&scaron;ke mogu locirati u developerskom okruženju, znači prije nego li &scaron;to nova (bugovita) verzija software-a dođe do krajnjeg korisnika.</p>
<p>O prednostima ovog ranog otkrivanja gre&scaron;aka suvi&scaron;no je govoriti. Međutim, samo uspostavljanje kvalitenog test sistema je veoma zahtjevan proces.</p>
<p>Mnogi projekti ili nemaju ili imaju samo djelimično test-covered source code.</p>
<p>Ovaj sindrom je posebno kod starijih projekata prisutan. Mahom tek mlađe generacije developera TDD/BDD primjenjuju u punom kapacitetu u svojim projektima.</p>
<p>Međutim, nije rijetkost da se uviđa pozitivan uticaj primjene TDD/BDD-a, tako da se ulažu značajni napori da se source kod naknadno počinje pokrivati testovima, te da se za novi kod forsira potpuna pokrivenost koda testovima.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K5.4) "Cool" alati&nbsp;</strong></span></p>
<p>Pored pragmatičnih i praktičnih faktora u odabiru programskih jezika i tehnologija, postoji i ne&scaron;to &scaron;to je manje pragmatično ali je ipak bitno za motivaciju developera. To su "coolness" tehnologija koje se koriste.</p>
<p>Web je "cool". Mobilne tehnologije su "cool". Pravljenje rje&scaron;enja koje će se moći instalirati na cool uređaje i cool infrastrukturu sigurno je faktor koji privlači kako krajnje korisnike tako i developere u jedan OSS projekat.</p>
<p>Mislim da smo u knowhow ERP odabirom titanium appcelerator-a, node.js-a i javascript-a kao univerzalnog jezika za sve ove platforme napravili dobar korak.</p>
<p>Da. to na&scaron; razvoj i nas kao developera čini da budemo "cool" i "trendi" :). Međutim, već do sada smo osjetili niz krajnje praktičnih pozitivnih konsekvenci tog odabira.</p>
<p>Ove tehnologije okupljaju veliki broj talentovanih developera (englezi kažu "vibrant" community ... ne znam kako bih ovo na bosanski preveo ... a definitivno najbolje izražava ono &scaron;to želim reći) omogućila nam je da "googlanjem" za tren dođemo do rje&scaron;enja kada negdje zapnemo.&nbsp;</p>
<p>Nova generacija developera bez ustezanja svoja iskustva dijeli sa drugima. Čak i pasivno uče&scaron;će u toj zajednici ima na na&scaron; rad pozitivan feedback.</p>
<p>Sa pozicije developera u poznim godinama, mislim da je sjajna stvar učiti od tih mladih ljudi. Sve to generi&scaron;e dodatne poticaje, vraća izazove u na&scaron; posao, izbija nas iz kolotečnine, tjera nas refresh i sopstvenih vje&scaron;tina i rethink ustaljenjog načina rada. Sve ovo tjera nas da da razmi&scaron;ljamo. Da budemo vi&scaron;e kreativni, a manje ne&scaron;to inteligentniji daktilografi koji kucaju ono &scaron;to su nekada naučili i kako su ranije navikli.</p>
<p>Ukratko na ovaj način se integriramo u software development 21. vijeka.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K6) Način komercijalizacije ERP software-a</strong></span></p>
<p>ERP software je suvi&scaron;e dosadan da bi ga tamo neki volonteri razvijali :).</p>
<p>Informatičari se "osipaju" na pomen termina kao &scaron;to su zaliha u magacinu i prodavnice, konto duguje/potražuje, cjenovnik, kontni plan ...</p>
<p>Nisam čuo za nekoga ko te stvari pravi zato &scaron;to mu se sviđa praviti takav software. Ako ste vi čuli, recite mi :)</p>
<p>Pa ako je tako, da li je OSS ERP software utopija ? Nije.</p>
<p>Otvoreni software u ERP-u obezbjeđuje jeftinije i kvalitetniju razmjenu ideja i mogućnosti pravljenja kompleksnijih rje&scaron;enja do kojih pojedinačni timovi developera samostalno ne bi mogli doći.</p>
<p>S obzirom da imamo i primjere otvaranja do tada in-house proprietary ERP software-a, jasno je da se OSS ERP software može komercijalizirati.&nbsp;</p>
<p>Odgovor je krajnje jednostavan: izvorni kod (source code) sam za sebe ni&scaron;ta ne predstavlja. Potrebni su resursi - ljudi i znanje koji će taj kod staviti u funkciju.&nbsp;</p>
<p>Ovo su glavni modeli komercijalizacije koje sam ja uočio:</p>
<p><span style="text-decoration: underline;"><strong>a) Community verzija je OSS software, dok su "enterprise" verzije zatvoreni software</strong></span></p>
<p>U ovoj varijanti, community verzija ima funkciju "open source marketinga" (&scaron;to je u svijetu jako marketin&scaron;ko oružje, kod nas i nije s obzirom na veliku stopu piratstva), ali se iz te zajednice korisnika regrutuju novi plaćeni korisnici, kada im "community" verzija postane nedovoljna.</p>
<p>U community verziji mnoge napredne funkcije nedostaju ili postoje vje&scaron;tačka (a ne tehnička) ograničenja - "oklja&scaron;trene" funkcije.&nbsp;</p>
<p><span style="text-decoration: underline;"><strong>b) Određene funkcije vezane za periodično održavanje su onemogućene cummunity version korisnicima</strong></span></p>
<p>Iako je ovo veoma slično modelu a), može u praksi predstavljati bitnu razliku.&nbsp;</p>
<p>Ovdje se de&scaron;ava "zamka" za korisnika u toku sljedećeg scenarija:</p>
<p>Korisnik koristi software sa svim njegovim funkcijama godinu-dvije. Nakon objavljivanja nove verzije korisnik, ukoliko želi migrirati podatke na novu verziju, mora kupiti enterprise verziju da bi izvr&scaron;io prenos podataka.</p>
<p>Naravno on može instalirati praznu novu "community" verziju, unijeti podatke ručno, napraviti sopstvene migracijske skripte ...&nbsp;</p>
<p>Ova opcija je, moja je procjena, u stvari prije svega ciljana prema <strong>eliminaciji konkurentnosti i samostalnosti drugih IT provajdera</strong>. Ovo im značajno otežava mogućnost da svojim korisnicima open source - "community" verzije !&nbsp;</p>
<p>Ovakvu strategiju sam uočio kod OpenERP S.A - vidi <a href="http://www.openerp.com/catalog ">verzije</a>&nbsp;te detalje uslova kori&scaron;tenja njihovoh&nbsp;<a href="http://www.openerp.com/services/faq-onsite">migration servisa</a>.</p>
<p><span style="text-decoration: underline;"><strong>c) Konsultantske usluge prema partnerima</strong></span></p>
<p>Integratori ERP rje&scaron;enja - firme koje nude ERP rje&scaron;enja kranjim korisnicima mogu biti jaka ciljna grupa za autore OSS ERP rje&scaron;enja.</p>
<p>Kroz funkcionalne i developerske treninge i godi&scaron;nje ugovore firme - vlasnici OSS software-a (ali to mogu biti i druge firme koje su prepoznate kao veliki poznavaoci software-a, ne moraju biti samo vlasnici licence - copyright holderi) stiču značanje prihode</p>
<p><span style="text-decoration: underline;"><strong>d) Konsultanske usluge i obuka kranjih korisnika</strong></span></p>
<p>Ovdje imamo prihode od treninga krajnjih korisnika i prodaje korisničke literature.</p>
<ol> </ol>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K7) Funkcionalne karakteristike</strong></span></p>
<p>Osnovne funkcionalne karaktistike su ono &scaron;to nam OSS ERP software out-of-box nudi.&nbsp;</p>
<p>Tu imamo dva nivoa:</p>
<p><span style="text-decoration: underline;"><strong>1) Glavne funkcije (base domain functions)</strong></span></p>
<p>Nivo podr&scaron;ke proizvodnji, podr&scaron;ka accounting-u, CRM podr&scaron;ka, maloprodaja (retail), veleprodaja, razrada poreznog sistema, podržane vrste transakcija i dokumenata</p>
<p><span style="text-decoration: underline;"><strong>2) Bazne, generičke funkcije (common/base functions, configuration, master data)</strong></span></p>
<p>Ovdje spadaju generičke funkcije kao &scaron;to su:</p>
<ul>
<li>sistem za&scaron;ite</li>
<li>mogućnost (jednostavnost) pode&scaron;enja workflow-a na nivou korisnika</li>
<li>generalni pristup prilagodbi software-a za pojedinačne primjene i pojedinačne korisnike.</li>
</ul>
<p>Naravno, &scaron;to vi&scaron;e toga imamo out-of-box manje trebamo sami implementirati. Ali, ako su te funkcije jedna "&scaron;uma" u kojoj se te&scaron;ko snaći, nismo puno dobili ... Zato slijedi sljedeća karakteristika</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K7.1) Inituitivnost korisničkog interfejsa</strong></span></p>
<p>OSS ERP aplikacije koje su bile predmet mog proučavanja su bile veoma različite u smislu koncepta korisničkog interfejsa. Mnoga od rje&scaron;enja su imale generički pristup unosu podataka &scaron;to u mnogim slučajevima stvara krajnje neintuitivan korisnički interfejs.</p>
<p>Ako ja kao IT profesionalac ne mogu bez dokumentacije ni nazrijeti kako unijeti podatke, onda je definitivno pojam korisničkog interfejsa sporna stavka.</p>
<p>Svaki ERP software za ozbiljno kori&scaron;tenje tražiobuku korisnika. Međutim postoji značajan broj operacija koje korisnik moraju biti "nadohvat ruke" bez potrebe da konsultuje dokumentaciju.</p>
<p>ERP software veoma često krasi ružnan i neintuitivnan interefejsom. U raspravama sa korisnicima, autori ERP software-a se brane činjenicom da su "funkcije ispred lickanja", "da to tako mora da izgledati" itd ... Godinama sam i sam bio u tom "filmu" po pitanju ocjena na&scaron;eg software-a.&nbsp;</p>
<p>Sada, sa ovom pameću mislim da bez dobrog korisničkičkog interfejsa nema dobre aplikacije.&nbsp;</p>
<p>Da ne bude nesporazuma: aplikacija sa dobrim korisničkim interfejsom može biti i čista konzolna aplikacija. &nbsp;</p>
<p>Bitan je use-case - kontekst kori&scaron;tenja aplikacije.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>K7.2) Funkcionalna usagla&scaron;enost sa na&scaron;im zakonima i principima računovodstva</strong></span></p>
<p>Iako zadnja, u listi kriterija u odabiru OSS ERP-a, ovo je vjerovatno za na&scaron;e trži&scaron;te jedan od "naj&scaron;kakljivijih" kriterija.</p>
<p>Nijedan od postojećih OSS ERP-ova ne prati na&scaron;u zakonsku regulativu.&nbsp;</p>
<p>Toj zakonskoj regulativi treba dodati i ono &scaron;to bih se najprije moglo nazvati nazvao navikama korisnika i zaostacima iz ranijih metoda vođenja računovodstva.</p>
<p>Tako recimo niti jedan od postojećih programskih rje&scaron;enja ne predviđa vođenje lagera u prodavnicama sa ukalkulisanim porezom.&nbsp;</p>
<p>Nigdje nisam sreo dokumente "zaduženje prodavnice" u kome figuri&scaron;e magacinska cijena bez poreza i maloprodajna cijena sa porezom. Tako nigdje nisam na&scaron;ao ono &scaron;to se kod nas zove "nivelacija cijena u prodavnici". Za&scaron;to ? Zato &scaron;to takav dokument ne postoji.&nbsp;</p>
<p>U tom dijelu prodaje postoje opcije za formiranje cjenovika (price lists) na hiljadu načina. Logično postoje cjenovnici za prodavnicu, za veleprodaju. Postoji podr&scaron;ka za različite algoritme količinskih rabata (quantity price break) ... Ovih na&scaron;ih nivelacije nigdje ni u tragovima :)&nbsp;</p>
<p>Kako god razmislim, ove razlike koje se pred na&scaron; ERP, prezicnije računovodstveni dio ERP-a postavljaju su prevashodno rezultat na&scaron;ih ranijih navika iz ranijih (socijalistički zakoni, porezu na promet itd). Kakav god uzrok bio, to se u određenoj mjeri mora implementirati da bi se software mogao koristiti na na&scaron;em trži&scaron;tu. Koliko i &scaron;ta od toga - tu treba biti pažljiv. Treba nastojati &scaron;to manje funkcija koje nisu prisutne u postojećoj računovodstvenoj i zakonskoj regulativi izbjeći, te poku&scaron;ati maksimalni iskoristiti postojeće funkcije OSS ERP-a.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Eto nas ... na početku</strong></span></p>
<p>Oooouch. Čitav dan mi je trebalo da pobrojim kriterije. Sada napokon mogu dati i svoje ocjene za software koji je bio predmet mojih istraživanja:</p>
<ul>
<li>OpenERP</li>
<li>Adempiere</li>
<li>OpenBravo</li>
<li>xTuple</li>
</ul>
<p>O tome, aBd, slijedi poseban članak.&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, business, erp, it</div>
</div>
<div class='post_responses'>
<h4>Pregleda 443, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici dotadašnjeg posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
