<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/bringout-mahsuz-softwar-baziran-na-knowhow-er.html">Previous</a>
&nbsp; 
<a href="../../../index-6.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/10/open-source-money.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Šta otvoreni model razvoja znači knowhow ERP korisniku ?</h3>
<div class='post_info'>
<span class='post_time'>October 18 2011,  6:44 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><span style="text-decoration: underline; font-size: medium;"><strong>knowhow za krajnjeg korisnika</strong></span></p>
<p>Ovo je nastavak članka <a href="http://hernad.bring.out.ba/open-source-money">OSS &amp; money</a>.</p>
<p>Kako smo ranije rekli, plan je da knowhow ERP bude u potpunosti otvoren software.</p>
<p>Nikakva "community" version.</p>
<p>Mi želimo praviti razlike na mjestu podr&scaron;ke. Software je slobodan. Koristite ga kako želite. Sa nama ili bez nas.</p>
<p>Podr&scaron;ka(*) je mjesto gdje se treba vr&scaron;iti diferencijacija cijena.</p>
<p><!--more-->Korisnik čiji se ERP sistem sastoji od 50 prodajnih mjesta, diskontom i 20 korisnika u LAN-u knjigovodstva će vi&scaron;e plaćati za podr&scaron;ku nego korisnik koji ima jednu prodavnicu, bez obzira &scaron;to koriste identičan software (parametar: <strong>veličina</strong>).</p>
<p>Korisnik koji kroz ERP prati tok proizvodnje će imati veće tro&scaron;kove podr&scaron;ke od korisnika koji se bavi prodajom usluga (parametar: <strong>kompleksnos</strong>t).</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>OSS i specifična programska rje&scaron;enja</strong></span></p>
<p>Danas smo sa jednim na&scaron;im klijentom napravili dogovor za realizaciju programskog rje&scaron;enje koje &nbsp;bi se radilo mahsuz za njih.&nbsp;</p>
<p>Ova rje&scaron;enja su uvijek problematična kod formiranje cijene. Svi tro&scaron;kovi padaju na naručioca iz jednostavnog razloga &scaron;to se takvo rje&scaron;enje ne može značajno dodatno valorizirati kod drugih klijenata.</p>
<p>Kod općih funkcija, koje se mogu prodati većem broju korisnika stvar se može podijeliti na projektovani broj korisnika. Ovdje nema ni&scaron;ta od podjele:</p>
<p>Procjena programer sahata, potrebnog vremena, sve to pomnožiti sa cijenom 1 programer/sahata ... i fljas.</p>
<p>Cifra je uvijek "žestoka". Kako su naručioci takvih poslova u pravilu na&scaron;i najznačajniji klijenti, uvijek se trudim da to ne bude "žara". "Kradem" od cijene programer sahata, ali koliko god da "ukradem" ostane dovoljno da korisnik kaže:</p>
<blockquote class="posterous_short_quote">
<p>Uh, može li to malo "niže" ?&nbsp;</p>
</blockquote>
<p>Može li se &scaron;ta dodatno "ukrasti" kada je osnova za razvoj otvoreni software ?</p>
<p>Najče&scaron;će ne može.</p>
<p><span style="text-decoration: underline;"><span style="color: #ff0000;"><strong>U početnoj fazi razvoja ne može. Ali u fazi daljnje nadogradnje itekako može.</strong></span></span></p>
<p>Evo kako je to moguće.</p>
<p>Firme koje imaju potrebe za ovakvim programskim rje&scaron;enjima netom su veće firme i firme koje se intenzivno razvijaju.</p>
<p><span style="text-decoration: underline;"><strong>Sopstveni IT sektor</strong></span></p>
<p>Njihove potrebe stalno rastu. Uop&scaron;te nije isključeno da će te firme imati IT sektor.</p>
<p>Taj IT sektor može preuzeti ulogu tekuće podr&scaron;ke za svoj namjenski projekat. Iako to na prvi mah izgleda kao lo&scaron;a strategija za nas kao inicijalnog developera, &nbsp;mislim da to nije tačno.</p>
<p>Uvijek se može doći do SLA(*) koji bi bio značajno umanjen u odnosu na standardni, a koji bi predvidio da, u slučaju da lokalni IT ne može rije&scaron;iti samostalno zahtjev, to preuzme inicijani developer.</p>
<p><span style="text-decoration: underline;"><strong>Angažman dodatnih resursa</strong></span></p>
<p>Ako bih opisao najteže trenutke u djelovanju bring.out to su oni u kojima sam do&scaron;ao do tačke da kažem:</p>
<blockquote class="posterous_short_quote">
<p>Ne mogu to isporučiti klijentu !</p>
</blockquote>
<p>Bez obzira da li se radi o nepo&scaron;tivanju ugovora ili novog zahtjeva, ovo je najveći problem za IT provajdera.&nbsp;</p>
<p>Izvjesno je da će&scaron; izgubiti klijenta. Očigledno, u tim situacijama problem nisu pare, nego sposobnost da se u datom vremenu realizuje zahtjev korisnika.</p>
<p><span style="color: #ff0000;"><strong>Mogu slobodno reći da je ovo najjači motiv zbog koga sam "bring.out" vodio u smjeru provajdera otvorenog software-a.</strong></span></p>
<p>Kako otvoreni software može rije&scaron;iti ovaj problem ?</p>
<p>Rije&scaron;iće ga tako &scaron;to ću ja kao provajder unutar otvorenog community-ja puno lak&scaron;e i jeftinije naći partnere sa kojima ću zajedničkim snagama rije&scaron;iti zahtjev klijenta.</p>
<p>Za&scaron;to je to jeftinije nego li partnerski odnos na bazi zatvorenog software-a ?</p>
<p>Zato &scaron;to je jeftinije:</p>
<ol>
<li>Oba partnera okupljena oko otvorenog software-a poznaju platformu na kojoj baziraju posao</li>
<li>zapreke koje stvaraju pitanja "&scaron;ta je moje", "&scaron;ta je tvoje" značajno otežavaju realizaciju projekta.&nbsp;</li>
<li>Dvije firme bez problema mogu funkcionisati kao jedan tim, jer ta iskustva komunikacije imaju kroz "open source" community. &nbsp;Dva odvojena tima koja sarađuju nikada ne mogu postići takvu efikasnost</li>
</ol>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Dobar software</span></strong></span></p>
<p>Na kraju, otvoreni projekat stvara okrućenje za angažman većih resursa.</p>
<p>U razvoju software-a se mnoge stvar rje&scaron;avaju po principu "domino-efekta": &nbsp;jedna pobolj&scaron;ana funkcija utiče na čitav projekat.</p>
<blockquote class="posterous_short_quote">
<p>Meni treba vakav-'nakav eksport, vak'a-'naka funkcija</p>
</blockquote>
<p>Čest odgovor developera je:</p>
<blockquote class="posterous_short_quote">
<p>Uh to mi niko nije tražio. To mi je te&scaron;ko napraviti. A bilo bi i preskupo raditi za jednog klijenta.</p>
</blockquote>
<p>U otvorenom projektu koji ima snažan community, puno je lak&scaron;e naći onoga ko će naći rje&scaron;enje za zahtjev korisnika.</p>
<p>Sve te aktivnosti vode DOBROM software-u.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Rezime</strong></span></p>
<p>Da bi se ove prednosti postigle potrebno je oko projekta formirati snažan i zdrav community.</p>
<p>Zato se i "ubih" pi&scaron;ući o svemu ovome :)</p>
<p>---</p>
<p>(*) bos: Ugovor o podr&scaron;ci, eng: SLA - service level agreement</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>business, b_knowhow, opensource</div>
</div>
<div class='post_responses'>
<h4>329 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>