<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/10/radno-mjesto-u-bringout.html">Previous</a>
&nbsp; 
<a href="../../../index-6.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/10/pije-li-vode-oss-erp-software-u-bosni-openerp.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>A Tribute to Steve Jobs na Sarajevskom Univerzitetu</h3>
<div class='post_info'>
<span class='post_time'>October  8 2011, 12:36 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Juče kažem svojim kolegama na poslu:</p>
<blockquote class="posterous_short_quote">
<p>Ona moja žena je stvarno "lik".&nbsp;</p>
</blockquote>
<p>Sa&scaron;a i Jasko, ... ne znajući o čemu se radi, odmah uzvrati&scaron;e:</p>
<blockquote class="posterous_short_quote">
<p>Sve su žene takve ...</p>
</blockquote>
<p>Međutim, ovo nije priča o vječnom mu&scaron;ko-ženskom nerazumjevanju.</p>
<p>Objasnio sam o čemu se radi:</p>
<blockquote class="posterous_short_quote">
<p>Ona je tokom svog predavanja studentima održala govor o Steve-u Jobsu, i na kraju mu zajedno sa studentima odala počast minutom &scaron;utnje.</p>
</blockquote>
<p>Kada sam to čuo od nje, bio sam zatečen.</p>
<p><!--more--></p>
<blockquote class="posterous_short_quote">
<p>Odakle ti to pade na pamet, molim te ?</p>
</blockquote>
<p>Sva predana bitnosti tog događaja, odgovorila mi je:</p>
<blockquote class="posterous_medium_quote">
<p>Po meni, te&scaron;ko da ima čovjeka koji je ostavio takav trag na na&scaron; život i način života koji živimo. Odaju se počasti političarima. Kako onda ignorisati događaje kao &scaron;to je smrt čovjeka kao &scaron;to je Steve Jobs !?</p>
</blockquote>
<p>Uočio sam kako je taj njen postupak bio tako prirodan ... &nbsp;Bilo mi je tako cool &scaron;to je to učinila. Za razliku od njem, mislim da je komentar mnogih njenih studenata bio:</p>
<blockquote class="posterous_short_quote">
<p>Ja one profesorice Husremović ... gdje joj Steve Jobs pade na pamet. Ona je jarane malo prolupala ...</p>
</blockquote>
<p>Zato sam je pitao:</p>
<blockquote class="posterous_short_quote">
<p>Pa dobro kako su tvoji studenti reagovali ?!</p>
</blockquote>
<p>Dženana je odgovorila:</p>
<blockquote class="posterous_short_quote">
<p>Pa mnogi su bili skroz zatečeni, ali je to mojim najboljim studentima bilo super.</p>
</blockquote>
<p>Kako je kroz moja pitanja shvatila da to &scaron;to je učinila nije najnormalnija i najprirodnija stvar na svijetu nastavila je:</p>
<blockquote class="posterous_short_quote">
<p>Pa dobro, zar misli&scaron; da to nisam trebala učiniti !? Zar misli&scaron; da na jednoj instituciji kakav je Sarajevski Univerzitet ne treba odati počast jednom takvom čovjeku ?</p>
</blockquote>
<p>Bio sam ponosan na Dženanu. Zato &scaron;to je bila iskrena. Zato &scaron;to nije razmi&scaron;ljala o tome "kako će drugi na ovo reagovati". Ona je rekla i učinila ne&scaron;to &scaron;to je smatrala bitnim, bez obzira na moguće reakcije drugih.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Mediokriteti, puna mi vas je kapa !</strong></span></p>
<p>Zato sam na njeno pitanje odgovorio:</p>
<blockquote class="posterous_medium_quote">
<p>Joj, jesi ti "naiva". Ja se mogu kladiti da niko, ama ba&scaron; niko na tvom fakultetu ili bilo kakvoj naučno-obrazovnoj instituciji u Bosni i Hercegovini takvo &scaron;to nije učinio. Niti mu je takvo &scaron;to "u peti bilo".</p>
<p>Mene definitivno ne treba&scaron; pitati da li je trebalo odvojiti 5 minuta predavanja za takvog čovjeka. Super je to &scaron;to si uradila.</p>
</blockquote>
<p>Volio bih da se varam. Volio bih da je moje viđenje stanje nauke i obrazovanja, koje se može svesti na riječi "dno-dna", u BiH pogre&scaron;no.</p>
<p>Ovaj njen čin iznova mi je potvrdio da moja žena definitivno ne pripada <em><strong>"profesorčićima-mediokritetima".</strong></em>&nbsp; Ne pripada profesorima koji ne vide ni&scaron;ta mimo sopstvenih predavanja. Predavanja koja ponavljaju svake godine bez ikakve varijacije, ko papagaji, ali sebe i pored toga smatraju akademskim radnicima.</p>
<p>Ona je svjesna ČEMU služi obrazovanje, koliko je razvijanje <a href="http://www.youtube.com/watch?v=D1R-jKKp3NA">KREATIVNOSTI</a> bitno. Ona je svjesna &scaron;ta je njen posao, koliko je bitna uloga nastavnika u dru&scaron;tvu.</p>
<p>Respect Dženana. Ponosan sam ovim &scaron;to si uradila - kao muž i kao informatičar.</p>
<p>Ako kojim slučajem na ovakav i slične postupke čuje&scaron; komentare "ma ona Dženana je lujka", nemoj se obazirati. To su mediokriteti koji jednostavno ne mogu "dobaciti" do onoga o čemu ti govori&scaron;.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, dunjaluk, muž, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>Pregleda 431, komentara: 0</h4>(Status na dan 07.04.2013 prema posterous blog statistici ranijeg posterous blog-a)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
