<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>(Ovaj članak je prebačen sa ranijeg posterous blog sistema)
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/05/imal-ko-vaku-sestru.html">Previous</a>
&nbsp; 
<a href="../../../index-8.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/05/braca-poderanih-gaca.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Kakofonija</h3>
<div class='post_info'>
<span class='post_time'>May 24 2011,  5:43 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p><em><strong><span style="color: #ff0000;">Upozorenje: tekst koji slijedi, kako naslov sam govori, pun je nedoličnih komentara, nepristojnih riječi, blaćenja bez odgovarajućih argumenata.</span></strong></em></p>
<p>Ova saga o ocjenijivanju vjeronauke poprimila je razmjere koje je te&scaron;ko ko mogao predvidjeti.</p>
<p>Koliko god <a href="/vjeronauka-po-glavi-stanovnika">želio</a>, nisam se mogao isključiti. Velikim dijelom i zbog toga &scaron;to se Dženana aktivmo uključila u <a href="http://radiosarajevo.ba/novost/53925/dzenana-husremovic-zahvala-emiru-suljagicu">čitavu tu temu</a>.</p>
<p>Međutim, stvar se vrlo brzo pretvorila u totalnu besmislicu.&nbsp;</p>
<p>Dženana je u svom prvom članku, poprilično naivno, nastupila prije svega kao naučnik. Kakofoniju nije koristila. Istina je da je pobrala puno "lajkova", ali se postavlja opravdano pitanje da li su ti "lajkovi" rezultat razumijevanja onoga &scaron;to je ona željela reći ?!</p>
<p>Nakon svega, ja sam ubjeđenja &nbsp;da 90% i dobar kusur "lajkova" nije zato &scaron;to si ti prozborila ne&scaron;to pametno, nego zato &scaron;to si bila protiv "onamo onih".</p>
<p>Kada bi tebe tvoji "lajkeri" razumjeli, puno njih bi te vrlo lahko "dislajkalo".</p>
<p>&Scaron;to se tiče onih &scaron;to su te otvoreno "dislajkali" - bolje reći pljuvali, &nbsp;a drže sebe za prave - beskompromisne muslimane, JaaRabbi, &nbsp;za njih se ne treba&scaron; plaho sekirati. Oni su, prije svega sljedbenici - sljedbenici kakofona.&nbsp;</p>
<div>U svom sljedećem tekstu i Dženana se ufurala. Čak je par poglavlja u njenom narednom članku bila klasična kakofonija. Pametna je moja Dženana. Skontala &scaron;ta ljudi čuju. &Scaron;alu na stranu, ona je bila ciljano banalna, patetična i ironična. Skoro na nivou kakofonije koju sam čuo na predhodne dvije hutbe.</div>
<p />
<div>I opet je Dženana dobila puno "lajkova" ... Jo&scaron; i vi&scaron;e nego za predhodni tekst !</div>
<p />
<div>Ja međutim opet postavljam isto pitanje: "Koliko te je lajkera doista shvatilo ?"</div>
<p />
<div>Za razliku od Dženane, koja kaže da je puno toga novoga naučila, ja nisam ni&scaron;ta novo naučio. Ali jesam dvije stvari dodatno potvrdio:</div>
<blockquote class="posterous_medium_quote">
<p>1) Bosanac koji je kadra od POČETKA DO KRAJA saslu&scaron;ati i NASTOJATI RAZUMJETI ono &scaron;to drugi govori je rijetka zvijerka. Tako rijetka, da bi u riječnik bosanskog jezika trebalo staviti da su "onaj koji je spreman saslu&scaron;ati drugog" i "stanovnik Bosne i Hercegovine" dva antonima.</p>
<p>2) Kakofonija je jedini način komuniciranja koji se u Bosni daleko čuje.</p>
</blockquote>
<p>Stvar sa kakofonijom i nije tako crna:</p>
<blockquote class="posterous_short_quote">
<p>Kakofonija je stvar koja sve sukobljene grupe u ovom slučaju spaja !</p>
</blockquote>
<p><!--more--></p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ministar</strong></span></p>
<p>Gledajući "Dženaninog" Ministra :) sinoć na "60-minuta", dobrano sam se razočarao. Istina, gledao sam ga zadnjih 10-tak minuta, al' ne vjerujem da je u ranijem dijelu emisije mogao značajno promijeniti moj utisak. Naime, umjesto da se potrudi da objasni &Scaron;TA on želi postići (osim ponavljanja ko papagaj "spriječiti diskriminaciju", "spriječiti diskriminaciju") on priča o sebi i mukama na kojima se na&scaron;ao i sa kojim se herojski borio. Pa zajednički sa urednikom, koji je na svojoj koži iskusio slične probleme, vida rane ...</p>
<p>U redu. Te&scaron;ko ti je. Grozne su stvari na tvoj račun izrečene. Ali, ti si ipak prije svega Ministar. Onaj koji treba stvari promijeniti. S obzirom na stanje stvari, od svega je najbitnije da javnosti pokaže&scaron; da je ono &scaron;to radi&scaron; u cilju pobolj&scaron;anja obrazovnog sistema, te da to ni za zehru neće ugroziti prava vjerskih zajednica !</p>
<p>Izlaganje Ministra, koncept emisije "zgazimo Reisa", &nbsp;objavljivanje kakofonije Jasmile Žbanić o ukidanju poreza za ateiste dovelo me do pitanja:</p>
<blockquote class="posterous_medium_quote">
<p>Čekaj malo, da ovi stvarno ne spremaju neku "zvrčku" ?! Možda ona kuknjava vjerskih zajednica ipak ima neko upori&scaron;te ?! Istina oni osim kakofonije ni&scaron;ta nisu rekli &scaron;to bi to i potvrdilo, ali fakat ova priča stvara prostor za takve konstrukcije ... &nbsp;</p>
</blockquote>
<p>To sam pitanje i podijelio sa Dženanom. Odgovorila mi je: "Ama nema &scaron;anse. Čak i da to hoće, Zakon im to ne dozvoljava. Koncept vjeronauke u smislu sadržaja same nastave se bez odobrenja vjerskih zajednica ne može mijenjati. "</p>
<p>"Dobro. Ima smisla", odgovorio sam. "Ali za&scaron;to se ovdje uop&scaron;te povlače pitanje poreza ?! Kakve veze porezi imaju sa sa prosjekom ocjena. Ovim se po tom pitanju budžet ni za pfening neće mijenjati ?! Čovječe, ovdje se non--stop mje&scaron;aju babe i žabe ... Za&scaron;to ovaj čovjek (op. aut. Ministar) jasno i glasno ne kaže da odluka nema veze sa izdvajanjima za vjeroučitelje ?!"</p>
<p>Prokomentarisao sam na kraju: "Sve je ovo jedna totalna kakofonija ... Ovdje svak' svoju priču priča, isto ko da niko drugi dunjaluku ne postoji niti je i&scaron;ta na tu temu rekao ...".&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Islamska zajednica</strong></span></p>
<p>Ono &scaron;to se mora priznati vodstvu IZ-a je činjenica da oni znaju (zlo)upotrijebiti temeljni koncept funkcionisanja i bitka zajednice, a to je <strong>jedinstvo muslimana</strong>.</p>
<p>Većina ljudi će zarad tog koncepta svakoga ko bilo &scaron;ta kaže protiv Reisa, po kratkom postupku izopćiti iz ummet-a. Međutim, koncept jedinstva NE ZNAČI to da ne će nam na&scaron;e vođe izdati instrukcije, a mi bez ikakvog pogovora prihvatiti ono &scaron;to nam se servira ! To nije za&scaron;tita jedinstva muslimana. To je jednoumlje.</p>
<p>Interesantan mi je bio komentar doc. dr. Nusreta Isanovića, dekana Islamske pedago&scaron;ke akademije u Zenici, u emisiji FTV-a "Odgovorite ljudima".</p>
<p>Nusreta se sjećam jo&scaron; iz doba rata. Često se pojavljivao u 3. korpusu. Sjećam ga se kao blagog i prijatnog čovjeka.</p>
<p>Nakon &scaron;to ga je ga je voditeljica vi&scaron;e puta (krajnje agresivnim tonom) pitala: "Je li govor Reisa bio govor mržnje !?", odgovorio je "Vidite, bitan je kontekst. Radi se o reakciji ..."</p>
<p>Odmah sam ustao iz stolice: "Pa dajte vi&scaron;e ljudi ! Zar je problem reći: &nbsp;To &scaron;to je rečeno nije primjereno". &nbsp;I tačka. E kada to kaže&scaron;, onda ima&scaron; kredibilitet nastaviti svoju priču - ukazati na činjenicu da se radi o reakciji na provokaciju i &scaron;ta već želi&scaron; reći ...</p>
<p>Sve ima svoju granicu. Kada se ta granica prekorači, onda je islamski reći: "To nije bilo u redu !" Koliko god ta istina bila osjetljiva, koliko god imao respekta prema poglavaru IZ-a.</p>
<p>Da je sto puta poglavar, on je ipak insan. Pa barem je to kod nas muslimana jasno ko dan ! &nbsp;</p>
<p>Zato ću izreći svoj stav: "Istup Rijaseta na hutbi posvećenoj vjerovanuci je te&scaron;ki autogo. Na sramotu zajednice. Istup Reisa takođe. Kakofonija, i puno vi&scaron;e od toga."</p>
<p>Ali, treba dodati da su oni na&scaron;i legalno izabrani predstavnici, i sad nam se crveniti. Ako Bog da, do narednih izbora.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ernad je peder</strong></span></p>
<p>Prekjuče ujutro &nbsp;iza sabaha nisam mogao zaspati ... Sve te kakofone priče o tome kako pravi musliman mora sljedbenik Reisa, a protivnik komuniste Suljagića i ostalih kjafira, nisu mi mogle izaći iz glave.</p>
<p>Sjetim se onog vica o Sulji i Muji, gdje Suljo obja&scaron;njava koncept analogije. Kompletnog vica se nikako ne mogu sjetiti, ali mi se kraj urezao u pamćenje:</p>
<p><em>"Ima&scaron; li ti akvarijum ?"</em>, pita Suljo. <em>"Imam"</em>, odgovorio je Mujo. "A ima li u tom akvarijumu ribica crvene boje ?", nastavlja Suljo. &nbsp;"Ima", odgovara Mujo.</p>
<p>"E pa Mujo,&nbsp; ti si onda peder".</p>
<p>"Diskusije" koje su se vodile u predhodnim danima, principom analogije dovele su me do konstatacije: "Ernade, ti si peder".</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Islamska zajednica, drugi put</strong></span></p>
<p>S obzirom da bez iskrenosti nema po&scaron;tenja, te da je po&scaron;tenje jedan od osnovnih islamskih principa, nemam dilemu o tome se kako se odrediti spram istupa vođstva IZ-a.&nbsp;</p>
<p>Oni su, uz male izuzetke, nastupili protivno prinicpima na&scaron;e uzvi&scaron;ene vjere.</p>
<p>Kao vrhovnog kakofona na temu "Vjeronauka i prosjek ocjena" bih ipak za par kopalja ispred Reisa stavio <strong>ef. Muhameda Velića</strong> sa svojom fetvom. &nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Islamska zajednica, časni izuzetak</strong></span></p>
<p>Već sam ranije pisao o tome kako sam "fun" <strong>doc. dr. Dževada Hodžića</strong>. On je u centralnom Dnevniku kod Senada Hadžifejzovića jasko k'o dan rekao, kada ga je Senad pitao za &scaron;ta misli o Velićevoj fetvi:</p>
<blockquote class="posterous_short_quote">
<p>O tome se nema &scaron;ta reći. Sa takvim pristupom stvarima se u potpunosti ne slažem ! Stidim se ... Mene je stid !</p>
</blockquote>
<p>E to je moja ulema ! To je pravi alim ! Svaka čast Dževade. Dževada za Reisa.</p>
<p>Istina, u startu se za njega bojim. Čovjek očigledno nije savladao ni "basic" kurs kakofonije.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ostali kakofoni ...</strong></span></p>
<p>Jasmila Žbanić je sa svojom pričom o porezima odradila jednu vrhunsku kakofoniju. Jasmila, o čemu ti priča&scaron; !?</p>
<p>Izvini, ni meni se mnoge stvari u privredi ne sviđaju pa mi nije palo na pamet da "rje&scaron;enje" tražim u tome da moja firma u tim dijelovima ne plaća poreze. Jasmila, razočarala si me. Duboko si me razočarala.</p>
<p>Ima toga jo&scaron;, Bosna je očigledno nepresu&scaron;no vrelo kakofonije ...&nbsp;</p>
<p>Mnogi su u svemu ovome vidjeli priliku da "mezete" islamsku zajednicu i tamo gdje imaju i tamo gdje definitivno nemaju prava i osnova.</p>
<p>Isto kao &scaron;to "pravi" i "beskompromisni" muslimani ignori&scaron;u činjenicu da je BiH sekularna država(*), tako i ovi drugi činjenicu da sekularna država ne znači da vjeri nema mjesta u javnom životu i obrazovnom sistemu.</p>
<p>---</p>
<p>(*) Musliman se mora pridržavati ugovora koje su njegovi legitimni predstavnici dobrovoljno prihvatili ! A postojeći ugovor je taj da Bosna uređena kao sekularna država.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bosna, dunjaluk, islam, muž</div>
</div>
<div class='post_responses'>
<h4>Pregleda 624, komentara: 0</h4>(Status na dan 07.04.2013 prema statistici posterous blog sistema)<hr/>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
