<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2011/05/braca-poderanih-gaca.html">Previous</a>
&nbsp; 
<a href="../../../index-8.html">Index</a>
&nbsp; 
<a href="../../../posts/2011/05/krkan.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Vjeronauka po glavi stanovnika</h3>
<div class='post_info'>
<span class='post_time'>May 16 2011,  3:24 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Vjera (a time i vjeronauka) i politika su&nbsp; "top teme" bosanskog postratnog dru&scaron;tva.</p>
<p>Uz ove dvije stvari naravno lijepo se uklapa i atribut "ugrožen". Ugroženih kol'ko ti du&scaron;a poželi.</p>
<p>Svakako su ove teme odlične za bacanje "koski" koje će narod "glabati" ... I narod glaba li glaba ... Evo u dobar čas zadnjih 20 godina ...</p>
<p>Ono &scaron;to je u Bosni fascinantno, jedna te ista stvar se tako rasteže od minus beskonačno do plus beskonačno da bi i tvorci <a href="http://sr.wikipedia.org/wiki/Infinitezimalni_ra%C4%8Dun">infinitezimalnog računa</a>, da do sada nije izmi&scaron;ljen, sigurno u Bosni na&scaron;li inspiraciju.</p>
<p>Ali da se vratim naslovu ...</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Džuma 10. džume-l-uhr 1431, petak 13.05.2011, Malezijska džamija Nova Breka<br /></strong></span></p>
<p>Ja sam član džematskog odbora džamije Nova Breka. Na sastanku odbora koji smo održali par dana prije smo odlučili da akciju hadžskog fonda aktueliziramo u toku maja tako &scaron;to ćemo na svakoj džumi pozvati ljude da se uključe u taj projekat(*).</p>
<p>Očekivao sam da će to biti glavna tema hutbe. Međudim, džuma je bila na "zadanu temu"(**).</p>
<p>Ovakve hutbe imam redovno započinje riječima:</p>
<blockquote class="posterous_short_quote">
<p>U medijima se puno priča o ovome ...</p>
</blockquote>
<p><!--more-->Slično hutbi posvećenoj krmetu kome se klanja dženaza u seriji "Lud, zbunjen normalan", tema koja je slijedila me je skroz zatekla.</p>
<p>Tema je bila odluka Ministra obrazovanja Kantona Sarajevo da vjeronauku izbaci iz prosjeka ocjena.</p>
<p>Ni u "peti" mi nije bilo da je to neka tema od velike važnosti za islamsku zajednicu.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Čemu služi &scaron;kola</strong></span></p>
<p>O toj odluci sam slučajno čuo prije par dana kada sam bio na <a href="http:///tag/h_bakir">Bakirovom</a> roditeljskom.</p>
<p>Učiteljica je rekla:</p>
<blockquote class="posterous_short_quote">
<p>Ne&scaron;to je Bakir sa vjeronaukom "utanjio" ... Inače ga je vjeroučiteljica hvalila, ali je manje aktivan.</p>
</blockquote>
<p>Da bi me utje&scaron;ila, učiteljica je rekla:</p>
<blockquote class="posterous_short_quote">
<p>Ali, dobro, i nije neki problem - ta ocjena i ne ulazi u prosjek ...</p>
</blockquote>
<p>Odmah sam uzvratio:</p>
<blockquote class="posterous_short_quote">
<p>Ma nije bitno ulazi li ili ne ulazi u prosjek. Vidjeću sa Bakirom &scaron;ta je. Ubrzo će hatme(*) u mektebu, pa će se valjda malo vi&scaron;e aktivirati.</p>
</blockquote>
<p>Iako sam prvi put čuo da ocjena iz vjeronauke ne ulazi u prosjek, ta informacija mi se uop&scaron;te nije činila bitnom.</p>
<p>Znam za&scaron;to &scaron;aljem dijete na vjeronauku. Zato &scaron;to ga želim odgajiti kao muslimana. Prosjek ocjena je zadnja stvar koja bi mi u kontekstu vjeronauke i pala na pamet.</p>
<p>Međutim, kada generalno razmislim na temu ocjena i &scaron;kolskog uspjeha, moj rezon je značajo pomjeren u odnosu na prosječnog roditelja.</p>
<p>&Scaron;kola je mjesto gdje se dijete socijalizira i stiče znanja. Ako to dobija, ja sam zadovoljan. Ako to ne dobije, sve svoje petice i "veoma uspje&scaron;no" može "mačku o rep" objesiti.</p>
<p>Iz tog razloga meni problem predstavlja činjenica da djeca iz geografije moraju naučiti napamet da je povr&scaron;ina BiH <a href="http://en.wikipedia.org/wiki/Bosnia_and_Herzegovina">51.209 km^2</a> (^*) od prve do zadnje cifre, ili da dijete u 6 razredu osnove &scaron;kole ovo uči iz informatike(^**):</p>
<blockquote class="posterous_short_quote">Informacija predstavlja preslikavanje jednog stanja subjekta u stanje drugog subjekta, pri čemu ovo preslikavanje na drugi subjekat ne mora da bude istovjetno kod svih subjekata.</blockquote>
<p>Kada sam svojevremeno Samri rekao da je ova definicija sama po sebi zbrkana, te da se informatika uči k'o pjesmica, nastavnica informatike je rekla:</p>
<blockquote class="posterous_short_quote">
<p>Ko je taj tvoj tata ? Kako ja za njega ne znam ako tako dobar poznavalac informatike !?</p>
</blockquote>
<p>Ova reakcija je za mene bila frapantno saznanje. Njoj je učenje ovih budale&scaron;tina ne&scaron;to sasvim normalno !?!?</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Čemu služi vjeronauka</strong></span></p>
<p>Ali, informatika i znanje nisu u Bosni stvari oko koji se treba "glabati koska". Zato se vratimo vjeronauki.</p>
<p>Za mene kao roditelja je bitno sljedeće: Da vjeroučitelji, gdje god ja svoje dijete po&scaron;aljem, mojoj djeci&nbsp; "omile" vjeru - da mu otvore srce. Da ga upute. Da ga nauče.</p>
<p>Koju će ocjenu dobiti ?!&nbsp; Hoće li mu to podići prosjek ? Ma dajte ljudi &scaron;ta je vama.</p>
<p>Ja Rabbi Ja Rabbi ... Pa neće mu u ishodu djela vrijednovati ni Reis ni vjeroučitelj.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>&Scaron;kola vs Mekteb</strong></span></p>
<p>Ja ne&scaron;to previ&scaron;e ne polažem na vjeronauku u &scaron;kolama. Mekteb je prirodno okruženje za uvođenje djeteta u vjeru.</p>
<p>Nastava vjeronauke je za mnoge roditelje "easy way" da sebe "operu" od toga da djeci obezbjede vjersku poduku.&nbsp;</p>
<p>Sigurno radi toga i brojnost djece u mektebima trpi. Naravno, ima smisla i taj rezon da će masovnost koja se kroz vjeronauku u &scaron;kolama postiže daje svoj pozitivan efekat. Sigurno je mnogo onih koji nikada ne bi proučili Fatihu da nije vjeronauke u &scaron;kolama. Ali, iskreno ne znam &scaron;ta time mi muslimani dobijamo.</p>
<p>&Scaron;ta dobija dru&scaron;tvo ? Jesmo li postali moralniji radi vjeronauke u &scaron;kolama ?</p>
<p>Nemam pojma. Lično mislim da su efekti minorni u odnosu na sredstva koja se u vjeronauku ulažu. Mislim da bi konkretno islamska zajednica vi&scaron;e dobila da se vi&scaron;e uloži u mektebsku poduku. Naravno, isti princip vrijedi i za druge vjerske zajednice.</p>
<p>Vjeronauka u &scaron;kolama postoji. U nju se vidim mnogi kunu kao alfa i omega na&scaron;ih vjerskih sloboda. Pa dobro. Ako je imamo, treba je organizovati da djeca &scaron;to vi&scaron;e od nje dobiju. Da dru&scaron;tvo &scaron;to vi&scaron;e od nje dobije(^***).</p>
<p>Odluka da se ocjena iz vjeronauke izbaci iz prosjeka je u kontekstu gornjih ciljeva nebitna.</p>
<p>Ona je bitna samo ako je kod roditelja pohađanje vjeronauke motivirano ciljevima koji sa vjerom veze nemaju.</p>
<p>Ako je to tačno, onda imamo te&scaron;ki problem. Onda vjeronauka za većinu nije u svhi onoga za &scaron;ta bi trebala biti !?</p>
<p>Ako je to tačno, onda je koncept vjeronauke u &scaron;kolama totalno pogre&scaron;an ?!</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Hutba</strong></span></p>
<p>Sadržaj hutbe koji mi je pokazao da se vodstvo islamske zajednice uop&scaron;te ne bavi ovim pitanjima.</p>
<p>Oni se, bojim se, ponajvi&scaron;e bave sobom i pozicijama koje su stekli dosada&scaron;njim statusom vjeronauke. Imam osjećaj da su se "kuke i motike" na&nbsp; ovu temu&nbsp; digle prije svega radi određenih interesa, a ne zbog napada na slobudu vjerskog izražavanja.</p>
<p>Može biti da je centralno pitanje ovo: "Ako se sada interes djece za vjeronauku bitno smanji, kuda sa silnim vjeroučiteljima ?"</p>
<p>Ako je to tako, onda je protekla hutba obični pamflet koji nosi poruku: "Ne damo svoje privilegije koje smo te&scaron;kom mukom stekli !"</p>
<p>Izvinite, ali to nisu interesi muslimana, nego interesi vjerskih službenika.</p>
<p>&Scaron;to se tiče hutbe, ona je "oplela" po Ministru, JaRabbi, ko po najvećem neprijatelju muslimana i islama. Ja sam čitavu hutbu odmahivao glavom da me je na kraju vrat zabolio.</p>
<p>I&scaron;li su do te mjere da su ga stavili u ravan onih koji su branili prakticiranje vjere i odlazak u džamije. Jaaa Rabbi, Jaaa Rabbi ....</p>
<p><span style="text-decoration: underline;"><span style="font-size: medium;"><strong>Za&scaron;to sam ovo napisao</strong></span></span></p>
<p>Kada se zavr&scaron;ila hutba, rekao sam sebi:</p>
<blockquote class="posterous_short_quote">
<p>E Ernade, o ovome neće&scaron; pisati. Nemoj tro&scaron;iti vrijeme na ovakve stvari. Ima&scaron; sto prečih poslova !</p>
</blockquote>
<p>Iz tog razloga nisam ni polemizirao sa efendijom, kako ja to <a href="http:///allah-mubareci-nova-2011-godina">običavam</a> u ovakvim situacijama.</p>
<p>Međutim, ipak sam prek&scaron;io to obećanje. "Raspucala" me je <a href="/tag/mu%C5%BE">Dženana</a>.</p>
<p>Naime, ona je prije par dana na "radiosarajevo.ba" napisala članak na ovu <a href="http://www.radiosarajevo.ba/novost/53279/dzenana-husremovic-vjeronauka-i-matematika">temu</a>.</p>
<p>Danas je pomenula da joj je članak na vrhu čitanosti, te da bi voljela da i ja stavim članak na svoj&nbsp; facebook profil.&nbsp; Rekla je: "Da i oni "moji" prokomentari&scaron;u članak", ko god to već bio.</p>
<p>Odgovorio sam joj: "Vidjeću". Na &scaron;ta je ona izazivački rekla:</p>
<blockquote class="posterous_short_quote">
<p>A boji&scaron; se da to stavi&scaron;, da te ne bi počeli prozivati ?</p>
</blockquote>
<p>E to me je pravo razljutilo, pa sam joj odgovorio:</p>
<blockquote class="posterous_short_quote">
<p>Pa ti mene onda fakat ne zna&scaron; ! E sad si me razljutila. Sada nema &scaron;anse da ti članak stavim na na profil !</p>
</blockquote>
<p>By the way, članak joj je dobar. Pročitajte ga ako vam "glabanje ove teme" ima smisla.</p>
<p>Ja sam svoje "odglab'o".</p>
<p>----</p>
<p>(*) Projekat hadžskog fonda se sastoji u tome da se džematlijama koji su dali doprinos radu džamije, a nisu u mogućnosti da samostalno finansiraju odlazak na hadž, džamija obezbjedi dio sredstava (cca 70%).</p>
<p>(**) Zadana tema je kada se u Rijasetu napi&scaron;e hutba koju čitaju svi hatibi - imami.</p>
<p>(***) Zavr&scaron;ni ispiti na mektebskoj nastavi.</p>
<p>(****) Odnosno veoma uspje&scaron;an u njegovom slučaju</p>
<p>(^*) umjesto da zapemte da je njena povr&scaron;ina cca 50 000 km^2</p>
<p>(^**) Informatika za 5. i 6. razred osnovne &scaron;kole drugo izdanje, Bosanska riječ Sarajevo, Suada Numić, Salih Čemo</p>
<p>(^***) Smatram da bosansko dru&scaron;tvo u cijelini puno dobija ako se Bo&scaron;njaci vi&scaron;e usmjere ka islamu, odnosno islamskom pona&scaron;anju.</p>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>antiznanje, bosna, dunjaluk, islam, muž, obrazovanje</div>
</div>
<div class='post_responses'>
<h4>838 views and 2 responses</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>May 19 2011,  3:29 AM</div>
<div class='response_name'>murga responded:</div>
</div>
<div class='response_body'>Ista tematika u isto vrijeme i na isti dan je bila na hutbi kod nas u Gorazdu... a hutbu je odrzao doc.dr.Safet Halilovic profa iz Zenice... nema se zaista puno toga polemisati...<p>Mene je tako jako zabolio vrat kad je profa spomenuo da smatra da su samo oni studenti njemu najdrazi koji dobiju 8 i vise... </p><p>U potpunosti podrzavam tvoj stav o vjeronauci u skoli... </p><p>Toliko...</p></div>
</li>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>May 24 2011,  4:16 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Šta li je profa sa tim 8+ htio reći, 'tice znaju ... branio je visoke ocjene iz vjeronauke ? Ma nebitno, na kraju krajeva ...<p>Drago mi je Murga da dijeliš moje mišljenje. A i da ne dijeliš, hvala na čitanju. Samo čitanje i normalna komunikacija, pokazalo se na ovoj banalnoj temi, predstavlja kod nas nešto što je vrijedno svake hvale. Tužno ali do boli istinito.</p></div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</body>
</html>