<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2012/05/trazi-se-menadzer-prodaje-bringout.html">Previous</a>
&nbsp; 
<a href="../../../index-2.html">Index</a>
&nbsp; 
<a href="../../../posts/2012/05/oholost.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Auto za sva vremena</h3>
<div class='post_info'>
<span class='post_time'>May 30 2012,  4:59 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Zadnjih par dana sam skontao da su auta koja sam kupio 2005 &nbsp;i 2006 za firmu i privatne potrebe bila, kad se sve sabere, veliki proma&scaron;aj.</p>
<p>2005 smo "u paketu" kupili novei Hyundai Matrix-a 1.6 benzin i Getz-a 1.1 benzin.</p>
<p>U to vrijeme nije bilo nekih potreba dva auta u firmi, tako da je prvobitni plan bio da se Getz vozi po gradu i za potrebe firme i privatno, dok bi se&nbsp;Matrix koristio za veće udaljenosti i onda kada treba svu djecu "poprtiti" u auto.</p>
<p>U to vrijeme smo imali u firmi &Scaron;kodu.</p>
<p>&Scaron;kodu (Felicija karavan benzin 98) sa razlogom zovu "auto za sva vremena".</p>
<p>Naime, prilikom prodaje &scaron;kode na internetu sam na&scaron;ao jedan vic:</p>
<blockquote class="posterous_short_quote">
<p>&Scaron;koda je auto za sva vremena. Kad je kupi&scaron;, ne može&scaron; je se nikako kutarisat'.</p>
</blockquote>
<p>Uh ... tako i bi. Niko je ni za lijeka ne htjede kupiti ...&nbsp;</p>
<p><!--more--></p>
<p>2006-te smo je ipak uspjeli prodati.</p>
<p>Kad sam vidio da je vrag odnio &scaron;alu, oti&scaron;ao sam na auto-pijacu, razgledao okolo koja je to cijena koja bi "namamila" kupca, nalijepio je na auto i čekao ...</p>
<p>I dočekao.</p>
<p>Moja strategija kupovine je bila iskrenost i niska cijena:</p>
<p>Na auto sam pored cijene velikim slovima nave sve mahane auta koje su mi bile poznate. Kad me pitaju:</p>
<blockquote class="posterous_short_quote">
<p>Pa dobro čovječe, ti toliko mahana nabroja, k'o da kupce tjera&scaron; od sebe ?!</p>
</blockquote>
<p>ja bih imao spreman odgovor:</p>
<blockquote class="posterous_short_quote">
<p>Pa eto sam tebe privukao. Očigledno da te je cijena zainteresovala.</p>
</blockquote>
<p>Naravno, ta strategija ima i svoju mahanu - par "stoja", ako ne i vi&scaron;e, mora&scaron; bit' na zijanu.</p>
<p>Ali, barem se prodaja brzo zavr&scaron;i.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kangoo benzin 1.6 dostavni, koji ne dostavlja ni&scaron;ta</strong></span></p>
<p>Nakon prodaje &scaron;kode, ja pametnica-pametna skontam kako bi dobro bilo kupiti dostavno vozilo.</p>
<p>Naime, taman je bio uveden zakon o PDV-u.</p>
<p>"Nafilovan" svim mogućim zakonima i pravilnicima skontam da je kupovina dostavnog vozila veliki &scaron;ićar:</p>
<p>1) Za dostavno vozilo imam pravo na ulazni PDV</p>
<p>2) Ista stvar važi i za tro&scaron;kove održavanja i goriva za dostavno vozilo.</p>
<p>Ali sam tom prilikom previdio jednu "sitnicu", koja će čitav moj koncept učiniti budale&scaron;tinom epskih razmjera:</p>
<p>1) Policija redovno zaustavlja dostavna vozila i traži razno-razne papirčine (putne naloge).&nbsp;</p>
<p>2) Postoje dodatni tehnički pregledi pored redovnih svakih 6 mjeseci ...</p>
<p>Ukratko, kori&scaron;tenje takvog vozila je te&scaron;ki zahmet, kada uzme&scaron; naviku na&scaron;e policije da svoje niske plate namiruje napojnicama vozača ovakvih vozila ...</p>
<p>Prvih par kazni je bilo podno&scaron;ljivo ... 50-100 KM ... hajd' u redu.</p>
<p>Ali, kada mi je prije par godina stigla kazna od 1500 KM (firma 1000 ja kao direktor 500 KM) kangoo mi je za sva vremena iza&scaron;ao iz hatura.</p>
<p>Moja jedina želja bila je da ga prodam.</p>
<p>Auto nas nikada nije izdao. Kolege koje ga voze kažu da je super motor, sve ok ... ali nakon ovih "napojnica" državi i državnim službenicima moj genijani plan je postao budale&scaron;tina samo-taka.</p>
<p>Počeo sam ga prodavati &nbsp;9000 KM, &scaron;to je s obzirom na godi&scaron;te i pređenu kilometražu srazmjerno malo (cca 120 000 km), da bih na kraju do&scaron;ao na 6500 KM.</p>
<p>A i to vjerovatno ne bih uspio postići da moj kupac nije iskoristio ulazni PDV koji ga "toka" kao kupca privrednog vozila od drugog PDV obveznika ...</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Getz 1.1 benzin</strong></span></p>
<p>Sa Getzom smo u prvih mjesec-dva imali udes. Bogu hvala, nije to bio nikakav opasan udes. Auto je bilo na kasko osiguranju, tako da je to sve rije&scaron;eno brzo.</p>
<p>Ali već to bilo je signal da to auto ba&scaron; i nije previ&scaron;e berićetno.</p>
<p>Na sreću, nakon tog udesa bilo je sitnik kvrc-mrc na parkinzima, ali ni&scaron;ta značajno.</p>
<p>Međutim, zamisao da se on primarvno vozi po gradu radi male potro&scaron;nje je ubrzo pala u vodu.</p>
<p>Moja supruga, koja napravi najveću kilometražu po gradu, &nbsp;je brzo getz počela zaobilaziti u dugom luku.</p>
<p>Hem je nizak, hem nema nosiljku za Faruka, hem je vazda je "peksinav" (&scaron;to je na žalost tačno, mi u firmi su pravi peksini :( &scaron;to se tiče auta) ...</p>
<p>Ukratko "Getz", nikada nije ispunio svoju ulogu "gradskog" auta.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Matrix 1.6 benzin</strong></span></p>
<p>Matrix je lijepo auto. Njegov dizajn nas je odmah "upecao". Prostran, porodični auto.&nbsp;</p>
<p>Nikada nam u ovih 7 godina nije napravio nijedan problem. Uvijek nas je odveo na željenu lokaciju.</p>
<p>Ali, sa ovim silnim poskupljenjima benzina i preuzimanju uloge gradskog auta, Matrix je počeo žestoko udarati na kućni budžet.</p>
<p>Na&scaron; jedini lijek protiv toga je bilo da kažemo:</p>
<blockquote class="posterous_short_quote">
<p>Ma najbitnije je da nas ne zeza, da nas služi a ne da mi služimo njega ...</p>
</blockquote>
<p>A &scaron;to se tiče potro&scaron;nje, tu smo po nepisanom pravilu rekli - ne znamo.</p>
<p>Auto se tenkuje kada dođe do crvene linije. Niko ne kalkuli&scaron;e kolika je ta potr&scaron;nja.</p>
<p>"Pići-murići" i ne misli puno.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Auta za sva vremena</strong></span></p>
<p>Prodaja Kangoo-a mi je otvorila oči da je kupovina auta ozbiljna stvar.</p>
<p>Mora se paziti kako na brend tako i na tip vozila. Benzinci dostavna vozila su "neprodavljiva".</p>
<p>Kod malih vozila je brend veoma bitan. "VW"-i "Citroen"-i i "Renault"-i su za čitavu klasu skuplji od svojih konkurenata koji su manje poznati brendovi.</p>
<p>Odluka "dizel" / "benzin" je veoma bitna kada dođe vakat za prodaju ...</p>
<p>"Genijalci" kao ja mogu izgubiti na desetine hiljada KM pogre&scaron;nom kupovinom.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kupovina novog auta</strong></span></p>
<p>Novo auto je redovno preskupo za većinu Bosanaca.</p>
<p>Kada sam 2005 i 2006 kupovao auta, i&scaron;ao sam logikom da je bolje nako 5-6 godina ponovo kupiti novo auto, makar ono bilo &nbsp;lo&scaron;iji brend sa manje opreme.</p>
<p>Nakon 7 godina, mislim da je ta odluka bila uglavnom dobra.</p>
<p>Osim slučajeva vi&scaron;e sile, sva auta su odrađivala svoj posao. Nisu nas zezala.</p>
<p>Nismo svako malo hodali po servisima jer je tamo neka "gefufna" oti&scaron;la.</p>
<p>Sa starim vozilom to je neminovnost.</p>
<p>S obzirom na činjenicu da o vozilima znam skoro pa ni&scaron;ta po pitanju održavanja, stategija "novo" je bila dobro.</p>
<p>Jedino &scaron;to bi sa ovom pameću pazio jeste da kod odabira brenda i modela ipak uzmem auta koja je lahko prodati.</p>
<p>Bolje se i ne&scaron;to vi&scaron;e "zavaliti" kod kupovine (a to je uvijek "zavala"), nego kupiti &nbsp;"auto za sva vremena".</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dunjaluk</div>
</div>
<div class='post_responses'>
<h4>1343 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
