<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2012/05/auto-za-sva-vremena.html">Previous</a>
&nbsp; 
<a href="../../../index-2.html">Index</a>
&nbsp; 
<a href="../../../posts/2012/05/mladim-it-poduzetnicima-koji-razmisljaju-drug.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Oholost</h3>
<div class='post_info'>
<span class='post_time'>May 25 2012,  2:50 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p style="">Jutros sam dobio čudan mail. Koliko sam razumio, pi&scaron;em nadmeno, oholo.</p>
<p style="">Ovo je moj odgovor:</p>
<blockquote>
<p>&gt; Subject: Po&scaron;tovani</p>
<p>&gt; Sasvim slučajno, nai&scaron;la sam na va&scaron; blog i va&scaron;u aplikaciju za posao. Trenutno nemam pristup svojoj mail adresi, tako da se koristim prijateljevom, a va&scaron; komentar na prijave za posao ljudi koji su Vam se obraćali za isti doslovno me ostavio bez teksta...<br /><!--more-->Na koji način Vas je moje pisanje ostavilo bez teksta ? &Scaron;ta konkretno ?<p />&gt; Nazivate se misliocem, direktorom i muslimanom,<p />Ja to jednostavno jesam. U čemu je problem ?<p />&gt; ... pa smatram da mi je dužnost zamoliti vas da ujutro kada ustanete, pročitate svoje komentare i malo se zamislite nad njima.&nbsp;Tužno je &scaron;to svako ima pravo riječi, glasa, ogla&scaron;avanja, tipkanja, kako bi lijepo bilo da svijetom vlada ti&scaron;ina i muk, da ljudi postanu svjesni svoje ni&scaron;tavnosti i prestanu se oholiti.</p>
<p>Pretpostavljam da mi pripisujete oholost.<p />Međutim, ne razumijem &scaron;ta vi želite reći. Zato Va&scaron;e pisanje uzimam kao čin "&scaron;upljiranja".<p />&gt; Uglavnom, to bi bilo to, nažalost ne mogu aplicirati na Va&scaron; konkurs jer ne posjedujem obrazovanje u toj struci, a nisam ni na birou, rado bih vam pokazala kvalitete pravog mislioca, direktora i muslimana. Ukoliko budete imali vremena i želje raspi&scaron;ite konkurs za nekoga tih kvaliteta, rado ću Vam pokazati koliko je znanje krhko i koliko ga malo imate.<p />Vi tražite posao ? Ako tražite, za&scaron;to niste naveli vje&scaron;tine i kompetencije koje posjedujete.<p />Jedino &scaron;to ste demonstrirali ovim obraćanjem je vje&scaron;tina "&scaron;upljiranja".<p />Kako god bilo, očigledno da niste detaljnije čitali moj blog.&nbsp;<p />Da jeste, na&scaron;li bi niz oglasa za posao: &nbsp;<a href="http://hernad.bring.out.ba/tag/oglas_posao" target="_blank">http://hernad.bring.out.ba/tag/oglas_posao</a></p>
<p>Možda bi tada do&scaron;li do drugačijih zaključaka.</p>
<p>1) Formalno obrazovanje nije presudno za rad u firmi bring.out (referenca&nbsp;<a href="http://hernad.bring.out.ba/trazi-se-knowhow-erp-project-manager" target="_blank">http://hernad.bring.out.ba/trazi-se-knowhow-erp-project-manager</a>)<p />2) Mislim da ne razumijete razliku između pojmova "oholost" i "otvorenost".<p />3) Vjerovatno ste nakon povr&scaron;nog čitanja&nbsp;<a href="http://www.bring.out.ba/" target="_blank">www.bring.out.ba</a>&nbsp;i hernad.bring.out.ba napisali ovaj mail, &scaron;to je indikator da ste povr&scaron;na i ishitrena osoba.<p />Demonstriraću Vam &scaron;ta ja smatram otvoreno&scaron;ću, a vi vrlo vjerovatno činom oholosti.<p />Va&scaron; mail nije dobro sročen. To mi naslov "Po&scaron;tovani" govori.<p />Obja&scaron;njenje možete mog stava možete naći ovdje&nbsp;<a href="http://hernad.bring.out.ba/pravilo-poslovna-korespondencije-no1-naslov-j" target="_blank">http://hernad.bring.out.ba/pravilo-poslovna-korespondencije-no1-naslov-j</a><p />Kada se tome doda da korisite tuđi email za pisanje ovakvog komentara ... Va&scaron;a vje&scaron;tina komunikacije u poslovnom okruženju je veoma lo&scaron;a.<p />Pozdrav,</p>
<p>Ernad</p>
</blockquote>
<p>&nbsp;</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>dunjaluk</div>
</div>
<div class='post_responses'>
<h4>1411 views and 1 response</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>May 26 2012, 12:56 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'>Re: Poštovani<br />From :Ernad Husremovic<br />Subject : Re: Poštovani<br />To : Postovana	<br />Sat, May 26, 2012 09:09 AM<p>Vi ste prenijeli svoju poruku, ja sam Vam odgovorio.<br />Iz ovog javljanja bolje razumijem s kim sam razgovarao.</p><p>Selam alejkum.<br />---<br />Ernad Husremović<br />direktor</p><p>> From: Postavan<br />> To: <a href="mailto:hernad@bring.out.ba" rel="nofollow">hernad@bring.out.ba</a><br />> Sent: Saturday, May 26, 2012 1:05:37 AM<br />> Subject: RE: Poštovani<br />> Mislim da me na žalost ne možete razumjeti...slijepi ste, gluhi, a daleko ste od toga što mislite da jeste.<br />> Moja dužnost je bila upozoriti Vas, a Vama ostaje Vaše...šta god to bilo.<br />> Što se tiče šupljiranja, hm..duga je to tema, a posao hvala Allahu imam, pa ne ovisim o takvima poput Vas i njihovoj dubokoumnosti u očiglednoj maloumnosti, možda je to kompleks ženinog doktorata ili šta već?!<br />> Ostajte mi dobro u svom tom nerealnom shvatanju sebe.<br />> Lijep pozdrav !</p></div>
</li>
</ul>
<div id="disqus_thread"></div>
    <script type="text/javascript">
	    var disqus_shortname = 'hernad'; 
        (function() {
            var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Aktivirajte JavaScript za pregled komentara <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>

</div>
</div>
</div>
</div>
</body>
</html>
