<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2012/05/mladim-it-poduzetnicima-koji-razmisljaju-drug.html">Previous</a>
&nbsp; 
<a href="../../../index-2.html">Index</a>
&nbsp; 
<a href="../../../posts/2012/05/poslovna-inicijativa-u-usranoj-drzavi.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Poslovna tajna, kompatibilnost vendor-klijent</h3>
<div class='post_info'>
<span class='post_time'>May 14 2012,  3:07 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>"bring.out" je po mnogim stvarima drugačija firma.</p>
<p>Ta njena različitost najče&scaron;će je refleksija mojih pogleda na informatiku i informatički posao u cijelini.</p>
<p>Te svoje drugačije poglede uobičajeno iznesem na ovom blogu.</p>
<p>Ali ni na&scaron;e službene stranice <a href="http://www.bring.out.ba/primjer-ponude-f18-ubuntulinux-novi-klijent">www.bring.out.ba</a> nisu po&scaron;teđene tih mojih izleta.</p>
<p><span style="text-decoration: underline;"><strong><span style="font-size: medium;">Ugovori i cijenovnici, povjerljivi dokumenti</span></strong></span></p>
<p>Ugovori i cjenovnici su uobičajeno dokumenti koje se ne objavljuju javno, nego samo po upitu klijenta.&nbsp;</p>
<p>Primaoci dokumenata dobijaju informaciju da je to povjerljivi materijal koji ne smiju zloupotrebljavati.&nbsp;</p>
<p>Međutim, u praksi se rijetko ko pridržava tih upozorenja.</p>
<p>Krađa rečenica u Ugovorima, "džonjenje" cjenovnika konkurencije je prije redovna pojava nego li izuzetak. Na trži&scaron;tu koje je samo po sebi divlje, kao ovo na&scaron;e, poslovna neetičnost je uobičajena.</p>
<p>Kako god bilo, dugi niz godina na&scaron;i ugovori i cjenovnici su javno dostupni dokumenti.&nbsp;</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Ponude kupcima, poslovna tajna</strong></span></p>
<p>Za razliku od ugovora i cjenovnika,&nbsp;ponude kupcima opet bez izuzetka spadaju u domen poslovnih dokumenata koji predstavljaju poslovnu tajnu.</p>
<p>Za to postoji niz praktičnih razloga.</p>
<p>1) Svaka ozbiljna ponuda u IT svijetu traži značajno vrijeme za pripremu.</p>
<p>Ako se uzme u obzir utro&scaron;eno vrijeme, ponuda koju sam&nbsp;<a href="http://www.bring.out.ba/primjer-ponude-f18-ubuntulinux-novi-klijent">maloprije objavio na na&scaron;em site-u</a>&nbsp;ko&scaron;ta firmu par stotina KM.</p>
<p>2) Svaki na&scaron; konkurent će moći lahko povezati, ako ga ovaj isti klijent kontaktira za ponudu, &scaron;ta smo mi ponudili i po strukturi ponude i po cijenama.</p>
<p>To mu u startu daje prednost u odnosu na nas.</p>
<p>Pa za&scaron;to onda objavljujem ovakve informacije javno ?</p>
<p>Zato &scaron;to sam egzibicionista ?</p>
<p>Zato &scaron;to očekujem da to ionako neće niko od gore zainteresovanih ni pročitati, a mi ćemo se moći i dalje folirati kako smo totalno otvorena firma?</p>
<p>Motiv nije nijedan od navedenih.</p>
<p>Moj motiv leži u činjenici da "open source" kao koncept u razvoju software-a može naći svoju primjenu i u poslovanju firme.</p>
<p>Nakon dogogodi&scaron;njeg rada sa klijentima, glavni izvor problema je bilo <span style="color: #ff0000;"><strong>nerazumjevanje</strong></span>.</p>
<p>&Scaron;ta je to &scaron;to mi u stvari nudimo klijentu ?</p>
<p>&Scaron;ta je to &scaron;to mi možemo ponuditi a &scaron;ta ne možemo ?</p>
<p>&Scaron;ta je to &scaron;to klijent sebi može priu&scaron;titi, a &scaron;ta realno ne može ?</p>
<p>Ako se fokus na&scaron;e interakcije svede na "natantavanja" vi ste nama rekli pa niste, mi smo vama rekli pa nas niste slu&scaron;ali, od posla nema ni&scaron;ta.</p>
<p>Taj posao će postati muka za obje strane.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Kompatibilnost vendor-klijent</strong></span></p>
<p>Jedna od najglupljih krilatica prodavaca po meni je izjava:</p>
<blockquote class="posterous_short_quote">
<p>Kupac je uvijek u pravu !</p>
</blockquote>
<p>Kada čujem ovakvu izjavu, redovno okrenem leđa prodavcu.</p>
<p>Kupac nije uvijek u pravu. Da kupac zna, on ne bi trebao pomoć prodavca, u na&scaron;em slučaju IT vendora.</p>
<p>Kupac najče&scaron;će ne zna dobro formulisati ono &nbsp;&scaron;to želi. Kupac treba pomoć.</p>
<p>Samo ako prodavac <strong>zna</strong>&nbsp;utvrditi &scaron;ta je to &scaron;to kupac traži, ako <strong>zna</strong> informisati kupca o svojoj ponudi, &nbsp;situacije i optužbe kupca "prodali ste mi muda za bubrege" se mogu izbjeći.</p>
<p>Svaki drugi koncept nuđenja proizvoda i usluga nosi sa sobom veliki rizik nezadovoljstva jedne ili druge strane. Najče&scaron;će obje.</p>
<p>Zato sam pobornik pravila da nuđenje mora imati za svoju osnovu bazičnu kompatibilnost klijenta i davaoca usluga.</p>
<p>Pravljenje posla sa nerazumnim klijentom redovno firmu je gubitak za firmu.</p>
<p>Pod uslovom da niste skloni laganju i izbjegavanju svojih klijenata.</p>
<p>Poslovna politika "bring.out" je takva da je zabranjeno svjesno lagati klijente.</p>
<p>Poslovne "strategije" tipa:</p>
<p>"Direktor je na službenom putu" kada se ne želi javiti na telefon, &nbsp;"Evo, ba&scaron; je spreman virman za plaćanje" kada nas neko zove po deseti put za plačanje, "Nadam se da ćemo sutra rije&scaron;iti problem" a da smo pri tome smo svjesni da od toga nema ni&scaron;ta, su zabranjene u na&scaron;oj firmi.</p>
<p>Klijente koji često primjenjuju slične "strategije" u radu sa nama smatramo nekompatibilnim.</p>
<p>Takvih klijenata se nastojimo rije&scaron;iti.&nbsp;</p>
<p>Na stanovi&scaron;tu smo da je bolje imati jednog "čestitog" - kompatibilnog klijenta nego li 10 nekompatibilnih.</p>
<p>Razlog opet, po meni nije moralne (kako se iz prva čini), neko prevashodno praktične prirode:</p>
<blockquote class="posterous_short_quote">
<p>Od takvih klijenata te može tako zaboliti glava da sve ono &scaron;to zaradi&scaron; za tren izgubi&scaron; sekirancijom i dodatnim gubitkom energije.</p>
</blockquote>
<p>Ovdje treba imati na umu da &nbsp;princip kompatibilnosti, slično kao i u software-u uvijek podrazumjeva dvije strane.</p>
<p>Kao &scaron;to sa na&scaron;eg aspekta klijent može biti nekompatibilan, tako naravno i mi možemo biti (i često jesmo) slaba karika u vezi vendor-klijent.</p>
<p>Koja god strana bila uzročnik problema, najbolji put je - svak na svoju stranu.</p>
<p>Sada kada sam objasnio pojam "kompatibilnosti vendor-klijent", mogu da kažem i koji je motiv javnog objavljivanja konkretne ponude - Želimo da svaki na&scaron; potencijalni klijent razumije principe na&scaron;e ponude.</p>
<p>Ako mu to odgovara, neka nas kontaktira. Ako mu se to ne svidi, opet smo svi na dobitku - ni on nas ni mi njega nećemo bez potrebe "bihuzuriti".</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, business</div>
</div>
<div class='post_responses'>
<h4>1363 views and 0 responses</h4>
<ul class='post_responses list'>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
