<!DOCTYPE html>
<html>
<head>
<meta charset='utf-8'>
<link href='../../../exports.css' rel='stylesheet'>
<link href='../../../exports.css' rel='stylesheet'>

</head>
<body>
<div id='wrap'>
<div id='header'>
<h1>hernad</h1>
<h2>This is an archived post
This is an archived post
</h2>
</div>
<div id='content'><div id='nav'>
<a href="../../../posts/2012/06/kako-promijeniti-stanje-bosanskog-poslovnog-i.html">Previous</a>
&nbsp; 
<a href="../../../index-2.html">Index</a>
&nbsp; 
<a href="../../../posts/2012/05/auto-za-sva-vremena.html">Next</a>
</div>
<div class='post'>
<div class='post_header'>
<h3>Traži se menadžer prodaje "bring.out"</h3>
<div class='post_info'>
<span class='post_time'>May 31 2012,  9:18 AM</span>
<span class='author'>&nbsp;by Ernad Husremović</span>
</div>
</div>
<div class='post_body'><p>Već duže vremena razmi&scaron;ljam o osobi koja bi me zamjenila na poslovima koje najmanje volim (i vjerovatno najlo&scaron;ije radim).</p>
<p>Prije par mjeseci sam napisao oglas za posao za <a href="http://hernad.bring.out.ba/trazi-se-knowhow-erp-project-manager">projekt menadžera</a>.</p>
<p>Međutim, u startu sam znao da je traženje takve osobe skoro pa nemoguća misija.</p>
<p>U međuvremenu se mnogo toga izde&scaron;avalo. Bogu hvala, u pozitivnom smislu.</p>
<p>F18, Ubuntu/desktop ... bring.out je napokon "zaokružio" svoju ponudu i iza&scaron;ao sa njom.</p>
<p>Reakcija na&scaron;ih klijenata bila je kranje interesanta. Većina ih pojma nije imala &scaron;ta smo mi posljednjih 10 godina radili. Od onih &scaron;to su ne&scaron;to i znali, većina je na&scaron; koncept razvoja IT rje&scaron;enja uzimala sa kranjom rezervom. Nerijetka su bila odmahivanja sa komentarom:</p>
<blockquote class="posterous_short_quote">
<p>Hah, Ernad i taj njegov linux ...&nbsp;</p>
</blockquote>
<p>Kada smo klijentima počeli slati ponude za Linux/Ubuntu desktop, &nbsp;F18 knowhowERP, Ubuntu serversku infrastrukturu nailazili smo na komentare:</p>
<blockquote class="posterous_short_quote">
<p>Pa zar vi to uop&scaron;te imate ? Otkud to najednom !?</p>
</blockquote>
<p>Zato sam do&scaron;ao do zaključka da je do&scaron;ao vakat da firma počne aktivno djelovati na trži&scaron;tu.</p>
<p>Imamo &scaron;ta ponuditi, na&scaron;a ponuda bazirana na otvorenim tehnologijama ima svoju prođu i svoje mjesto na trži&scaron;tu.</p>
<p><!--more-->Raspolažemo&nbsp;<a href="http://hernad.bring.out.ba/bringout-brand">dugogodi&scaron;njim iskustvom</a>&nbsp;koje samo po sebi predstavlja veliki kapital.</p>
<p>Nakon dugo vremena smo, elhamdulillah, ponovo konkuretni na trži&scaron;tu.</p>
<p>Ta prilika se ne smije ispustiti.</p>
<p><span style="text-decoration: underline; font-size: medium;"><strong>Menadžer prodaje u "bring.out"</strong></span></p>
<p>Mi smo drugačija firma.&nbsp;</p>
<p>Takav treba biti i na&scaron; menadžer prodaje.</p>
<p>On mora razumjeti vijednosti i prednosti na&scaron;e ponude da bi na&scaron;ao prave klijente.</p>
<p>Na&scaron;a ponuda nije za svakoga. Menadžer prodaje treba razumjeti koncept kompatibilnost klijent - vendora.</p>
<p>On ne smije "uvaljivati" na&scaron;e proizvode bilo kome. Nas ne interesuje prodaja i novi klijent bezrezervno.</p>
<p>Na&scaron; menadžer prodaje mora biti osoba otvorenog uma. Osoba koja je će potencijal prodaje bazirati na onome &scaron;to "bring.out" pozitivno diferencira u odnosu na konkurenciju.</p>
<p>Bez ubleha i pamfleta. Bez priče kako smo najbolji i najpametniji. Bez lupetanja kako na&scaron; software radi besprijekorno.&nbsp;</p>
<p>Mi svoj kredibiltet gradimo na činjenici da su BUG-ovi neizbježni dio software-a i da smo mi sposobno BUG-ove u svom software-u brzo i efikasno <a href="http://redmine.bring.out.ba/projects/f18/issues">ispravljati</a>.</p>
<p>"bring.out" je jedini IT provajder u Bosni koji svoju ponudu u potpunosti bazira na otvorenosti i otvorenim tehnologijama.</p>
<p>Na&scaron; menažder prodaje mora razumjeti ZA&Scaron;TO je to na&scaron; pristup.</p>
<p>Na&scaron; menažder prodaje mora razumjeti KOJE su prednosti tog pristupa za na&scaron;eg klijenta.</p>
<p>Na&scaron; menadžer prodaje mora RAZUMJETI ideju i misiju "bring.out".</p></div>
<div class='post_tags'>
<h4>Tags</h4>
<div class='post_tags_list'>bringout, oglas_posao</div>
</div>
<div class='post_responses'>
<h4>1363 views and 1 response</h4>
<ul class='post_responses list'>
<li class='response clearfix'>
<div class='response_header'>
<div class='response_time'>Jun  1 2012, 11:03 AM</div>
<div class='response_name'>Ernad Husremović responded:</div>
</div>
<div class='response_body'><a href="http://forum.linux.org.ba/viewtopic.php?id=6858" rel="nofollow">http://forum.linux.org.ba/viewtopic.php?id=6858</a></div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
